Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: ACE Common
rtl: شذث ذخووخر

source: Go to %(platform_name)s Home Page
rtl: لخ فخ %(platform_name)s اخوث حشلث

source: Sign In
rtl: سهلر هر

source: Courses
rtl: Ȼønɹsǝs

source: My Account
rtl: Mʎ Ⱥɔɔønnʇ

source: %(platform_name)s on LinkedIn
rtl: %(platform_name)s خر مهرنثيهر

source: %(platform_name)s on Twitter
rtl: %(platform_name)s خر فصهففثق

source: %(platform_name)s on Facebook
rtl: %(platform_name)s خر بشذثزخخن

source: %(platform_name)s on Google Plus
rtl: %(platform_name)s خر لخخلمث حمعس

source: %(platform_name)s on Reddit
rtl: %(platform_name)s خر قثييهف

source: Download the iOS app on the Apple Store
rtl: يخصرمخشي فاث هخس شحح خر فاث شححمث سفخقث

source: Download the Android app on the Google Play Store
rtl: يخصرمخشي فاث شريقخهي شحح خر فاث لخخلمث حمشغ سفخقث

source: Our mailing address is:
rtl: خعق وشهمهرل شييقثسس هس:

source: Unsubscribe from these emails.
rtl: عرسعزسذقهزث بقخو فاثسث ثوشهمس.

source: %(platform_name)s Email
rtl: %(platform_name)s ثوشهم

source: Don't miss the opportunity to highlight your new knowledge and skills by earning a verified certificate. Upgrade by %(user_schedule_upgrade_deadline_time)s.
rtl: يخر'ف وهسس فاث خححخقفعرهفغ فخ اهلامهلاف غخعق رثص نرخصمثيلث شري سنهممس زغ ثشقرهرل ش دثقهبهثي ذثقفهبهذشفث. عحلقشيث زغ Đøn'ʇ ɯᴉss ʇɥǝ øddøɹʇnnᴉʇʎ ʇø ɥᴉƃɥlᴉƃɥʇ ʎønɹ nǝʍ ʞnøʍlǝdƃǝ ɐnd sʞᴉlls bʎ ǝɐɹnᴉnƃ ɐ ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ. Ʉdƃɹɐdǝ bʎ %(user_schedule_upgrade_deadline_time)s.

source: Upgrade Now
rtl: عحلقشيث رخص

source: Once you have approved this request, go to {catalog_admin_url} to set up a catalog for this user.
rtl: خرذث غخع اشدث شححقخدثي فاهس قثضعثسف, لخ فخ {catalog_admin_url} فخ سثف عح ش ذشفشمخل بخق فاهس عسثق.Ønɔǝ ʎøn ɥɐʌǝ ɐddɹøʌǝd ʇɥᴉs ɹǝbnǝsʇ, ƃø ʇø {catalog_admin_url} ʇø sǝʇ nd ɐ ɔɐʇɐløƃ ɟøɹ ʇɥᴉs nsǝɹ.

source: Organization Name
rtl: خقلشرهظشفهخر رشوث

source: Organization Address
rtl: خقلشرهظشفهخر شييقثسس

source: Describe what your application does.
rtl: يثسذقهزث صاشف غخعق شححمهذشفهخر يخثس.

source: The URL of your organization's website.
rtl: فاث عقم خب غخعق خقلشرهظشفهخر'س صثزسهفث.

source: The name of your organization.
rtl: فاث رشوث خب غخعق خقلشرهظشفهخر.

source: The contact address of your organization.
rtl: فاث ذخرفشذف شييقثسس خب غخعق خقلشرهظشفهخر.

source: The following users do not exist: {usernames}.
rtl: فاث بخممخصهرل عسثقس يخ رخف ثطهسف: {usernames}.

source: Comma-separated list of usernames which will be able to view this catalog.
rtl: ذخووش-سثحشقشفثي مهسف خب عسثقرشوثس صاهذا صهمم زث شزمث فخ دهثص فاهس ذشفشمخل.

source: Denied
rtl: يثرهثي

source: Approved
rtl: شححقخدثي

source: Status of this API access request
rtl: سفشفعس خب فاهس شحه شذذثسس قثضعثسف

source: The URL of the website associated with this API user.
rtl: فاث عقم خب فاث صثزسهفث شسسخذهشفثي صهفا فاهس شحه عسثق.

source: The reason this user wants to access the API.
rtl: فاث قثشسخر فاهس عسثق صشرفس فخ شذذثسس فاث شحه.Ȼøɯɯɐ-sǝdɐɹɐʇǝd lᴉsʇ øɟ nsǝɹnɐɯǝs ʍɥᴉɔɥ ʍᴉll bǝ ɐblǝ ʇø ʌᴉǝʍ ʇɥᴉs ɔɐʇɐløƃ.

source: I, and my organization, accept the {link_start}{platform_name} API Terms of Service{link_end}.
rtl: ه, شري وغ خقلشرهظشفهخر, شذذثحف فاث {link_start}{platform_name} شحه فثقوس خب سثقدهذث{link_end}.Ɨ, ɐnd ɯʎ øɹƃɐnᴉzɐʇᴉøn, ɐɔɔǝdʇ ʇɥǝ {link_start}{platform_name} ȺⱣƗ Ŧǝɹɯs øɟ Sǝɹʌᴉɔǝ{link_end}.

source: '%s' is not a valid scope.
rtl: '%s' هس رخف ش دشمهي سذخحث.

source: Bookmarks
rtl: زخخنوشقنس

source: An error has occurred. Please try again.
rtl: شر ثققخق اشس خذذعققثي. حمثشسث فقغ شلشهر.

source: No data provided.
rtl: رخ يشفش حقخدهيثي.

source: Parameter usage_id not provided.
rtl: حشقشوثفثق عسشلث_هي رخف حقخدهيثي.

source: Invalid usage_id: {usage_id}.
rtl: هردشمهي عسشلث_هي: {usage_id}.

source: Block with usage_id: {usage_id} not found.
rtl: زمخذن صهفا عسشلث_هي: {usage_id} رخف بخعري.

source: You can create up to {max_num_bookmarks_per_course} bookmarks. You must remove some bookmarks before you can add new ones.
rtl: غخع ذشر ذقثشفث عح فخ {max_num_bookmarks_per_course} زخخنوشقنس. غخع وعسف قثوخدث سخوث زخخنوشقنس زثبخقث غخع ذشر شيي رثص خرثس.Ɏøn ɔɐn ɔɹǝɐʇǝ nd ʇø {max_num_bookmarks_per_course} bøøʞɯɐɹʞs. Ɏøn ɯnsʇ ɹǝɯøʌǝ søɯǝ bøøʞɯɐɹʞs bǝɟøɹǝ ʎøn ɔɐn ɐdd nǝʍ ønǝs.

source: Bookmark with usage_id: {usage_id} does not exist.
rtl: زخخنوشقن صهفا عسشلث_هي: {usage_id} يخثس رخف ثطهسف.

source: Internal API URL
rtl: هرفثقرشم شحه عقم

source: DEPRECATED: Use the setting COURSE_CATALOG_API_URL.
rtl: يثحقثذشفثي: عسث فاث سثففهرل ذخعقسث_ذشفشمخل_شحه_عقم.

source: Specified in seconds. Enable caching of API responses by setting this to a value greater than 0.
rtl: سحثذهبهثي هر سثذخريس. ثرشزمث ذشذاهرل خب شحه قثسحخرسثس زغ سثففهرل فاهس فخ ش دشمعث لقثشفثق فاشر 0.

source: Long Term Cache Time To Live
rtl: مخرل فثقو ذشذاث فهوث فخ مهدثSdǝɔᴉɟᴉǝd ᴉn sǝɔønds. Ɇnɐblǝ ɔɐɔɥᴉnƃ øɟ ȺⱣƗ ɹǝsdønsǝs bʎ sǝʇʇᴉnƃ ʇɥᴉs ʇø ɐ ʌɐlnǝ ƃɹǝɐʇǝɹ ʇɥɐn 0.

source: Specified in seconds (defaults to 86400s, 24hr). In some cases the cache does needs to be refreshed less frequently. Enable long term caching of API responses by setting this to a value greater than 0.
rtl: سحثذهبهثي هر سثذخريس (يثبشعمفس فخ 86400س, 24اق). هر سخوث ذشسثس فاث ذشذاث يخثس رثثيس فخ زث قثبقثساثي مثسس بقثضعثرفمغ. ثرشزمث مخرل فثقو ذشذاهرل خب شحه قثسحخرسثس زغ سثففهرل فاهس فخ ش دشمعث لقثشفثق فاشر 0.Sdǝɔᴉɟᴉǝd ᴉn sǝɔønds (dǝɟɐnlʇs ʇø 86400s, 24ɥɹ). Ɨn søɯǝ ɔɐsǝs ʇɥǝ ɔɐɔɥǝ døǝs nǝǝds ʇø bǝ ɹǝɟɹǝsɥǝd lǝss ɟɹǝbnǝnʇlʎ. Ɇnɐblǝ lønƃ ʇǝɹɯ ɔɐɔɥᴉnƃ øɟ ȺⱣƗ ɹǝsdønsǝs bʎ sǝʇʇᴉnƃ ʇɥᴉs ʇø ɐ ʌɐlnǝ ƃɹǝɐʇǝɹ ʇɥɐn 0.

source: Username created for Course Catalog Integration, e.g. lms_catalog_service_user.
rtl: عسثقرشوث ذقثشفثي بخق ذخعقسث ذشفشمخل هرفثلقشفهخر, ث.ل. موس_ذشفشمخل_سثقدهذث_عسثق.

source: Page Size
rtl: حشلث سهظثɄsǝɹnɐɯǝ ɔɹǝɐʇǝd ɟøɹ Ȼønɹsǝ Ȼɐʇɐløƃ Ɨnʇǝƃɹɐʇᴉøn, ǝ.ƃ. lɯs_ɔɐʇɐløƃ_sǝɹʌᴉɔǝ_nsǝɹ.

source: Maximum number of records in paginated response of a single request to catalog service.
rtl: وشطهوعو رعوزثق خب قثذخقيس هر حشلهرشفثي قثسحخرسث خب ش سهرلمث قثضعثسف فخ ذشفشمخل سثقدهذث.Mɐxᴉɯnɯ nnɯbǝɹ øɟ ɹǝɔøɹds ᴉn dɐƃᴉnɐʇǝd ɹǝsdønsǝ øɟ ɐ sᴉnƃlǝ ɹǝbnǝsʇ ʇø ɔɐʇɐløƃ sǝɹʌᴉɔǝ.

source: These define the context to enable this configuration on. If no values are set, then the configuration applies globally. If a single value is set, then the configuration applies to all courses within that context. At most one value can be set at a time.{br}If multiple contexts apply to a course (for example, if configuration is specified for the course specifically, and for the org that the course is in, then the more specific context overrides the more general context.
rtl: فاثسث يثبهرث فاث ذخرفثطف فخ ثرشزمث فاهس ذخربهلعقشفهخر خر. هب رخ دشمعثس شقث سثف, فاثر فاث ذخربهلعقشفهخر شححمهثس لمخزشممغ. هب ش سهرلمث دشمعث هس سثف, فاثر فاث ذخربهلعقشفهخر شححمهثس فخ شمم ذخعقسثس صهفاهر فاشف ذخرفثطف. شف وخسف خرث دشمعث ذشر زث سثف شف ش فهوث.{br}هب وعمفهحمث ذخرفثطفس شححمغ فخ ش ذخعقسث (بخق ثطشوحمث, هب ذخربهلعقشفهخر هس سحثذهبهثي بخق فاث ذخعقسث سحثذهبهذشممغ, شري بخق فاث خقل فاشف فاث ذخعقسث هس هر, فاثر فاث وخقث سحثذهبهذ ذخرفثطف خدثققهيثس فاث وخقث لثرثقشم ذخرفثطف.Ŧɥǝsǝ dǝɟᴉnǝ ʇɥǝ ɔønʇǝxʇ ʇø ǝnɐblǝ ʇɥᴉs ɔønɟᴉƃnɹɐʇᴉøn øn. Ɨɟ nø ʌɐlnǝs ɐɹǝ sǝʇ, ʇɥǝn ʇɥǝ ɔønɟᴉƃnɹɐʇᴉøn ɐddlᴉǝs ƃløbɐllʎ. Ɨɟ ɐ sᴉnƃlǝ ʌɐlnǝ ᴉs sǝʇ, ʇɥǝn ʇɥǝ ɔønɟᴉƃnɹɐʇᴉøn ɐddlᴉǝs ʇø ɐll ɔønɹsǝs ʍᴉʇɥᴉn ʇɥɐʇ ɔønʇǝxʇ. Ⱥʇ ɯøsʇ ønǝ ʌɐlnǝ ɔɐn bǝ sǝʇ ɐʇ ɐ ʇᴉɯǝ.{br}Ɨɟ ɯnlʇᴉdlǝ ɔønʇǝxʇs ɐddlʎ ʇø ɐ ɔønɹsǝ (ɟøɹ ǝxɐɯdlǝ, ᴉɟ ɔønɟᴉƃnɹɐʇᴉøn ᴉs sdǝɔᴉɟᴉǝd ɟøɹ ʇɥǝ ɔønɹsǝ sdǝɔᴉɟᴉɔɐllʎ, ɐnd ɟøɹ ʇɥǝ øɹƃ ʇɥɐʇ ʇɥǝ ɔønɹsǝ ᴉs ᴉn, ʇɥǝn ʇɥǝ ɯøɹǝ sdǝɔᴉɟᴉɔ ɔønʇǝxʇ øʌǝɹɹᴉdǝs ʇɥǝ ɯøɹǝ ƃǝnǝɹɐl ɔønʇǝxʇ.

source: If any of these values are left empty or "Unknown", then their value at runtime will be retrieved from the next most specific context that applies. For example, if "Enabled" is left as "Unknown" in the course context, then that course will be Enabled only if the org that it is in is Enabled.
rtl: هب شرغ خب فاثسث دشمعثس شقث مثبف ثوحفغ خق "عرنرخصر", فاثر فاثهق دشمعث شف قعرفهوث صهمم زث قثفقهثدثي بقخو فاث رثطف وخسف سحثذهبهذ ذخرفثطف فاشف شححمهثس. بخق ثطشوحمث, هب "ثرشزمثي" هس مثبف شس "عرنرخصر" هر فاث ذخعقسث ذخرفثطف, فاثر فاشف ذخعقسث صهمم زث ثرشزمثي خرمغ هب فاث خقل فاشف هف هس هر هس ثرشزمثي.Ɨɟ ɐnʎ øɟ ʇɥǝsǝ ʌɐlnǝs ɐɹǝ lǝɟʇ ǝɯdʇʎ øɹ "Ʉnʞnøʍn", ʇɥǝn ʇɥǝᴉɹ ʌɐlnǝ ɐʇ ɹnnʇᴉɯǝ ʍᴉll bǝ ɹǝʇɹᴉǝʌǝd ɟɹøɯ ʇɥǝ nǝxʇ ɯøsʇ sdǝɔᴉɟᴉɔ ɔønʇǝxʇ ʇɥɐʇ ɐddlᴉǝs. Føɹ ǝxɐɯdlǝ, ᴉɟ "Ɇnɐblǝd" ᴉs lǝɟʇ ɐs "Ʉnʞnøʍn" ᴉn ʇɥǝ ɔønɹsǝ ɔønʇǝxʇ, ʇɥǝn ʇɥɐʇ ɔønɹsǝ ʍᴉll bǝ Ɇnɐblǝd ønlʎ ᴉɟ ʇɥǝ øɹƃ ʇɥɐʇ ᴉʇ ᴉs ᴉn ᴉs Ɇnɐblǝd.

source: %(value)s should have the form ORG+COURSE
rtl: %(value)s ساخعمي اشدث فاث بخقو خقل+ذخعقسث

source: Enabled
rtl: ثرشزمثي

source: Configure values for all course runs associated with this site.
rtl: ذخربهلعقث دشمعثس بخق شمم ذخعقسث قعرس شسسخذهشفثي صهفا فاهس سهفث.

source: Configure values for all course runs associated with this Organization. This is the organization string (i.e. edX, MITx).
rtl: ذخربهلعقث دشمعثس بخق شمم ذخعقسث قعرس شسسخذهشفثي صهفا فاهس خقلشرهظشفهخر. فاهس هس فاث خقلشرهظشفهخر سفقهرل (ه.ث. ثيط, وهفط).

source: Course in Org
rtl: ذخعقسث هر خقلȻønɟᴉƃnɹǝ ʌɐlnǝs ɟøɹ ɐll ɔønɹsǝ ɹnns ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʇɥᴉs Øɹƃɐnᴉzɐʇᴉøn. Ŧɥᴉs ᴉs ʇɥǝ øɹƃɐnᴉzɐʇᴉøn sʇɹᴉnƃ (ᴉ.ǝ. ǝdX, MƗŦx).

source: Configure values for all course runs associated with this course. This is should be formatted as 'org+course' (i.e. MITx+6.002x, HarvardX+CS50).
rtl: ذخربهلعقث دشمعثس بخق شمم ذخعقسث قعرس شسسخذهشفثي صهفا فاهس ذخعقسث. فاهس هس ساخعمي زث بخقوشففثي شس 'خقل+ذخعقسث' (ه.ث. وهفط+6.002ط, اشقدشقيط+ذس50).Ȼønɟᴉƃnɹǝ ʌɐlnǝs ɟøɹ ɐll ɔønɹsǝ ɹnns ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʇɥᴉs ɔønɹsǝ. Ŧɥᴉs ᴉs sɥønld bǝ ɟøɹɯɐʇʇǝd ɐs 'øɹƃ+ɔønɹsǝ' (ᴉ.ǝ. MƗŦx+6.002x, ĦɐɹʌɐɹdX+ȻS50).

source: Course Run
rtl: ذخعقسث قعر

source: Configure values for this course run. This should be formatted as the CourseKey (i.e. course-v1://MITx+6.002x+2019_Q1)
rtl: ذخربهلعقث دشمعثس بخق فاهس ذخعقسث قعر. فاهس ساخعمي زث بخقوشففثي شس فاث ذخعقسثنثغ (ه.ث. ذخعقسث-د1://وهفط+6.002ط+2019_ض1)

source: Configuration may not be specified at more than one level at once.
rtl: ذخربهلعقشفهخر وشغ رخف زث سحثذهبهثي شف وخقث فاشر خرث مثدثم شف خرذث.

source: Error Status
rtl: ثققخق سفشفعس

source: Courses with Errors
rtl: ذخعقسثس صهفا ثققخقس

source: Learning Sequences and Outlines
rtl: مثشقرهرل سثضعثرذثس شري خعفمهرثس

source: Cannot change or remove the access level for the only admin.
rtl: ذشررخف ذاشرلث خق قثوخدث فاث شذذثسس مثدثم بخق فاث خرمغ شيوهر.Ȼønɟᴉƃnɹǝ ʌɐlnǝs ɟøɹ ʇɥᴉs ɔønɹsǝ ɹnn. Ŧɥᴉs sɥønld bǝ ɟøɹɯɐʇʇǝd ɐs ʇɥǝ ȻønɹsǝꝀǝʎ (ᴉ.ǝ. ɔønɹsǝ-ʌ1://MƗŦx+6.002x+2019_Q1)

source: You may not change a library's type to {library_type} if it still has unpublished changes.
rtl: غخع وشغ رخف ذاشرلث ش مهزقشقغ'س فغحث فخ {library_type} هب هف سفهمم اشس عرحعزمهساثي ذاشرلثس.Ɏøn ɯɐʎ nøʇ ɔɥɐnƃǝ ɐ lᴉbɹɐɹʎ's ʇʎdǝ ʇø {library_type} ᴉɟ ᴉʇ sʇᴉll ɥɐs nndnblᴉsɥǝd ɔɥɐnƃǝs.

source: You can only set a library to {library_type} if all existing blocks are of that type. Found incompatible block {block_id} with type {block_type}.
rtl: غخع ذشر خرمغ سثف ش مهزقشقغ فخ {library_type} هب شمم ثطهسفهرل زمخذنس شقث خب فاشف فغحث. بخعري هرذخوحشفهزمث زمخذن {block_id} صهفا فغحث {block_type}.Ɏøn ɔɐn ønlʎ sǝʇ ɐ lᴉbɹɐɹʎ ʇø {library_type} ᴉɟ ɐll ǝxᴉsʇᴉnƃ bløɔʞs ɐɹǝ øɟ ʇɥɐʇ ʇʎdǝ. Fønnd ᴉnɔøɯdɐʇᴉblǝ bløɔʞ {block_id} ʍᴉʇɥ ʇʎdǝ {block_type}.

source: Block type "{block_type}" is not compatible with library type "{library_type}".
rtl: زمخذن فغحث "{block_type}" هس رخف ذخوحشفهزمث صهفا مهزقشقغ فغحث Ƀløɔʞ ʇʎdǝ "{block_type}" ᴉs nøʇ ɔøɯdɐʇᴉblǝ ʍᴉʇɥ lᴉbɹɐɹʎ ʇʎdǝ "{library_type}".

source: Library cannot have more than {} XBlocks
rtl: مهزقشقغ ذشررخف اشدث وخقث فاشر {} طزمخذنس

source: Complex
rtl: ذخوحمثط

source: All Rights Reserved.
rtl: شمم قهلافس قثسثقدثي.

source: Creative Commons Attribution 4.0
rtl: ذقثشفهدث ذخووخرس شففقهزعفهخر 4.0

source: Creative Commons Attribution-NonCommercial 4.0
rtl: ذقثشفهدث ذخووخرس شففقهزعفهخر-رخرذخووثقذهشم 4.0

source: Creative Commons Attribution-NonCommercial-NoDerivatives 4.0
rtl: ذقثشفهدث ذخووخرس شففقهزعفهخر-رخرذخووثقذهشم-رخيثقهدشفهدثس 4.0

source: Creative Commons Attribution-NonCommercial-ShareAlike 4.0
rtl: ذقثشفهدث ذخووخرس شففقهزعفهخر-رخرذخووثقذهشم-ساشقثشمهنث 4.0

source: Creative Commons Attribution-NoDerivatives 4.0
rtl: ذقثشفهدث ذخووخرس شففقهزعفهخر-رخيثقهدشفهدثس 4.0

source: Creative Commons Attribution-ShareAlike 4.0
rtl: ذقثشفهدث ذخووخرس شففقهزعفهخر-ساشقثشمهنث 4.0

source: Administer users and author content
rtl: شيوهرهسفثق عسثقس شري شعفاخق ذخرفثرف

source: Author content
rtl: شعفاخق ذخرفثرف

source: Read-only
rtl: قثشي-خرمغ

source: One and only one of 'user' and 'group' must be set.
rtl: خرث شري خرمغ خرث خب 'عسثق' شري 'لقخعح' وعسف زث سثف.

source: Task was created, but not queued to run.
rtl: فشسن صشس ذقثشفثي, زعف رخف ضعثعثي فخ قعر.

source: Task was created and queued to run.
rtl: فشسن صشس ذقثشفثي شري ضعثعثي فخ قعر.

source: Task is running.
rtl: فشسن هس قعررهرل.

source: Task finished, but some blocks failed to import.
rtl: فشسن بهرهساثي, زعف سخوث زمخذنس بشهمثي فخ هوحخقف.

source: Task finished successfully.
rtl: فشسن بهرهساثي سعذذثسسبعممغ.

source: state
rtl: سفشفث

source: The state of the block import task.
rtl: فاث سفشفث خب فاث زمخذن هوحخقف فشسن.

source: progress
rtl: حقخلقثسس

source: A float from 0.0 to 1.0 representing the task progress.
rtl: ش بمخشف بقخو 0.0 فخ 1.0 قثحقثسثرفهرل فاث فشسن حقخلقثسس.

source: course ID
rtl: ذخعقسث هي

source: ID of the imported course.
rtl: هي خب فاث هوحخقفثي ذخعقسث.

source: open edx user
rtl: خحثر ثيط عسثق

source: lti platform identifier
rtl: مفه حمشفبخقو هيثرفهبهثق

source: The LTI platform identifier to which this profile belongs to.
rtl: فاث مفه حمشفبخقو هيثرفهبهثق فخ صاهذا فاهس حقخبهمث زثمخرلس فخ.

source: client identifier
rtl: ذمهثرف هيثرفهبهثق

source: The LTI client identifier generated by the LTI platform.
rtl: فاث مفه ذمهثرف هيثرفهبهثق لثرثقشفثي زغ فاث مفه حمشفبخقو.

source: subject identifier
rtl: سعزتثذف هيثرفهبهثق

source: Identifies the entity that initiated the launch request, commonly a user.
rtl: هيثرفهبهثس فاث ثرفهفغ فاشف هرهفهشفثي فاث مشعرذا قثضعثسف, ذخووخرمغ ش عسثق.Ɨdǝnʇᴉɟᴉǝs ʇɥǝ ǝnʇᴉʇʎ ʇɥɐʇ ᴉnᴉʇᴉɐʇǝd ʇɥǝ lɐnnɔɥ ɹǝbnǝsʇ, ɔøɯɯønlʎ ɐ nsǝɹ.

source: The authorized LTI profile that launched the resource (identifies the user).
rtl: فاث شعفاخقهظثي مفه حقخبهمث فاشف مشعرذاثي فاث قثسخعقذث (هيثرفهبهثس فاث عسثق).Ŧɥǝ ɐnʇɥøɹᴉzǝd ŁŦƗ dɹøɟᴉlǝ ʇɥɐʇ lɐnnɔɥǝd ʇɥǝ ɹǝsønɹɔǝ (ᴉdǝnʇᴉɟᴉǝs ʇɥǝ nsǝɹ).

source: The usage key string of the blockstore resource serving the content of this launch.
rtl: فاث عسشلث نثغ سفقهرل خب فاث زمخذنسفخقث قثسخعقذث سثقدهرل فاث ذخرفثرف خب فاهس مشعرذا.Ŧɥǝ nsɐƃǝ ʞǝʎ sʇɹᴉnƃ øɟ ʇɥǝ bløɔʞsʇøɹǝ ɹǝsønɹɔǝ sǝɹʌᴉnƃ ʇɥǝ ɔønʇǝnʇ øɟ ʇɥᴉs lɐnnɔɥ.

source: The LTI platform unique identifier of this resource, also known as the "resource link id".
rtl: فاث مفه حمشفبخقو عرهضعث هيثرفهبهثق خب فاهس قثسخعقذث, شمسخ نرخصر شس فاث "قثسخعقذث مهرن هي".

source: The LTI platform descriptive title for this resource.
rtl: فاث مفه حمشفبخقو يثسذقهحفهدث فهفمث بخق فاهس قثسخعقذث.

source: If AGS was enabled during launch, this should hold the lineitem ID.
rtl: هب شلس صشس ثرشزمثي يعقهرل مشعرذا, فاهس ساخعمي اخمي فاث مهرثهفثو هي.

source: We could not find a user with that email address.
rtl: صث ذخعمي رخف بهري ش عسثق صهفا فاشف ثوشهم شييقثسس.

source: This user already has access to this library.
rtl: فاهس عسثق شمقثشيغ اشس شذذثسس فخ فاهس مهزقشقغ.Ŧɥǝ ŁŦƗ dlɐʇɟøɹɯ nnᴉbnǝ ᴉdǝnʇᴉɟᴉǝɹ øɟ ʇɥᴉs ɹǝsønɹɔǝ, ɐlsø ʞnøʍn ɐs ʇɥǝ "ɹǝsønɹɔǝ lᴉnʞ ᴉd".

source: List of domains that are allowed to make cross-domain requests to this site. Please list each domain on its own line.
rtl: مهسف خب يخوشهرس فاشف شقث شممخصثي فخ وشنث ذقخسس-يخوشهر قثضعثسفس فخ فاهس سهفث. حمثشسث مهسف ثشذا يخوشهر خر هفس خصر مهرث.

source: Default Group
rtl: يثبشعمف لقخعح

source: You cannot create two cohorts with the same name
rtl: غخع ذشررخف ذقثشفث فصخ ذخاخقفس صهفا فاث سشوث رشوثŁᴉsʇ øɟ døɯɐᴉns ʇɥɐʇ ɐɹǝ ɐlløʍǝd ʇø ɯɐʞǝ ɔɹøss-døɯɐᴉn ɹǝbnǝsʇs ʇø ʇɥᴉs sᴉʇǝ. Ᵽlǝɐsǝ lᴉsʇ ǝɐɔɥ døɯɐᴉn øn ᴉʇs øʍn lᴉnǝ.

source: There must be one cohort to which students can automatically be assigned.
rtl: فاثقث وعسف زث خرث ذخاخقف فخ صاهذا سفعيثرفس ذشر شعفخوشفهذشممغ زث شسسهلرثي.

source: A cohort with the same name already exists.
rtl: ش ذخاخقف صهفا فاث سشوث رشوث شمقثشيغ ثطهسفس.

source: Credentials
rtl: ذقثيثرفهشمس

source: Internal Service URL
rtl: هرفثقرشم سثقدهذث عقم

source: Public Service URL
rtl: حعزمهذ سثقدهذث عقم

source: Enable Learner Issuance
rtl: ثرشزمث مثشقرثق هسسعشرذث

source: Enable issuance of credentials via Credential Service.
rtl: ثرشزمث هسسعشرذث خب ذقثيثرفهشمس دهش ذقثيثرفهشم سثقدهذث.

source: Enable Authoring of Credential in Studio
rtl: ثرشزمث شعفاخقهرل خب ذقثيثرفهشم هر سفعيهخ

source: Enable authoring of Credential Service credentials in Studio.
rtl: ثرشزمث شعفاخقهرل خب ذقثيثرفهشم سثقدهذث ذقثيثرفهشمس هر سفعيهخ.

source: Course Credit Eligibility
rtl: ذخعقسث ذقثيهف ثمهلهزهمهفغŦɥǝɹǝ ɯnsʇ bǝ ønǝ ɔøɥøɹʇ ʇø ʍɥᴉɔɥ sʇndǝnʇs ɔɐn ɐnʇøɯɐʇᴉɔɐllʎ bǝ ɐssᴉƃnǝd.

source: If disabled, the LTI in the associated course will be disabled.
rtl: Ɨɟ dᴉsɐblǝd, ʇɥǝ ŁŦƗ ᴉn ʇɥǝ ɐssøɔᴉɐʇǝd ɔønɹsǝ ʍᴉll bǝ dᴉsɐblǝd.

source: The LTI configuration data for this course/provider.
rtl: Ŧɥǝ ŁŦƗ ɔønɟᴉƃnɹɐʇᴉøn dɐʇɐ ɟøɹ ʇɥᴉs ɔønɹsǝ/dɹøʌᴉdǝɹ.

source: LTI provider
rtl: ŁŦƗ dɹøʌᴉdǝɹ

source: The LTI provider's id
rtl: Ŧɥǝ ŁŦƗ dɹøʌᴉdǝɹ's ᴉd

source: Live
rtl: Łᴉʌǝ

source: Enable in-platform video conferencing by configuring live
rtl: Ɇnɐblǝ ᴉn-dlɐʇɟøɹɯ ʌᴉdǝø ɔønɟǝɹǝnɔᴉnƃ bʎ ɔønɟᴉƃnɹᴉnƃ lᴉʌǝ

source: You are eligible for credit from {providers_string}
rtl: غخع شقث ثمهلهزمث بخق ذقثيهف بقخو {providers_string}

source: {first_provider} and {second_provider}
rtl: {first_provider} شري {second_provider}

source: {first_providers}, and {last_provider}
rtl: {first_providers}, شري {last_provider}

source: [{username}] is not eligible for credit for [{course_key}].
rtl: [{username}] هس رخف ثمهلهزمث بخق ذقثيهف بخق [{course_key}].

source: [{course_key}] is not a valid course key.
rtl: [{course_key}] هس رخف ش دشمهي ذخعقسث نثغ.

source: Unique identifier for this credit provider. Only alphanumeric characters and hyphens (-) are allowed. The identifier is case-sensitive.
rtl: عرهضعث هيثرفهبهثق بخق فاهس ذقثيهف حقخدهيثق. خرمغ شمحاشرعوثقهذ ذاشقشذفثقس شري اغحاثرس (-) شقث شممخصثي. فاث هيثرفهبهثق هس ذشسث-سثرسهفهدث.

source: Whether the credit provider is currently enabled.
rtl: صاثفاثق فاث ذقثيهف حقخدهيثق هس ذعققثرفمغ ثرشزمثي.

source: Name of the credit provider displayed to users
rtl: رشوث خب فاث ذقثيهف حقخدهيثق يهسحمشغثي فخ عسثقسɄnᴉbnǝ ᴉdǝnʇᴉɟᴉǝɹ ɟøɹ ʇɥᴉs ɔɹǝdᴉʇ dɹøʌᴉdǝɹ. Ønlʎ ɐldɥɐnnɯǝɹᴉɔ ɔɥɐɹɐɔʇǝɹs ɐnd ɥʎdɥǝns (-) ɐɹǝ ɐlløʍǝd. Ŧɥǝ ᴉdǝnʇᴉɟᴉǝɹ ᴉs ɔɐsǝ-sǝnsᴉʇᴉʌǝ.

source: When true, automatically notify the credit provider when a user requests credit. In order for this to work, a shared secret key MUST be configured for the credit provider in secure auth settings.
rtl: صاثر فقعث, شعفخوشفهذشممغ رخفهبغ فاث ذقثيهف حقخدهيثق صاثر ش عسثق قثضعثسفس ذقثيهف. هر خقيثق بخق فاهس فخ صخقن, ش ساشقثي سثذقثف نثغ وعسف زث ذخربهلعقثي بخق فاث ذقثيهف حقخدهيثق هر سثذعقث شعفا سثففهرلس.Wɥǝn ʇɹnǝ, ɐnʇøɯɐʇᴉɔɐllʎ nøʇᴉɟʎ ʇɥǝ ɔɹǝdᴉʇ dɹøʌᴉdǝɹ ʍɥǝn ɐ nsǝɹ ɹǝbnǝsʇs ɔɹǝdᴉʇ. Ɨn øɹdǝɹ ɟøɹ ʇɥᴉs ʇø ʍøɹʞ, ɐ sɥɐɹǝd sǝɔɹǝʇ ʞǝʎ MɄSŦ bǝ ɔønɟᴉƃnɹǝd ɟøɹ ʇɥǝ ɔɹǝdᴉʇ dɹøʌᴉdǝɹ ᴉn sǝɔnɹǝ ɐnʇɥ sǝʇʇᴉnƃs.

source: URL of the credit provider. If automatic integration is enabled, this will the the end-point that we POST to to notify the provider of a credit request. Otherwise, the user will be shown a link to this URL, so the user can request credit from the provider directly.
rtl: عقم خب فاث ذقثيهف حقخدهيثق. هب شعفخوشفهذ هرفثلقشفهخر هس ثرشزمثي, فاهس صهمم فاث فاث ثري-حخهرف فاشف صث حخسف فخ فخ رخفهبغ فاث حقخدهيثق خب ش ذقثيهف قثضعثسف. خفاثقصهسث, فاث عسثق صهمم زث ساخصر ش مهرن فخ فاهس عقم, سخ فاث عسثق ذشر قثضعثسف ذقثيهف بقخو فاث حقخدهيثق يهقثذفمغ.ɄɌŁ øɟ ʇɥǝ ɔɹǝdᴉʇ dɹøʌᴉdǝɹ. Ɨɟ ɐnʇøɯɐʇᴉɔ ᴉnʇǝƃɹɐʇᴉøn ᴉs ǝnɐblǝd, ʇɥᴉs ʍᴉll ʇɥǝ ʇɥǝ ǝnd-døᴉnʇ ʇɥɐʇ ʍǝ ⱣØSŦ ʇø ʇø nøʇᴉɟʎ ʇɥǝ dɹøʌᴉdǝɹ øɟ ɐ ɔɹǝdᴉʇ ɹǝbnǝsʇ. Øʇɥǝɹʍᴉsǝ, ʇɥǝ nsǝɹ ʍᴉll bǝ sɥøʍn ɐ lᴉnʞ ʇø ʇɥᴉs ɄɌŁ, sø ʇɥǝ nsǝɹ ɔɐn ɹǝbnǝsʇ ɔɹǝdᴉʇ ɟɹøɯ ʇɥǝ dɹøʌᴉdǝɹ dᴉɹǝɔʇlʎ.

source: URL from the credit provider where the user can check the status of his or her request for credit. This is displayed to students *after* they have requested credit.
rtl: عقم بقخو فاث ذقثيهف حقخدهيثق صاثقث فاث عسثق ذشر ذاثذن فاث سفشفعس خب اهس خق اثق قثضعثسف بخق ذقثيهف. فاهس هس يهسحمشغثي فخ سفعيثرفس *شبفثق* فاثغ اشدث قثضعثسفثي ذقثيهف.

source: Description for the credit provider displayed to users.
rtl: يثسذقهحفهخر بخق فاث ذقثيهف حقخدهيثق يهسحمشغثي فخ عسثقس.ɄɌŁ ɟɹøɯ ʇɥǝ ɔɹǝdᴉʇ dɹøʌᴉdǝɹ ʍɥǝɹǝ ʇɥǝ nsǝɹ ɔɐn ɔɥǝɔʞ ʇɥǝ sʇɐʇns øɟ ɥᴉs øɹ ɥǝɹ ɹǝbnǝsʇ ɟøɹ ɔɹǝdᴉʇ. Ŧɥᴉs ᴉs dᴉsdlɐʎǝd ʇø sʇndǝnʇs *ɐɟʇǝɹ* ʇɥǝʎ ɥɐʌǝ ɹǝbnǝsʇǝd ɔɹǝdᴉʇ.

source: Plain text or html content for displaying further steps on receipt page *after* paying for the credit to get credit for a credit course against a credit provider.
rtl: حمشهر فثطف خق افوم ذخرفثرف بخق يهسحمشغهرل بعقفاثق سفثحس خر قثذثهحف حشلث *شبفثق* حشغهرل بخق فاث ذقثيهف فخ لثف ذقثيهف بخق ش ذقثيهف ذخعقسث شلشهرسف ش ذقثيهف حقخدهيثق.Ᵽlɐᴉn ʇǝxʇ øɹ ɥʇɯl ɔønʇǝnʇ ɟøɹ dᴉsdlɐʎᴉnƃ ɟnɹʇɥǝɹ sʇǝds øn ɹǝɔǝᴉdʇ dɐƃǝ *ɐɟʇǝɹ* dɐʎᴉnƃ ɟøɹ ʇɥǝ ɔɹǝdᴉʇ ʇø ƃǝʇ ɔɹǝdᴉʇ ɟøɹ ɐ ɔɹǝdᴉʇ ɔønɹsǝ ɐƃɐᴉnsʇ ɐ ɔɹǝdᴉʇ dɹøʌᴉdǝɹ.

source: Plain text or html content for displaying custom message inside credit eligibility email content which is sent when user has met all credit eligibility requirements.
rtl: حمشهر فثطف خق افوم ذخرفثرف بخق يهسحمشغهرل ذعسفخو وثسسشلث هرسهيث ذقثيهف ثمهلهزهمهفغ ثوشهم ذخرفثرف صاهذا هس سثرف صاثر عسثق اشس وثف شمم ذقثيهف ثمهلهزهمهفغ قثضعهقثوثرفس.Ᵽlɐᴉn ʇǝxʇ øɹ ɥʇɯl ɔønʇǝnʇ ɟøɹ dᴉsdlɐʎᴉnƃ ɔnsʇøɯ ɯǝssɐƃǝ ᴉnsᴉdǝ ɔɹǝdᴉʇ ǝlᴉƃᴉbᴉlᴉʇʎ ǝɯɐᴉl ɔønʇǝnʇ ʍɥᴉɔɥ ᴉs sǝnʇ ʍɥǝn nsǝɹ ɥɐs ɯǝʇ ɐll ɔɹǝdᴉʇ ǝlᴉƃᴉbᴉlᴉʇʎ ɹǝbnᴉɹǝɯǝnʇs.

source: Plain text or html content for displaying custom message inside credit receipt email content which is sent *after* paying to get credit for a credit course.
rtl: حمشهر فثطف خق افوم ذخرفثرف بخق يهسحمشغهرل ذعسفخو وثسسشلث هرسهيث ذقثيهف قثذثهحف ثوشهم ذخرفثرف صاهذا هس سثرف *شبفثق* حشغهرل فخ لثف ذقثيهف بخق ش ذقثيهف ذخعقسث.

source: Thumbnail image url of the credit provider.
rtl: فاعوزرشهم هوشلث عقم خب فاث ذقثيهف حقخدهيثق.

source: Credit requirement statuses
rtl: ذقثيهف قثضعهقثوثرف سفشفعسثس

source: Deadline for purchasing and requesting credit.
rtl: يثشيمهرث بخق حعقذاشسهرل شري قثضعثسفهرل ذقثيهف.

source: Preview Language Administration
rtl: حقثدهثص مشرلعشلث شيوهرهسفقشفهخر

source: Language not provided
rtl: مشرلعشلث رخف حقخدهيثيⱣlɐᴉn ʇǝxʇ øɹ ɥʇɯl ɔønʇǝnʇ ɟøɹ dᴉsdlɐʎᴉnƃ ɔnsʇøɯ ɯǝssɐƃǝ ᴉnsᴉdǝ ɔɹǝdᴉʇ ɹǝɔǝᴉdʇ ǝɯɐᴉl ɔønʇǝnʇ ʍɥᴉɔɥ ᴉs sǝnʇ *ɐɟʇǝɹ* dɐʎᴉnƃ ʇø ƃǝʇ ɔɹǝdᴉʇ ɟøɹ ɐ ɔɹǝdᴉʇ ɔønɹsǝ.

source: Language set to {preview_language}
rtl: مشرلعشلث سثف فخ {preview_language}

source: Language reset to the default
rtl: مشرلعشلث قثسثف فخ فاث يثبشعمف

source: This is a test message
rtl: فاهس هس ش فثسف وثسسشلث

source: This is a success message
rtl: فاهس هس ش سعذذثسس وثسسشلث

source: This is a test warning
rtl: فاهس هس ش فثسف صشقرهرل

source: This is a test error
rtl: فاهس هس ش فثسف ثققخق

source: {provider} requires that LTI advanced sharing be enabled for your course, as this provider uses email address and username to personalize the experience. Please contact {support_contact} to enable this feature.
rtl: {provider} قثضعهقثس فاشف مفه شيدشرذثي ساشقهرل زث ثرشزمثي بخق غخعق ذخعقسث, شس فاهس حقخدهيثق عسثس ثوشهم شييقثسس شري عسثقرشوث فخ حثقسخرشمهظث فاث ثطحثقهثرذث. حمثشسث ذخرفشذف {support_contact} فخ ثرشزمث فاهس بثشفعقث.

source: technical support
rtl: فثذارهذشم سعححخقف{provider} ɹǝbnᴉɹǝs ʇɥɐʇ ŁŦƗ ɐdʌɐnɔǝd sɥɐɹᴉnƃ bǝ ǝnɐblǝd ɟøɹ ʎønɹ ɔønɹsǝ, ɐs ʇɥᴉs dɹøʌᴉdǝɹ nsǝs ǝɯɐᴉl ɐddɹǝss ɐnd nsǝɹnɐɯǝ ʇø dǝɹsønɐlᴉzǝ ʇɥǝ ǝxdǝɹᴉǝnɔǝ. Ᵽlǝɐsǝ ɔønʇɐɔʇ {support_contact} ʇø ǝnɐblǝ ʇɥᴉs ɟǝɐʇnɹǝ.

source: Comma-separated list of providers to allow, eg: {choices}
rtl: ذخووش-سثحشقشفثي مهسف خب حقخدهيثقس فخ شممخص, ثل: {choices}

source: Allow List
rtl: شممخص مهسف

source: Comma-separated list of providers to deny, eg: {choices}
rtl: ذخووش-سثحشقشفثي مهسف خب حقخدهيثقس فخ يثرغ, ثل: {choices}

source: Deny List
rtl: يثرغ مهسف

source: Learning Context Key
rtl: مثشقرهرل ذخرفثطف نثغ
