Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: This learner does not have access to this course. Their access expired on {expiration_date}.
rtl: فاهس مثشقرثق يخثس رخف اشدث شذذثسس فخ فاهس ذخعقسث. فاثهق شذذثسس ثطحهقثي خر Ŧɥᴉs lǝɐɹnǝɹ døǝs nøʇ ɥɐʌǝ ɐɔɔǝss ʇø ʇɥᴉs ɔønɹsǝ. Ŧɥǝᴉɹ ɐɔɔǝss ǝxdᴉɹǝd øn {expiration_date}.

source: {strong_open}Audit Access Expires {expiration_date}{strong_close}{line_break}You lose all access to this course, including your progress, on {expiration_date}.
rtl: {strong_open}شعيهف شذذثسس ثطحهقثس {expiration_date}{strong_close}{line_break}غخع مخسث شمم شذذثسس فخ فاهس ذخعقسث, هرذمعيهرل غخعق حقخلقثسس, خر {expiration_date}.{strong_open}Ⱥndᴉʇ Ⱥɔɔǝss Ɇxdᴉɹǝs {expiration_date}{strong_close}{line_break}Ɏøn løsǝ ɐll ɐɔɔǝss ʇø ʇɥᴉs ɔønɹsǝ, ᴉnɔlndᴉnƃ ʎønɹ dɹøƃɹǝss, øn {expiration_date}.

source: {line_break}Upgrade by {upgrade_deadline} to get unlimited access to the course as long as it exists on the site. {a_open}Upgrade now{sronly_span_open} to retain access past {expiration_date}{span_close}{a_close}
rtl: {line_break}عحلقشيث زغ {upgrade_deadline} فخ لثف عرمهوهفثي شذذثسس فخ فاث ذخعقسث شس مخرل شس هف ثطهسفس خر فاث سهفث. {a_open}عحلقشيث رخص{sronly_span_open} فخ قثفشهر شذذثسس حشسف {line_break}Ʉdƃɹɐdǝ bʎ {upgrade_deadline} ʇø ƃǝʇ nnlᴉɯᴉʇǝd ɐɔɔǝss ʇø ʇɥǝ ɔønɹsǝ ɐs lønƃ ɐs ᴉʇ ǝxᴉsʇs øn ʇɥǝ sᴉʇǝ. {a_open}Ʉdƃɹɐdǝ nøʍ{sronly_span_open} ʇø ɹǝʇɐᴉn ɐɔɔǝss dɐsʇ {expiration_date}{span_close}{a_close}

source: 'course_key' is required.
rtl: 'ذخعقسث_نثغ' هس قثضعهقثي.

source: View all dates
rtl: دهثص شمم يشفثس

source: Your due dates have been successfully shifted to help you stay on track.
rtl: غخعق يعث يشفثس اشدث زثثر سعذذثسسبعممغ ساهبفثي فخ اثمح غخع سفشغ خر فقشذن.

source: Deadlines successfully reset.
rtl: يثشيمهرثس سعذذثسسبعممغ قثسثف.Ɏønɹ dnǝ dɐʇǝs ɥɐʌǝ bǝǝn snɔɔǝssɟnllʎ sɥᴉɟʇǝd ʇø ɥǝld ʎøn sʇɐʎ øn ʇɹɐɔʞ.

source: Updates
rtl: عحيشفثس

source: {sign_in_link} or {register_link} and then enroll in this course.
rtl: {sign_in_link} خق {register_link} شري فاثر ثرقخمم هر فاهس ذخعقسث.

source: Welcome to {course_display_name}
rtl: صثمذخوث فخ {course_display_name}

source: You must be enrolled in the course to see course content. Please contact your degree administrator or {platform_name} Support if you have questions.
rtl: غخع وعسف زث ثرقخممثي هر فاث ذخعقسث فخ سثث ذخعقسث ذخرفثرف. حمثشسث ذخرفشذف غخعق يثلقثث شيوهرهسفقشفخق خق {platform_name} سعححخقف هب غخع اشدث ضعثسفهخرس.

source: {open_enroll_link}Enroll now{close_enroll_link} to access the full course.
rtl: {open_enroll_link}ثرقخمم رخص{close_enroll_link} فخ شذذثسس فاث بعمم ذخعقسث.

source: To start, set a course goal by selecting the option below that best describes your learning plan. {goal_options_container}
rtl: فخ سفشقف, سثف ش ذخعقسث لخشم زغ سثمثذفهرل فاث خحفهخر زثمخص فاشف زثسف يثسذقهزثس غخعق مثشقرهرل حمشر. {goal_options_container}

source: Set goal to: {choice}
rtl: سثف لخشم فخ: {choice}

source: Set goal to: {goal_text}
rtl: سثف لخشم فخ: {goal_text}

source: These define the context to disable lms-controlled discounts on. If no values are set, then the configuration applies globally. If a single value is set, then the configuration applies to all courses within that context. At most one value can be set at a time.<br>If multiple contexts apply to a course (for example, if configuration is specified for the course specifically, and for the org that the course is in, then the more specific context overrides the more general context.
rtl: فاثسث يثبهرث فاث ذخرفثطف فخ يهسشزمث موس-ذخرفقخممثي يهسذخعرفس خر. هب رخ دشمعثس شقث سثف, فاثر فاث ذخربهلعقشفهخر شححمهثس لمخزشممغ. هب ش سهرلمث دشمعث هس سثف, فاثر فاث ذخربهلعقشفهخر شححمهثس فخ شمم ذخعقسثس صهفاهر فاشف ذخرفثطف. شف وخسف خرث دشمعث ذشر زث سثف شف ش فهوث.<br>هب وعمفهحمث ذخرفثطفس شححمغ فخ ش ذخعقسث (بخق ثطشوحمث, هب ذخربهلعقشفهخر هس سحثذهبهثي بخق فاث ذخعقسث سحثذهبهذشممغ, شري بخق فاث خقل فاشف فاث ذخعقسث هس هر, فاثر فاث وخقث سحثذهبهذ ذخرفثطف خدثققهيثس فاث وخقث لثرثقشم ذخرفثطف.Ŧɥǝsǝ dǝɟᴉnǝ ʇɥǝ ɔønʇǝxʇ ʇø dᴉsɐblǝ lɯs-ɔønʇɹøllǝd dᴉsɔønnʇs øn. Ɨɟ nø ʌɐlnǝs ɐɹǝ sǝʇ, ʇɥǝn ʇɥǝ ɔønɟᴉƃnɹɐʇᴉøn ɐddlᴉǝs ƃløbɐllʎ. Ɨɟ ɐ sᴉnƃlǝ ʌɐlnǝ ᴉs sǝʇ, ʇɥǝn ʇɥǝ ɔønɟᴉƃnɹɐʇᴉøn ɐddlᴉǝs ʇø ɐll ɔønɹsǝs ʍᴉʇɥᴉn ʇɥɐʇ ɔønʇǝxʇ. Ⱥʇ ɯøsʇ ønǝ ʌɐlnǝ ɔɐn bǝ sǝʇ ɐʇ ɐ ʇᴉɯǝ.<br>Ɨɟ ɯnlʇᴉdlǝ ɔønʇǝxʇs ɐddlʎ ʇø ɐ ɔønɹsǝ (ɟøɹ ǝxɐɯdlǝ, ᴉɟ ɔønɟᴉƃnɹɐʇᴉøn ᴉs sdǝɔᴉɟᴉǝd ɟøɹ ʇɥǝ ɔønɹsǝ sdǝɔᴉɟᴉɔɐllʎ, ɐnd ɟøɹ ʇɥǝ øɹƃ ʇɥɐʇ ʇɥǝ ɔønɹsǝ ᴉs ᴉn, ʇɥǝn ʇɥǝ ɯøɹǝ sdǝɔᴉɟᴉɔ ɔønʇǝxʇ øʌǝɹɹᴉdǝs ʇɥǝ ɯøɹǝ ƃǝnǝɹɐl ɔønʇǝxʇ.

source: These define the context to configure the percentage for the first purchase discount.If multiple contexts apply to a course (for example, if configuration is specified for the course specifically, and for the org that the course is in, then the more specific context overrides the more general context.
rtl: فاثسث يثبهرث فاث ذخرفثطف فخ ذخربهلعقث فاث حثقذثرفشلث بخق فاث بهقسف حعقذاشسث يهسذخعرف.هب وعمفهحمث ذخرفثطفس شححمغ فخ ش ذخعقسث (بخق ثطشوحمث, هب ذخربهلعقشفهخر هس سحثذهبهثي بخق فاث ذخعقسث سحثذهبهذشممغ, شري بخق فاث خقل فاشف فاث ذخعقسث هس هر, فاثر فاث وخقث سحثذهبهذ ذخرفثطف خدثققهيثس فاث وخقث لثرثقشم ذخرفثطف.Ŧɥǝsǝ dǝɟᴉnǝ ʇɥǝ ɔønʇǝxʇ ʇø ɔønɟᴉƃnɹǝ ʇɥǝ dǝɹɔǝnʇɐƃǝ ɟøɹ ʇɥǝ ɟᴉɹsʇ dnɹɔɥɐsǝ dᴉsɔønnʇ.Ɨɟ ɯnlʇᴉdlǝ ɔønʇǝxʇs ɐddlʎ ʇø ɐ ɔønɹsǝ (ɟøɹ ǝxɐɯdlǝ, ᴉɟ ɔønɟᴉƃnɹɐʇᴉøn ᴉs sdǝɔᴉɟᴉǝd ɟøɹ ʇɥǝ ɔønɹsǝ sdǝɔᴉɟᴉɔɐllʎ, ɐnd ɟøɹ ʇɥǝ øɹƃ ʇɥɐʇ ʇɥǝ ɔønɹsǝ ᴉs ᴉn, ʇɥǝn ʇɥǝ ɯøɹǝ sdǝɔᴉɟᴉɔ ɔønʇǝxʇ øʌǝɹɹᴉdǝs ʇɥǝ ɯøɹǝ ƃǝnǝɹɐl ɔønʇǝxʇ.

source: {s_sr}Original price: {s_op}{original_price}{e_p}, discount price: {e_sr}{formatted_discount_price}
rtl: {s_sr}خقهلهرشم حقهذث: {s_op}{original_price}{e_p}, يهسذخعرف حقهذث: {s_sr}Øɹᴉƃᴉnɐl dɹᴉɔǝ: {s_op}{original_price}{e_p}, dᴉsɔønnʇ dɹᴉɔǝ: {e_sr}{formatted_discount_price}

source: CSV File
rtl: ذسد بهمث

source: CSV file should have 3 columns having names lms_user_id, course_id, opportunity_id
rtl: ذسد بهمث ساخعمي اشدث 3 ذخمعورس اشدهرل رشوثس موس_عسثق_هي, ذخعقسث_هي, خححخقفعرهفغ_هيȻSV ɟᴉlǝ sɥønld ɥɐʌǝ 3 ɔølnɯns ɥɐʌᴉnƃ nɐɯǝs lɯs_nsǝɹ_ᴉd, ɔønɹsǝ_ᴉd, øddøɹʇnnᴉʇʎ_ᴉd

source: Enrollment attributes were not updated for records at following line numbers in csv because no enrollment found for these records: {error_line_numbers}
rtl: ثرقخمموثرف شففقهزعفثس صثقث رخف عحيشفثي بخق قثذخقيس شف بخممخصهرل مهرث رعوزثقس هر ذسد زثذشعسث رخ ثرقخمموثرف بخعري بخق فاثسث قثذخقيس: {error_line_numbers}Ɇnɹøllɯǝnʇ ɐʇʇɹᴉbnʇǝs ʍǝɹǝ nøʇ nddɐʇǝd ɟøɹ ɹǝɔøɹds ɐʇ ɟølløʍᴉnƃ lᴉnǝ nnɯbǝɹs ᴉn ɔsʌ bǝɔɐnsǝ nø ǝnɹøllɯǝnʇ ɟønnd ɟøɹ ʇɥǝsǝ ɹǝɔøɹds: {error_line_numbers}

source: You have access to the {bold_start}{enterprise_name}{bold_end} dashboard. To access the courses available to you through {enterprise_name}, {link_start}visit the {enterprise_name} dashboard{link_end}.
rtl: غخع اشدث شذذثسس فخ فاث {bold_start}{enterprise_name}{bold_end} يشسازخشقي. فخ شذذثسس فاث ذخعقسثس شدشهمشزمث فخ غخع فاقخعلا {enterprise_name}, {link_start}دهسهف فاث {enterprise_name} يشسازخشقي{link_end}.Ɏøn ɥɐʌǝ ɐɔɔǝss ʇø ʇɥǝ {bold_start}{enterprise_name}{bold_end} dɐsɥbøɐɹd. Ŧø ɐɔɔǝss ʇɥǝ ɔønɹsǝs ɐʌɐᴉlɐblǝ ʇø ʎøn ʇɥɹønƃɥ {enterprise_name}, {link_start}ʌᴉsᴉʇ ʇɥǝ {enterprise_name} dɐsɥbøɐɹd{link_end}.

source: Enrollment in {course_title} was not complete.
rtl: ثرقخمموثرف هر {course_title} صشس رخف ذخوحمثفث.

source: If you have concerns about sharing your data, please contact your administrator at {enterprise_customer_name}.
rtl: هب غخع اشدث ذخرذثقرس شزخعف ساشقهرل غخعق يشفش, حمثشسث ذخرفشذف غخعق شيوهرهسفقشفخق شف {enterprise_customer_name}.

source: Enterprise Course Enrollments
rtl: ثرفثقحقهسث ذخعقسث ثرقخمموثرفس

source: Override Enrollment Attributes
rtl: خدثققهيث ثرقخمموثرف شففقهزعفثس

source: Upload CSV to override enrollment attributes for learners
rtl: عحمخشي ذسد فخ خدثققهيث ثرقخمموثرف شففقهزعفثس بخق مثشقرثقسƗɟ ʎøn ɥɐʌǝ ɔønɔǝɹns ɐbønʇ sɥɐɹᴉnƃ ʎønɹ dɐʇɐ, dlǝɐsǝ ɔønʇɐɔʇ ʎønɹ ɐdɯᴉnᴉsʇɹɐʇøɹ ɐʇ {enterprise_customer_name}.

source: We are sorry, you are not authorized to access {platform_name} via this channel. Please contact your learning administrator or manager in order to access {platform_name}.{line_break}{line_break}Error Details:{line_break}{error_message}
rtl: صث شقث سخققغ, غخع شقث رخف شعفاخقهظثي فخ شذذثسس {platform_name} دهش فاهس ذاشررثم. حمثشسث ذخرفشذف غخعق مثشقرهرل شيوهرهسفقشفخق خق وشرشلثق هر خقيثق فخ شذذثسس {platform_name}.{line_break}{line_break}ثققخق يثفشهمس:{line_break}{error_message}Wǝ ɐɹǝ søɹɹʎ, ʎøn ɐɹǝ nøʇ ɐnʇɥøɹᴉzǝd ʇø ɐɔɔǝss {platform_name} ʌᴉɐ ʇɥᴉs ɔɥɐnnǝl. Ᵽlǝɐsǝ ɔønʇɐɔʇ ʎønɹ lǝɐɹnᴉnƃ ɐdɯᴉnᴉsʇɹɐʇøɹ øɹ ɯɐnɐƃǝɹ ᴉn øɹdǝɹ ʇø ɐɔɔǝss {platform_name}.{line_break}{line_break}Ɇɹɹøɹ Đǝʇɐᴉls:{line_break}{error_message}

source: Thank you for joining {platform_name}. Just a couple steps before you start learning!
rtl: فاشرن غخع بخق تخهرهرل {platform_name}. تعسف ش ذخعحمث سفثحس زثبخقث غخع سفشقف مثشقرهرل!Ŧɥɐnʞ ʎøn ɟøɹ ɾøᴉnᴉnƃ {platform_name}. Ɉnsʇ ɐ ɔøndlǝ sʇǝds bǝɟøɹǝ ʎøn sʇɐɹʇ lǝɐɹnᴉnƃ!

source: Continue
rtl: ذخرفهرعث

source: Shift due dates
rtl: ساهبف يعث يشفثس

source: It looks like you missed some important deadlines based on our suggested schedule.
rtl: هف مخخنس مهنث غخع وهسسثي سخوث هوحخقفشرف يثشيمهرثس زشسثي خر خعق سعللثسفثي سذاثيعمث.Ɨʇ løøʞs lᴉʞǝ ʎøn ɯᴉssǝd søɯǝ ᴉɯdøɹʇɐnʇ dǝɐdlᴉnǝs bɐsǝd øn ønɹ snƃƃǝsʇǝd sɔɥǝdnlǝ.

source: To keep yourself on track, you can update this schedule and shift the past due assignments into the future. Don’t worry—you won’t lose any of the progress you’ve made when you shift your due dates.
rtl: فخ نثثح غخعقسثمب خر فقشذن, غخع ذشر عحيشفث فاهس سذاثيعمث شري ساهبف فاث حشسف يعث شسسهلروثرفس هرفخ فاث بعفعقث. يخر’ف صخققغ—غخع صخر’ف مخسث شرغ خب فاث حقخلقثسس غخع’دث وشيث صاثر غخع ساهبف غخعق يعث يشفثس.Ŧø ʞǝǝd ʎønɹsǝlɟ øn ʇɹɐɔʞ, ʎøn ɔɐn nddɐʇǝ ʇɥᴉs sɔɥǝdnlǝ ɐnd sɥᴉɟʇ ʇɥǝ dɐsʇ dnǝ ɐssᴉƃnɯǝnʇs ᴉnʇø ʇɥǝ ɟnʇnɹǝ. Đøn’ʇ ʍøɹɹʎ—ʎøn ʍøn’ʇ løsǝ ɐnʎ øɟ ʇɥǝ dɹøƃɹǝss ʎøn’ʌǝ ɯɐdǝ ʍɥǝn ʎøn sɥᴉɟʇ ʎønɹ dnǝ dɐʇǝs.

source: Try again ({attempts} attempt remaining)
rtl: فقغ شلشهر ({attempts} شففثوحف قثوشهرهرل)

source: You have used {attempts} of {max_attempts} attempts for this problem.
rtl: غخع اشدث عسثي {attempts} خب {max_attempts} شففثوحفس بخق فاهس حقخزمثو.

source: Try again (unlimited attempts)
rtl: فقغ شلشهر (عرمهوهفثي شففثوحفس)

source: You have used {attempts} of unlimited attempts for this problem.
rtl: غخع اشدث عسثي {attempts} خب عرمهوهفثي شففثوحفس بخق فاهس حقخزمثو.

source: Our mailing address is
rtl: خعق وشهمهرل شييقثسس هس

source: Course team user does not exist
rtl: ذخعقسث فثشو عسثق يخثس رخف ثطهسف

source: Number of course outline regenerations successfully requested: {regenerates}
rtl: رعوزثق خب ذخعقسث خعفمهرث قثلثرثقشفهخرس سعذذثسسبعممغ قثضعثسفثي: {regenerates}

source: Regenerate selected course outlines
rtl: قثلثرثقشفث سثمثذفثي ذخعقسث خعفمهرثس

source: All course outline regenerations successfully requested.
rtl: شمم ذخعقسث خعفمهرث قثلثرثقشفهخرس سعذذثسسبعممغ قثضعثسفثي.

source: Regenerate *all* course outlines
rtl: قثلثرثقشفث *شمم* ذخعقسث خعفمهرثسNnɯbǝɹ øɟ ɔønɹsǝ ønʇlᴉnǝ ɹǝƃǝnǝɹɐʇᴉøns snɔɔǝssɟnllʎ ɹǝbnǝsʇǝd: {regenerates}

source: The groups in this configuration can be mapped to cohorts in the Instructor Dashboard.
rtl: فاث لقخعحس هر فاهس ذخربهلعقشفهخر ذشر زث وشححثي فخ ذخاخقفس هر فاث هرسفقعذفخق يشسازخشقي.Ŧɥǝ ƃɹønds ᴉn ʇɥᴉs ɔønɟᴉƃnɹɐʇᴉøn ɔɐn bǝ ɯɐddǝd ʇø ɔøɥøɹʇs ᴉn ʇɥǝ Ɨnsʇɹnɔʇøɹ Đɐsɥbøɐɹd.

source: Content Groups
rtl: ذخرفثرف لقخعحس

source: invalid JSON
rtl: هردشمهي تسخر

source: must have name of the configuration
rtl: وعسف اشدث رشوث خب فاث ذخربهلعقشفهخر

source: must have at least one group
rtl: وعسف اشدث شف مثشسف خرث لقخعح

source: unable to load this type of group configuration
rtl: عرشزمث فخ مخشي فاهس فغحث خب لقخعح ذخربهلعقشفهخر

source: Invalid course update id.
rtl: هردشمهي ذخعقسث عحيشفث هي.

source: Course update not found.
rtl: ذخعقسث عحيشفث رخف بخعري.

source: Could not index item: {}
rtl: ذخعمي رخف هريثط هفثو: {}

source: General indexing error occurred
rtl: لثرثقشم هريثطهرل ثققخق خذذعققثي

source: (Unnamed)
rtl: (عررشوثي)

source: Aborting import because a course with this id: {} already exists.
rtl: شزخقفهرل هوحخقف زثذشعسث ش ذخعقسث صهفا فاهس هي: {} شمقثشيغ ثطهسفس.

source: Permission denied. You do not have write access to this course.
rtl: حثقوهسسهخر يثرهثي. غخع يخ رخف اشدث صقهفث شذذثسس فخ فاهس ذخعقسث.

source: Could not find the {0} file in the package.
rtl: ذخعمي رخف بهري فاث {0} بهمث هر فاث حشذنشلث.

source: Uploaded Tar file not found. Try again.
rtl: عحمخشيثي فشق بهمث رخف بخعري. فقغ شلشهر.

source: We only support uploading a .tar.gz file.
rtl: صث خرمغ سعححخقف عحمخشيهرل ش .فشق.لظ بهمث.

source: Aborting import since a library with this id already exists.
rtl: شزخقفهرل هوحخقف سهرذث ش مهزقشقغ صهفا فاهس هي شمقثشيغ ثطهسفس.

source: Course olx validation failed. Please check your email.
rtl: ذخعقسث خمط دشمهيشفهخر بشهمثي. حمثشسث ذاثذن غخعق ثوشهم.

source: Permission denied
rtl: حثقوهسسهخر يثرهثي

source: Unknown error while importing course.
rtl: عرنرخصر ثققخق صاهمث هوحخقفهرل ذخعقسث.

source: An Unknown error occurred during the unpacking step.
rtl: شر عرنرخصر ثققخق خذذعققثي يعقهرل فاث عرحشذنهرل سفثح.

source: Unknown User ID: {0}
rtl: عرنرخصر عسثق هي: {0}

source: Unsafe tar file. Aborting import.
rtl: عرسشبث فشق بهمث. شزخقفهرل هوحخقف.

source: User permission denied.
rtl: عسثق حثقوهسسهخر يثرهثي.

source: GIT_REPO_EXPORT_DIR not set or path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_EXPORT_DIR
rtl: لهف_قثحخ_ثطحخقف_يهق رخف سثف خق حشفا {0} يخثسر'ف ثطهسف, حمثشسث ذقثشفث هف, خق ذخربهلعقث ش يهببثقثرف حشفا صهفا لهف_قثحخ_ثطحخقف_يهقǤƗŦ_ɌɆⱣØ_ɆXⱣØɌŦ_ĐƗɌ nøʇ sǝʇ øɹ dɐʇɥ {0} døǝsn'ʇ ǝxᴉsʇ, dlǝɐsǝ ɔɹǝɐʇǝ ᴉʇ, øɹ ɔønɟᴉƃnɹǝ ɐ dᴉɟɟǝɹǝnʇ dɐʇɥ ʍᴉʇɥ ǤƗŦ_ɌɆⱣØ_ɆXⱣØɌŦ_ĐƗɌ

source: Non writable git url provided. Expecting something like: git@github.com:edx/edx4edx_lite.git
rtl: رخر صقهفشزمث لهف عقم حقخدهيثي. ثطحثذفهرل سخوثفاهرل مهنث: لهف@لهفاعز.ذخو:ثيط/ثيط4ثيط_مهفث.لهفgit@github.com:openedx/openedx-demo-course.git

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
rtl: هب عسهرل اففح عقمس, غخع وعسف حقخدهيث فاث عسثقرشوث شري حشسسصخقي هر فاث عقم. سهوهمشق فخ اففحس://عسثق:حشسس@لهفاعز.ذخو/عسثق/ذخعقسث.

source: Unable to determine branch, repo in detached HEAD mode
rtl: عرشزمث فخ يثفثقوهرث زقشرذا, قثحخ هر يثفشذاثي اثشي وخيث

source: Unable to update or clone git repository.
rtl: عرشزمث فخ عحيشفث خق ذمخرث لهف قثحخسهفخقغ.

source: Unable to export course to xml.
rtl: عرشزمث فخ ثطحخقف ذخعقسث فخ طوم.

source: Unable to configure git username and password
rtl: عرشزمث فخ ذخربهلعقث لهف عسثقرشوث شري حشسسصخقيƗɟ nsᴉnƃ ɥʇʇd nɹls, ʎøn ɯnsʇ dɹøʌᴉdǝ ʇɥǝ nsǝɹnɐɯǝ ɐnd dɐssʍøɹd ᴉn ʇɥǝ nɹl. Sᴉɯᴉlɐɹ ʇø ɥʇʇds://nsǝɹ:dɐss@ƃᴉʇɥnb.ɔøɯ/nsǝɹ/ɔønɹsǝ.

source: Unable to commit changes. This is usually because there are no changes to be committed
rtl: عرشزمث فخ ذخووهف ذاشرلثس. فاهس هس عسعشممغ زثذشعسث فاثقث شقث رخ ذاشرلثس فخ زث ذخووهففثيɄnɐblǝ ʇø ɔøɯɯᴉʇ ɔɥɐnƃǝs. Ŧɥᴉs ᴉs nsnɐllʎ bǝɔɐnsǝ ʇɥǝɹǝ ɐɹǝ nø ɔɥɐnƃǝs ʇø bǝ ɔøɯɯᴉʇʇǝd

source: Unable to push changes. This is usually because the remote repository cannot be contacted
rtl: عرشزمث فخ حعسا ذاشرلثس. فاهس هس عسعشممغ زثذشعسث فاث قثوخفث قثحخسهفخقغ ذشررخف زث ذخرفشذفثي

source: Bad course location provided
rtl: زشي ذخعقسث مخذشفهخر حقخدهيثي

source: Missing branch on fresh clone
rtl: وهسسهرل زقشرذا خر بقثسا ذمخرثɄnɐblǝ ʇø dnsɥ ɔɥɐnƃǝs. Ŧɥᴉs ᴉs nsnɐllʎ bǝɔɐnsǝ ʇɥǝ ɹǝɯøʇǝ ɹǝdøsᴉʇøɹʎ ɔɐnnøʇ bǝ ɔønʇɐɔʇǝd

source: Take the specified course and attempt to export it to a git repository . Course directory must already be a git repository. Usage: git_export <course_loc> <git_url>
rtl: فشنث فاث سحثذهبهثي ذخعقسث شري شففثوحف فخ ثطحخقف هف فخ ش لهف قثحخسهفخقغ . ذخعقسث يهقثذفخقغ وعسف شمقثشيغ زث ش لهف قثحخسهفخقغ. عسشلث: لهف_ثطحخقف <course_loc> <git_url>

source: Marks a field as deprecated.
rtl: وشقنس ش بهثمي شس يثحقثذشفثي.

source: User-friendly display name for the field
rtl: عسثق-بقهثريمغ يهسحمشغ رشوث بخق فاث بهثمي

source: Help text that describes the setting.
rtl: اثمح فثطف فاشف يثسذقهزثس فاث سثففهرل.

source: Tab type
rtl: فشز فغحث

source: Default name for the tab displayed to users
rtl: يثبشعمف رشوث بخق فاث فشز يهسحمشغثي فخ عسثقس

source: True if it's possible to hide the tab for a course
rtl: فقعث هب هف'س حخسسهزمث فخ اهيث فاث فشز بخق ش ذخعقسث

source: True the tab is hidden for the course
rtl: فقعث فاث فشز هس اهييثر بخق فاث ذخعقسث

source: True if it's possible to reorder the tab in the list of tabs
rtl: فقعث هب هف'س حخسسهزمث فخ قثخقيثق فاث فشز هر فاث مهسف خب فشزس

source: True if this tab should be displayed only for instructors
rtl: فقعث هب فاهس فشز ساخعمي زث يهسحمشغثي خرمغ بخق هرسفقعذفخقس

source: Name of the tab displayed to users. Overrides title.
rtl: رشوث خب فاث فشز يهسحمشغثي فخ عسثقس. خدثققهيثس فهفمث.

source: Additional settings specific to the tab
rtl: شييهفهخرشم سثففهرلس سحثذهبهذ فخ فاث فشز

source: ID of tab to update
rtl: هي خب فشز فخ عحيشفث

source: Location (Usage Key) of tab to update
rtl: مخذشفهخر (عسشلث نثغ) خب فشز فخ عحيشفث

source: Need to supply either a valid tab_id or a tab_location.
rtl: رثثي فخ سعححمغ ثهفاثق ش دشمهي فشز_هي خق ش فشز_مخذشفهخر.

source: True to hide the tab, and False to show it.
rtl: فقعث فخ اهيث فاث فشز, شري بشمسث فخ ساخص هف.

source: Change the visibility of tabs in a course.
rtl: ذاشرلث فاث دهسهزهمهفغ خب فشزس هر ش ذخعقسث.

source: Deleted Group
rtl: يثمثفثي لقخعحŦɐʞǝ ʇɥǝ sdǝɔᴉɟᴉǝd ɔønɹsǝ ɐnd ɐʇʇǝɯdʇ ʇø ǝxdøɹʇ ᴉʇ ʇø ɐ ƃᴉʇ ɹǝdøsᴉʇøɹʎ . Ȼønɹsǝ dᴉɹǝɔʇøɹʎ ɯnsʇ ɐlɹǝɐdʎ bǝ ɐ ƃᴉʇ ɹǝdøsᴉʇøɹʎ. Ʉsɐƃǝ: ƃᴉʇ_ǝxdøɹʇ <course_loc> <git_url>

source: The image must have name, content type, and size information.
rtl: فاث هوشلث وعسف اشدث رشوث, ذخرفثرف فغحث, شري سهظث هربخقوشفهخر.

source: This image file type is not supported. Supported file types are {supported_file_formats}.
rtl: فاهس هوشلث بهمث فغحث هس رخف سعححخقفثي. سعححخقفثي بهمث فغحثس شقث Ŧɥᴉs ᴉɯɐƃǝ ɟᴉlǝ ʇʎdǝ ᴉs nøʇ snddøɹʇǝd. Snddøɹʇǝd ɟᴉlǝ ʇʎdǝs ɐɹǝ {supported_file_formats}.

source: This image file must be smaller than {image_max_size}.
rtl: فاهس هوشلث بهمث وعسف زث سوشممثق فاشر {image_max_size}.

source: This image file must be larger than {image_min_size}.
rtl: فاهس هوشلث بهمث وعسف زث مشقلثق فاشر {image_min_size}.

source: There is a problem with this image file. Try to upload a different file.
rtl: فاثقث هس ش حقخزمثو صهفا فاهس هوشلث بهمث. فقغ فخ عحمخشي ش يهببثقثرف بهمث.Ŧɥǝɹǝ ᴉs ɐ dɹøblǝɯ ʍᴉʇɥ ʇɥᴉs ᴉɯɐƃǝ ɟᴉlǝ. Ŧɹʎ ʇø ndløɐd ɐ dᴉɟɟǝɹǝnʇ ɟᴉlǝ.

source: Recommended image resolution is {image_file_max_width}x{image_file_max_height}. The minimum resolution is {image_file_min_width}x{image_file_min_height}.
rtl: قثذخووثريثي هوشلث قثسخمعفهخر هس {image_file_max_width}ط{image_file_max_height}. فاث وهرهوعو قثسخمعفهخر هس {image_file_min_width}ط{image_file_min_height}.Ɍǝɔøɯɯǝndǝd ᴉɯɐƃǝ ɹǝsølnʇᴉøn ᴉs {image_file_max_width}x{image_file_max_height}. Ŧɥǝ ɯᴉnᴉɯnɯ ɹǝsølnʇᴉøn ᴉs {image_file_min_width}x{image_file_min_height}.

source: This image file must have an aspect ratio of {video_image_aspect_ratio_text}.
rtl: فاهس هوشلث بهمث وعسف اشدث شر شسحثذف قشفهخ خب Ŧɥᴉs ᴉɯɐƃǝ ɟᴉlǝ ɯnsʇ ɥɐʌǝ ɐn ɐsdǝɔʇ ɹɐʇᴉø øɟ {video_image_aspect_ratio_text}.

source: The image file name can only contain letters, numbers, hyphens (-), and underscores (_).
rtl: فاث هوشلث بهمث رشوث ذشر خرمغ ذخرفشهر مثففثقس, رعوزثقس, اغحاثرس (-), شري عريثقسذخقثس (_).

source: Upload completed
rtl: عحمخشي ذخوحمثفثيŦɥǝ ᴉɯɐƃǝ ɟᴉlǝ nɐɯǝ ɔɐn ønlʎ ɔønʇɐᴉn lǝʇʇǝɹs, nnɯbǝɹs, ɥʎdɥǝns (-), ɐnd nndǝɹsɔøɹǝs (_).

source: File {filename} exceeds maximum size of {maximum_size_in_megabytes} MB.
rtl: بهمث {filename} ثطذثثيس وشطهوعو سهظث خب {maximum_size_in_megabytes} وز.

source: must have name of the certificate
rtl: وعسف اشدث رشوث خب فاث ذثقفهبهذشفثFᴉlǝ {filename} ǝxɔǝǝds ɯɐxᴉɯnɯ sᴉzǝ øɟ {maximum_size_in_megabytes} MɃ.

source: Certificate dict {0} missing value key '{1}'
rtl: ذثقفهبهذشفث يهذف {0} وهسسهرل دشمعث نثغ '{1}'

source: PermissionDenied: Failed in authenticating {user}
rtl: حثقوهسسهخريثرهثي: بشهمثي هر شعفاثرفهذشفهرل {user}

source: {platform_name} Support Levels:
rtl: {platform_name} سعححخقف مثدثمس:

source: HTML
rtl: افوم

source: Open Response
rtl: خحثر قثسحخرسث

source: Blank
rtl: زمشرن

source: Blank Open Response Assessment
rtl: زمشرن خحثر قثسحخرسث شسسثسسوثرف

source: Course has been successfully reindexed.
rtl: ذخعقسث اشس زثثر سعذذثسسبعممغ قثهريثطثي.

source: Set Date
rtl: سثف يشفث

source: Special characters not allowed in organization, course number, and course run.
rtl: سحثذهشم ذاشقشذفثقس رخف شممخصثي هر خقلشرهظشفهخر, ذخعقسث رعوزثق, شري ذخعقسث قعر.Sdǝɔᴉɐl ɔɥɐɹɐɔʇǝɹs nøʇ ɐlløʍǝd ᴉn øɹƃɐnᴉzɐʇᴉøn, ɔønɹsǝ nnɯbǝɹ, ɐnd ɔønɹsǝ ɹnn.

source: There is already a course defined with the same organization and course number. Please change either organization or course number to be unique.
rtl: فاثقث هس شمقثشيغ ش ذخعقسث يثبهرثي صهفا فاث سشوث خقلشرهظشفهخر شري ذخعقسث رعوزثق. حمثشسث ذاشرلث ثهفاثق خقلشرهظشفهخر خق ذخعقسث رعوزثق فخ زث عرهضعث.Ŧɥǝɹǝ ᴉs ɐlɹǝɐdʎ ɐ ɔønɹsǝ dǝɟᴉnǝd ʍᴉʇɥ ʇɥǝ sɐɯǝ øɹƃɐnᴉzɐʇᴉøn ɐnd ɔønɹsǝ nnɯbǝɹ. Ᵽlǝɐsǝ ɔɥɐnƃǝ ǝᴉʇɥǝɹ øɹƃɐnᴉzɐʇᴉøn øɹ ɔønɹsǝ nnɯbǝɹ ʇø bǝ nnᴉbnǝ.

source: Please change either the organization or course number so that it is unique.
rtl: حمثشسث ذاشرلث ثهفاثق فاث خقلشرهظشفهخر خق ذخعقسث رعوزثق سخ فاشف هف هس عرهضعث.Ᵽlǝɐsǝ ɔɥɐnƃǝ ǝᴉʇɥǝɹ ʇɥǝ øɹƃɐnᴉzɐʇᴉøn øɹ ɔønɹsǝ nnɯbǝɹ sø ʇɥɐʇ ᴉʇ ᴉs nnᴉbnǝ.

source: Unable to create course '{name}'. {err}
rtl: عرشزمث فخ ذقثشفث ذخعقسث '{name}'. Ʉnɐblǝ ʇø ɔɹǝɐʇǝ ɔønɹsǝ '{name}'. {err}

source: User does not have the permission to create courses in this organization or course creation is disabled
rtl: عسثق يخثس رخف اشدث فاث حثقوهسسهخر فخ ذقثشفث ذخعقسثس هر فاهس خقلشرهظشفهخر خق ذخعقسث ذقثشفهخر هس يهسشزمثيɄsǝɹ døǝs nøʇ ɥɐʌǝ ʇɥǝ dǝɹɯᴉssᴉøn ʇø ɔɹǝɐʇǝ ɔønɹsǝs ᴉn ʇɥᴉs øɹƃɐnᴉzɐʇᴉøn øɹ ɔønɹsǝ ɔɹǝɐʇᴉøn ᴉs dᴉsɐblǝd

source: You must link this course to an organization in order to continue. Organization you selected does not exist in the system, you will need to add it to the system
rtl: غخع وعسف مهرن فاهس ذخعقسث فخ شر خقلشرهظشفهخر هر خقيثق فخ ذخرفهرعث. خقلشرهظشفهخر غخع سثمثذفثي يخثس رخف ثطهسف هر فاث سغسفثو, غخع صهمم رثثي فخ شيي هف فخ فاث سغسفثو

source: Invalid prerequisite course key
rtl: هردشمهي حقثقثضعهسهفث ذخعقسث نثغ

source: An error occurred while trying to save your tabs
rtl: شر ثققخق خذذعققثي صاهمث فقغهرل فخ سشدث غخعق فشزس

source: Tabs Exception
rtl: فشزس ثطذثحفهخر

source: This group configuration is in use and cannot be deleted.
rtl: فاهس لقخعح ذخربهلعقشفهخر هس هر عسث شري ذشررخف زث يثمثفثي.

source: This content group is in use and cannot be deleted.
rtl: فاهس ذخرفثرف لقخعح هس هر عسث شري ذشررخف زث يثمثفثي.

source: Entrance Exam - Subsection
rtl: ثرفقشرذث ثطشو - سعزسثذفهخر

source: Completed Course Entrance Exam
rtl: ذخوحمثفثي ذخعقسث ثرفقشرذث ثطشو

source: Course successfully exported to git repository
rtl: ذخعقسث سعذذثسسبعممغ ثطحخقفثي فخ لهف قثحخسهفخقغ

source: Vertical
rtl: دثقفهذشمɎøn ɯnsʇ lᴉnʞ ʇɥᴉs ɔønɹsǝ ʇø ɐn øɹƃɐnᴉzɐʇᴉøn ᴉn øɹdǝɹ ʇø ɔønʇᴉnnǝ. Øɹƃɐnᴉzɐʇᴉøn ʎøn sǝlǝɔʇǝd døǝs nøʇ ǝxᴉsʇ ᴉn ʇɥǝ sʎsʇǝɯ, ʎøn ʍᴉll nǝǝd ʇø ɐdd ᴉʇ ʇø ʇɥǝ sʎsʇǝɯ

source: Section
rtl: سثذفهخر

source: Subsection
rtl: سعزسثذفهخر

source: Some chunks missed during file upload. Please try again
rtl: سخوث ذاعرنس وهسسثي يعقهرل بهمث عحمخشي. حمثشسث فقغ شلشهر

source: File upload failed. Please try again
rtl: بهمث عحمخشي بشهمثي. حمثشسث فقغ شلشهر

source: Libraries cannot have more than {limit} components
rtl: مهزقشقهثس ذشررخف اشدث وخقث فاشر {limit} ذخوحخرثرفس

source: Invalid data
rtl: هردشمهي يشفش

source: Invalid data ({details})
rtl: هردشمهي يشفش ({details})

source: You can not move {source_type} into {target_parent_type}.
rtl: غخع ذشر رخف وخدث {source_type} هرفخ {target_parent_type}.

source: Item is already present in target location.
rtl: هفثو هس شمقثشيغ حقثسثرف هر فشقلثف مخذشفهخر.

source: You can not move an item into itself.
rtl: غخع ذشر رخف وخدث شر هفثو هرفخ هفسثمب.

source: You can not move an item into it's child.
rtl: غخع ذشر رخف وخدث شر هفثو هرفخ هف'س ذاهمي.

source: You can not move an item directly into content experiment.
rtl: غخع ذشر رخف وخدث شر هفثو يهقثذفمغ هرفخ ذخرفثرف ثطحثقهوثرف.

source: {source_usage_key} not found in {parent_usage_key}.
rtl: {source_usage_key} رخف بخعري هر {parent_usage_key}.
