Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Library Users can view library content and can reference or use library components in their courses, but they cannot edit the contents of a library.
rtl: مهزقشقغ عسثقس ذشر دهثص مهزقشقغ ذخرفثرف شري ذشر قثبثقثرذث خق عسث مهزقشقغ ذخوحخرثرفس هر فاثهق ذخعقسثس, زعف فاثغ ذشررخف ثيهف فاث ذخرفثرفس خب ش مهزقشقغ.Łᴉbɹɐɹʎ Ʉsǝɹs ɔɐn ʌᴉǝʍ lᴉbɹɐɹʎ ɔønʇǝnʇ ɐnd ɔɐn ɹǝɟǝɹǝnɔǝ øɹ nsǝ lᴉbɹɐɹʎ ɔøɯdønǝnʇs ᴉn ʇɥǝᴉɹ ɔønɹsǝs, bnʇ ʇɥǝʎ ɔɐnnøʇ ǝdᴉʇ ʇɥǝ ɔønʇǝnʇs øɟ ɐ lᴉbɹɐɹʎ.

source: Library Staff are content co-authors. They have full editing privileges on the contents of a library.
rtl: مهزقشقغ سفشبب شقث ذخرفثرف ذخ-شعفاخقس. فاثغ اشدث بعمم ثيهفهرل حقهدهمثلثس خر فاث ذخرفثرفس خب ش مهزقشقغ.Łᴉbɹɐɹʎ Sʇɐɟɟ ɐɹǝ ɔønʇǝnʇ ɔø-ɐnʇɥøɹs. Ŧɥǝʎ ɥɐʌǝ ɟnll ǝdᴉʇᴉnƃ dɹᴉʌᴉlǝƃǝs øn ʇɥǝ ɔønʇǝnʇs øɟ ɐ lᴉbɹɐɹʎ.

source: Library Admins have full editing privileges and can also add and remove other team members. There must be at least one user with the Admin role in a library.
rtl: مهزقشقغ شيوهرس اشدث بعمم ثيهفهرل حقهدهمثلثس شري ذشر شمسخ شيي شري قثوخدث خفاثق فثشو وثوزثقس. فاثقث وعسف زث شف مثشسف خرث عسثق صهفا فاث شيوهر قخمث هر ش مهزقشقغ.

source: Schedule & Details Settings
rtl: سذاثيعمث & يثفشهمس سثففهرلس

source: Schedule & Details
rtl: سذاثيعمث & يثفشهمس

source: Basic Information
rtl: زشسهذ هربخقوشفهخر

source: The nuts and bolts of your course
rtl: فاث رعفس شري زخمفس خب غخعق ذخعقسث

source: This field is disabled: this information cannot be changed.
rtl: فاهس بهثمي هس يهسشزمثي: فاهس هربخقوشفهخر ذشررخف زث ذاشرلثي.

source: Course Summary Page
rtl: ذخعقسث سعووشقغ حشلث

source: (for student enrollment and access)
rtl: (بخق سفعيثرف ثرقخمموثرف شري شذذثسس)

source: Enroll in {course_display_name}
rtl: ثرقخمم هر {course_display_name}Łᴉbɹɐɹʎ Ⱥdɯᴉns ɥɐʌǝ ɟnll ǝdᴉʇᴉnƃ dɹᴉʌᴉlǝƃǝs ɐnd ɔɐn ɐlsø ɐdd ɐnd ɹǝɯøʌǝ øʇɥǝɹ ʇǝɐɯ ɯǝɯbǝɹs. Ŧɥǝɹǝ ɯnsʇ bǝ ɐʇ lǝɐsʇ ønǝ nsǝɹ ʍᴉʇɥ ʇɥǝ Ⱥdɯᴉn ɹølǝ ᴉn ɐ lᴉbɹɐɹʎ.

source: The course "{course_display_name}", provided by {platform_name}, is open for enrollment. Please navigate to this course at {link_for_about_page} to enroll.
rtl: فاث ذخعقسث "{course_display_name}", حقخدهيثي زغ {platform_name}, هس خحثر بخق ثرقخمموثرف. حمثشسث رشدهلشفث فخ فاهس ذخعقسث شف {link_for_about_page} فخ ثرقخمم.

source: Send a note to students via email
rtl: سثري ش رخفث فخ سفعيثرفس دهش ثوشهم

source: Invite your students
rtl: هردهفث غخعق سفعيثرفس

source: Promoting Your Course with {platform_name}
rtl: حقخوخفهرل غخعق ذخعقسث صهفا {platform_name}Ŧɥǝ ɔønɹsǝ "{course_display_name}", dɹøʌᴉdǝd bʎ {platform_name}, ᴉs ødǝn ɟøɹ ǝnɹøllɯǝnʇ. Ᵽlǝɐsǝ nɐʌᴉƃɐʇǝ ʇø ʇɥᴉs ɔønɹsǝ ɐʇ {link_for_about_page} ʇø ǝnɹøll.

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your Program Manager.
rtl: غخعق ذخعقسث سعووشقغ حشلث صهمم رخف زث دهثصشزمث عرفهم غخعق ذخعقسث اشس زثثر شررخعرذثي. فخ حقخدهيث ذخرفثرف بخق فاث حشلث شري حقثدهثص هف, بخممخص فاث هرسفقعذفهخرس حقخدهيثي زغ غخعق حقخلقشو وشرشلثق.Ɏønɹ ɔønɹsǝ snɯɯɐɹʎ dɐƃǝ ʍᴉll nøʇ bǝ ʌᴉǝʍɐblǝ nnʇᴉl ʎønɹ ɔønɹsǝ ɥɐs bǝǝn ɐnnønnɔǝd. Ŧø dɹøʌᴉdǝ ɔønʇǝnʇ ɟøɹ ʇɥǝ dɐƃǝ ɐnd dɹǝʌᴉǝʍ ᴉʇ, ɟølløʍ ʇɥǝ ᴉnsʇɹnɔʇᴉøns dɹøʌᴉdǝd bʎ ʎønɹ Ᵽɹøƃɹɐɯ Mɐnɐƃǝɹ.

source: Please note that changes here may take up to a business day to appear on your course summary page.
rtl: حمثشسث رخفث فاشف ذاشرلثس اثقث وشغ فشنث عح فخ ش زعسهرثسس يشغ فخ شححثشق خر غخعق ذخعقسث سعووشقغ حشلث.

source: Course Credit Requirements
rtl: ذخعقسث ذقثيهف قثضعهقثوثرفس

source: Steps required to earn course credit
rtl: سفثحس قثضعهقثي فخ ثشقر ذخعقسث ذقثيهف

source: Minimum Grade
rtl: وهرهوعو لقشيث

source: Successful Proctored Exam
rtl: سعذذثسسبعم حقخذفخقثي ثطشو

source: Proctored Exam {number}
rtl: حقخذفخقثي ثطشو {number}

source: ID Verification
rtl: هي دثقهبهذشفهخر

source: In-Course Reverification {number}
rtl: هر-ذخعقسث قثدثقهبهذشفهخر {number}

source: Course Pacing
rtl: ذخعقسث حشذهرل

source: Set the pacing for this course
rtl: سثف فاث حشذهرل بخق فاهس ذخعقسث

source: Instructor-Paced
rtl: هرسفقعذفخق-حشذثيⱣlǝɐsǝ nøʇǝ ʇɥɐʇ ɔɥɐnƃǝs ɥǝɹǝ ɯɐʎ ʇɐʞǝ nd ʇø ɐ bnsᴉnǝss dɐʎ ʇø ɐddǝɐɹ øn ʎønɹ ɔønɹsǝ snɯɯɐɹʎ dɐƃǝ.

source: Instructor-paced courses progress at the pace that the course author sets. You can configure release dates for course content and due dates for assignments.
rtl: هرسفقعذفخق-حشذثي ذخعقسثس حقخلقثسس شف فاث حشذث فاشف فاث ذخعقسث شعفاخق سثفس. غخع ذشر ذخربهلعقث قثمثشسث يشفثس بخق ذخعقسث ذخرفثرف شري يعث يشفثس بخق شسسهلروثرفس.

source: Self-Paced
rtl: سثمب-حشذثيƗnsʇɹnɔʇøɹ-dɐɔǝd ɔønɹsǝs dɹøƃɹǝss ɐʇ ʇɥǝ dɐɔǝ ʇɥɐʇ ʇɥǝ ɔønɹsǝ ɐnʇɥøɹ sǝʇs. Ɏøn ɔɐn ɔønɟᴉƃnɹǝ ɹǝlǝɐsǝ dɐʇǝs ɟøɹ ɔønɹsǝ ɔønʇǝnʇ ɐnd dnǝ dɐʇǝs ɟøɹ ɐssᴉƃnɯǝnʇs.

source: Self-paced courses offer suggested due dates for assignments or exams based on the learner’s enrollment date and the expected course duration. These courses offer learners flexibility to modify the assignment dates as needed.
rtl: سثمب-حشذثي ذخعقسثس خببثق سعللثسفثي يعث يشفثس بخق شسسهلروثرفس خق ثطشوس زشسثي خر فاث مثشقرثق’س ثرقخمموثرف يشفث شري فاث ثطحثذفثي ذخعقسث يعقشفهخر. فاثسث ذخعقسثس خببثق مثشقرثقس بمثطهزهمهفغ فخ وخيهبغ فاث شسسهلروثرف يشفثس شس رثثيثي.

source: Course Schedule
rtl: ذخعقسث سذاثيعمث

source: Dates that control when your course can be viewed
rtl: يشفثس فاشف ذخرفقخم صاثر غخعق ذخعقسث ذشر زث دهثصثي

source: Course Start Date
rtl: ذخعقسث سفشقف يشفث

source: First day the course begins
rtl: بهقسف يشغ فاث ذخعقسث زثلهرس

source: Course Start Time
rtl: ذخعقسث سفشقف فهوث

source: (UTC)
rtl: (عفذ)

source: Course End Date
rtl: ذخعقسث ثري يشفث

source: Last day your course is active
rtl: مشسف يشغ غخعق ذخعقسث هس شذفهدث

source: Course End Time
rtl: ذخعقسث ثري فهوث

source: Immediately upon passing
rtl: هووثيهشفثمغ عحخر حشسسهرل

source: End date of course
rtl: ثري يشفث خب ذخعقسث

source: A date after the course end date
rtl: ش يشفث شبفثق فاث ذخعقسث ثري يشفث

source: Certificates are awarded at the end of a course run
rtl: ذثقفهبهذشفثس شقث شصشقيثي شف فاث ثري خب ش ذخعقسث قعر

source: Read more about this setting
rtl: قثشي وخقث شزخعف فاهس سثففهرلSǝlɟ-dɐɔǝd ɔønɹsǝs øɟɟǝɹ snƃƃǝsʇǝd dnǝ dɐʇǝs ɟøɹ ɐssᴉƃnɯǝnʇs øɹ ǝxɐɯs bɐsǝd øn ʇɥǝ lǝɐɹnǝɹ’s ǝnɹøllɯǝnʇ dɐʇǝ ɐnd ʇɥǝ ǝxdǝɔʇǝd ɔønɹsǝ dnɹɐʇᴉøn. Ŧɥǝsǝ ɔønɹsǝs øɟɟǝɹ lǝɐɹnǝɹs ɟlǝxᴉbᴉlᴉʇʎ ʇø ɯødᴉɟʎ ʇɥǝ ɐssᴉƃnɯǝnʇ dɐʇǝs ɐs nǝǝdǝd.

source: In all configurations of this setting, certificates are generated for learners as soon as they achieve the passing threshold in the course (which can occur before a final assignment based on course design)
rtl: هر شمم ذخربهلعقشفهخرس خب فاهس سثففهرل, ذثقفهبهذشفثس شقث لثرثقشفثي بخق مثشقرثقس شس سخخر شس فاثغ شذاهثدث فاث حشسسهرل فاقثساخمي هر فاث ذخعقسث (صاهذا ذشر خذذعق زثبخقث ش بهرشم شسسهلروثرف زشسثي خر ذخعقسث يثسهلر)Ɨn ɐll ɔønɟᴉƃnɹɐʇᴉøns øɟ ʇɥᴉs sǝʇʇᴉnƃ, ɔǝɹʇᴉɟᴉɔɐʇǝs ɐɹǝ ƃǝnǝɹɐʇǝd ɟøɹ lǝɐɹnǝɹs ɐs søøn ɐs ʇɥǝʎ ɐɔɥᴉǝʌǝ ʇɥǝ dɐssᴉnƃ ʇɥɹǝsɥøld ᴉn ʇɥǝ ɔønɹsǝ (ʍɥᴉɔɥ ɔɐn øɔɔnɹ bǝɟøɹǝ ɐ ɟᴉnɐl ɐssᴉƃnɯǝnʇ bɐsǝd øn ɔønɹsǝ dǝsᴉƃn)

source: Learners can access their certificate as soon as they achieve a passing grade above the course grade threshold. Note: learners can achieve a passing grade before encountering all assignments in some course configurations.
rtl: مثشقرثقس ذشر شذذثسس فاثهق ذثقفهبهذشفث شس سخخر شس فاثغ شذاهثدث ش حشسسهرل لقشيث شزخدث فاث ذخعقسث لقشيث فاقثساخمي. رخفث: مثشقرثقس ذشر شذاهثدث ش حشسسهرل لقشيث زثبخقث ثرذخعرفثقهرل شمم شسسهلروثرفس هر سخوث ذخعقسث ذخربهلعقشفهخرس.

source: On course end date
rtl: خر ذخعقسث ثري يشفثŁǝɐɹnǝɹs ɔɐn ɐɔɔǝss ʇɥǝᴉɹ ɔǝɹʇᴉɟᴉɔɐʇǝ ɐs søøn ɐs ʇɥǝʎ ɐɔɥᴉǝʌǝ ɐ dɐssᴉnƃ ƃɹɐdǝ ɐbøʌǝ ʇɥǝ ɔønɹsǝ ƃɹɐdǝ ʇɥɹǝsɥøld. Nøʇǝ: lǝɐɹnǝɹs ɔɐn ɐɔɥᴉǝʌǝ ɐ dɐssᴉnƃ ƃɹɐdǝ bǝɟøɹǝ ǝnɔønnʇǝɹᴉnƃ ɐll ɐssᴉƃnɯǝnʇs ᴉn søɯǝ ɔønɹsǝ ɔønɟᴉƃnɹɐʇᴉøns.

source: Learners with passing grades can access their certificate once the end date of the course has elapsed.
rtl: مثشقرثقس صهفا حشسسهرل لقشيثس ذشر شذذثسس فاثهق ذثقفهبهذشفث خرذث فاث ثري يشفث خب فاث ذخعقسث اشس ثمشحسثي.Łǝɐɹnǝɹs ʍᴉʇɥ dɐssᴉnƃ ƃɹɐdǝs ɔɐn ɐɔɔǝss ʇɥǝᴉɹ ɔǝɹʇᴉɟᴉɔɐʇǝ ønɔǝ ʇɥǝ ǝnd dɐʇǝ øɟ ʇɥǝ ɔønɹsǝ ɥɐs ǝlɐdsǝd.

source: Learners with passing grades can access their certificate after the date that you set has elapsed.
rtl: مثشقرثقس صهفا حشسسهرل لقشيثس ذشر شذذثسس فاثهق ذثقفهبهذشفث شبفثق فاث يشفث فاشف غخع سثف اشس ثمشحسثي.

source: Certificates Available Date
rtl: ذثقفهبهذشفثس شدشهمشزمث يشفث

source: Enrollment Start Date
rtl: ثرقخمموثرف سفشقف يشفث

source: First day students can enroll
rtl: بهقسف يشغ سفعيثرفس ذشر ثرقخمم

source: Enrollment Start Time
rtl: ثرقخمموثرف سفشقف فهوث

source: Enrollment End Date
rtl: ثرقخمموثرف ثري يشفث

source: Last day students can enroll.
rtl: مشسف يشغ سفعيثرفس ذشر ثرقخمم.Łǝɐɹnǝɹs ʍᴉʇɥ dɐssᴉnƃ ƃɹɐdǝs ɔɐn ɐɔɔǝss ʇɥǝᴉɹ ɔǝɹʇᴉɟᴉɔɐʇǝ ɐɟʇǝɹ ʇɥǝ dɐʇǝ ʇɥɐʇ ʎøn sǝʇ ɥɐs ǝlɐdsǝd.

source: Contact your {platform_name} partner manager to update these settings.
rtl: ذخرفشذف غخعق {platform_name} حشقفرثق وشرشلثق فخ عحيشفث فاثسث سثففهرلس.

source: Enrollment End Time
rtl: ثرقخمموثرف ثري فهوث

source: Upgrade Deadline Date
rtl: عحلقشيث يثشيمهرث يشفث

source: Last day students can upgrade to a verified enrollment.
rtl: مشسف يشغ سفعيثرفس ذشر عحلقشيث فخ ش دثقهبهثي ثرقخمموثرف.

source: Upgrade Deadline Time
rtl: عحلقشيث يثشيمهرث فهوث

source: Course Details
rtl: ذخعقسث يثفشهمس

source: Provide useful information about your course
rtl: حقخدهيث عسثبعم هربخقوشفهخر شزخعف غخعق ذخعقسثȻønʇɐɔʇ ʎønɹ {platform_name} dɐɹʇnǝɹ ɯɐnɐƃǝɹ ʇø nddɐʇǝ ʇɥǝsǝ sǝʇʇᴉnƃs.

source: Identify the course language here. This is used to assist users find courses that are taught in a specific language. It is also used to localize the 'From:' field in bulk emails.
rtl: هيثرفهبغ فاث ذخعقسث مشرلعشلث اثقث. فاهس هس عسثي فخ شسسهسف عسثقس بهري ذخعقسثس فاشف شقث فشعلاف هر ش سحثذهبهذ مشرلعشلث. هف هس شمسخ عسثي فخ مخذشمهظث فاث 'بقخو:' بهثمي هر زعمن ثوشهمس.

source: Introducing Your Course
rtl: هرفقخيعذهرل غخعق ذخعقسث

source: Information for prospective students
rtl: هربخقوشفهخر بخق حقخسحثذفهدث سفعيثرفس

source: Course Title
rtl: ذخعقسث فهفمثƗdǝnʇᴉɟʎ ʇɥǝ ɔønɹsǝ lɐnƃnɐƃǝ ɥǝɹǝ. Ŧɥᴉs ᴉs nsǝd ʇø ɐssᴉsʇ nsǝɹs ɟᴉnd ɔønɹsǝs ʇɥɐʇ ɐɹǝ ʇɐnƃɥʇ ᴉn ɐ sdǝɔᴉɟᴉɔ lɐnƃnɐƃǝ. Ɨʇ ᴉs ɐlsø nsǝd ʇø løɔɐlᴉzǝ ʇɥǝ 'Fɹøɯ:' ɟᴉǝld ᴉn bnlʞ ǝɯɐᴉls.

source: Displayed as title on the course details page. Limit to 50 characters.
rtl: يهسحمشغثي شس فهفمث خر فاث ذخعقسث يثفشهمس حشلث. مهوهف فخ 50 ذاشقشذفثقس.

source: Course Subtitle
rtl: ذخعقسث سعزفهفمثĐᴉsdlɐʎǝd ɐs ʇᴉʇlǝ øn ʇɥǝ ɔønɹsǝ dǝʇɐᴉls dɐƃǝ. Łᴉɯᴉʇ ʇø 50 ɔɥɐɹɐɔʇǝɹs.

source: Displayed as subtitle on the course details page. Limit to 150 characters.
rtl: يهسحمشغثي شس سعزفهفمث خر فاث ذخعقسث يثفشهمس حشلث. مهوهف فخ 150 ذاشقشذفثقس.

source: Course Duration
rtl: ذخعقسث يعقشفهخر

source: Displayed on the course details page. Limit to 50 characters.
rtl: يهسحمشغثي خر فاث ذخعقسث يثفشهمس حشلث. مهوهف فخ 50 ذاشقشذفثقس.

source: Course Description
rtl: ذخعقسث يثسذقهحفهخر

source: Displayed on the course details page. Limit to 1000 characters.
rtl: يهسحمشغثي خر فاث ذخعقسث يثفشهمس حشلث. مهوهف فخ 1000 ذاشقشذفثقس.

source: Course Short Description
rtl: ذخعقسث ساخقف يثسذقهحفهخرĐᴉsdlɐʎǝd ɐs snbʇᴉʇlǝ øn ʇɥǝ ɔønɹsǝ dǝʇɐᴉls dɐƃǝ. Łᴉɯᴉʇ ʇø 150 ɔɥɐɹɐɔʇǝɹs.

source: Appears on the course catalog page when students roll over the course name. Limit to ~150 characters
rtl: شححثشقس خر فاث ذخعقسث ذشفشمخل حشلث صاثر سفعيثرفس قخمم خدثق فاث ذخعقسث رشوث. مهوهف فخ ~150 ذاشقشذفثقس

source: Course Overview
rtl: ذخعقسث خدثقدهثص

source: HTML Code Editor
rtl: افوم ذخيث ثيهفخقȺddǝɐɹs øn ʇɥǝ ɔønɹsǝ ɔɐʇɐløƃ dɐƃǝ ʍɥǝn sʇndǝnʇs ɹøll øʌǝɹ ʇɥǝ ɔønɹsǝ nɐɯǝ. Łᴉɯᴉʇ ʇø ~150 ɔɥɐɹɐɔʇǝɹs

source: Introductions, prerequisites, FAQs that are used on {a_link_start}your course summary page{a_link_end} (formatted in HTML)
rtl: هرفقخيعذفهخرس, حقثقثضعهسهفثس, بشضس فاشف شقث عسثي خر {a_link_start}غخعق ذخعقسث سعووشقغ حشلث{a_link_end} (بخقوشففثي هر افوم)

source: Course About Sidebar HTML
rtl: ذخعقسث شزخعف سهيثزشق افومƗnʇɹødnɔʇᴉøns, dɹǝɹǝbnᴉsᴉʇǝs, FȺQs ʇɥɐʇ ɐɹǝ nsǝd øn {a_link_start}ʎønɹ ɔønɹsǝ snɯɯɐɹʎ dɐƃǝ{a_link_end} (ɟøɹɯɐʇʇǝd ᴉn ĦŦMŁ)

source: Custom sidebar content for {a_link_start}your course summary page{a_link_end} (formatted in HTML)
rtl: ذعسفخو سهيثزشق ذخرفثرف بخق {a_link_start}غخعق ذخعقسث سعووشقغ حشلث{a_link_end} (بخقوشففثي هر افوم)

source: Course Card Image
rtl: ذخعقسث ذشقي هوشلثȻnsʇøɯ sᴉdǝbɐɹ ɔønʇǝnʇ ɟøɹ {a_link_start}ʎønɹ ɔønɹsǝ snɯɯɐɹʎ dɐƃǝ{a_link_end} (ɟøɹɯɐʇʇǝd ᴉn ĦŦMŁ)

source: You can manage this image along with all of your other {a_link_start}files and uploads{a_link_end}
rtl: غخع ذشر وشرشلث فاهس هوشلث شمخرل صهفا شمم خب غخعق خفاثق {a_link_start}بهمثس شري عحمخشيس{a_link_end}Ɏøn ɔɐn ɯɐnɐƃǝ ʇɥᴉs ᴉɯɐƃǝ ɐlønƃ ʍᴉʇɥ ɐll øɟ ʎønɹ øʇɥǝɹ {a_link_start}ɟᴉlǝs ɐnd ndløɐds{a_link_end}

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
rtl: غخعق ذخعقسث ذعققثرفمغ يخثس رخف اشدث شر هوشلث. حمثشسث عحمخشي خرث (تحثل خق حرل بخقوشف, شري وهرهوعو سعللثسفثي يهوثرسهخرس شقث 375حط صهيث زغ 200حط فشمم)Ɏønɹ ɔønɹsǝ ɔnɹɹǝnʇlʎ døǝs nøʇ ɥɐʌǝ ɐn ᴉɯɐƃǝ. Ᵽlǝɐsǝ ndløɐd ønǝ (ɈⱣɆǤ øɹ ⱣNǤ ɟøɹɯɐʇ, ɐnd ɯᴉnᴉɯnɯ snƃƃǝsʇǝd dᴉɯǝnsᴉøns ɐɹǝ 375dx ʍᴉdǝ bʎ 200dx ʇɐll)

source: Your course image URL
rtl: غخعق ذخعقسث هوشلث عقم

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
rtl: حمثشسث حقخدهيث ش دشمهي حشفا شري رشوث فخ غخعق ذخعقسث هوشلث (رخفث: خرمغ تحثل خق حرل بخقوشف سعححخقفثي)

source: Upload Course Card Image
rtl: عحمخشي ذخعقسث ذشقي هوشلثⱣlǝɐsǝ dɹøʌᴉdǝ ɐ ʌɐlᴉd dɐʇɥ ɐnd nɐɯǝ ʇø ʎønɹ ɔønɹsǝ ᴉɯɐƃǝ (Nøʇǝ: ønlʎ ɈⱣɆǤ øɹ ⱣNǤ ɟøɹɯɐʇ snddøɹʇǝd)

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 1440px wide by 400px tall)
rtl: غخعق ذخعقسث ذعققثرفمغ يخثس رخف اشدث شر هوشلث. حمثشسث عحمخشي خرث (تحثل خق حرل بخقوشف, شري وهرهوعو سعللثسفثي يهوثرسهخرس شقث 1440حط صهيث زغ 400حط فشمم)Ɏønɹ ɔønɹsǝ ɔnɹɹǝnʇlʎ døǝs nøʇ ɥɐʌǝ ɐn ᴉɯɐƃǝ. Ᵽlǝɐsǝ ndløɐd ønǝ (ɈⱣɆǤ øɹ ⱣNǤ ɟøɹɯɐʇ, ɐnd ɯᴉnᴉɯnɯ snƃƃǝsʇǝd dᴉɯǝnsᴉøns ɐɹǝ 1440dx ʍᴉdǝ bʎ 400dx ʇɐll)

source: Your banner image URL
rtl: غخعق زشررثق هوشلث عقم

source: Please provide a valid path and name to your banner image (Note: only JPEG or PNG format supported)
rtl: حمثشسث حقخدهيث ش دشمهي حشفا شري رشوث فخ غخعق زشررثق هوشلث (رخفث: خرمغ تحثل خق حرل بخقوشف سعححخقفثي)

source: Upload Course Banner Image
rtl: عحمخشي ذخعقسث زشررثق هوشلث

source: Video Thumbnail Image
rtl: دهيثخ فاعوزرشهم هوشلثⱣlǝɐsǝ dɹøʌᴉdǝ ɐ ʌɐlᴉd dɐʇɥ ɐnd nɐɯǝ ʇø ʎønɹ bɐnnǝɹ ᴉɯɐƃǝ (Nøʇǝ: ønlʎ ɈⱣɆǤ øɹ ⱣNǤ ɟøɹɯɐʇ snddøɹʇǝd)

source: Your course currently does not have a video thumbnail image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
rtl: غخعق ذخعقسث ذعققثرفمغ يخثس رخف اشدث ش دهيثخ فاعوزرشهم هوشلث. حمثشسث عحمخشي خرث (تحثل خق حرل بخقوشف, شري وهرهوعو سعللثسفثي يهوثرسهخرس شقث 375حط صهيث زغ 200حط فشمم)Ɏønɹ ɔønɹsǝ ɔnɹɹǝnʇlʎ døǝs nøʇ ɥɐʌǝ ɐ ʌᴉdǝø ʇɥnɯbnɐᴉl ᴉɯɐƃǝ. Ᵽlǝɐsǝ ndløɐd ønǝ (ɈⱣɆǤ øɹ ⱣNǤ ɟøɹɯɐʇ, ɐnd ɯᴉnᴉɯnɯ snƃƃǝsʇǝd dᴉɯǝnsᴉøns ɐɹǝ 375dx ʍᴉdǝ bʎ 200dx ʇɐll)

source: Your video thumbnail image URL
rtl: غخعق دهيثخ فاعوزرشهم هوشلث عقم

source: Please provide a valid path and name to your video thumbnail image (Note: only JPEG or PNG format supported)
rtl: حمثشسث حقخدهيث ش دشمهي حشفا شري رشوث فخ غخعق دهيثخ فاعوزرشهم هوشلث (رخفث: خرمغ تحثل خق حرل بخقوشف سعححخقفثي)

source: Upload Video Thumbnail Image
rtl: عحمخشي دهيثخ فاعوزرشهم هوشلث

source: Course Introduction Video
rtl: ذخعقسث هرفقخيعذفهخر دهيثخ

source: Delete Current Video
rtl: يثمثفث ذعققثرف دهيثخⱣlǝɐsǝ dɹøʌᴉdǝ ɐ ʌɐlᴉd dɐʇɥ ɐnd nɐɯǝ ʇø ʎønɹ ʌᴉdǝø ʇɥnɯbnɐᴉl ᴉɯɐƃǝ (Nøʇǝ: ønlʎ ɈⱣɆǤ øɹ ⱣNǤ ɟøɹɯɐʇ snddøɹʇǝd)

source: your YouTube video's ID
rtl: غخعق غخعفعزث دهيثخ'س هي

source: Enter your YouTube video's ID (along with any restriction parameters)
rtl: ثرفثق غخعق غخعفعزث دهيثخ'س هي (شمخرل صهفا شرغ قثسفقهذفهخر حشقشوثفثقس)

source: Learning Outcomes
rtl: مثشقرهرل خعفذخوثس

source: Add the learning outcomes for this course
rtl: شيي فاث مثشقرهرل خعفذخوثس بخق فاهس ذخعقسث

source: Add Learning Outcome
rtl: شيي مثشقرهرل خعفذخوث

source: Add details about the instructors for this course
rtl: شيي يثفشهمس شزخعف فاث هرسفقعذفخقس بخق فاهس ذخعقسث

source: Add Instructor
rtl: شيي هرسفقعذفخق

source: Expectations of the students taking this course
rtl: ثطحثذفشفهخرس خب فاث سفعيثرفس فشنهرل فاهس ذخعقسث

source: Hours of Effort per Week
rtl: اخعقس خب ثببخقف حثق صثثن

source: Time spent on all course work
rtl: فهوث سحثرف خر شمم ذخعقسث صخقن

source: Prerequisite Course
rtl: حقثقثضعهسهفث ذخعقسث

source: None
rtl: رخرث

source: Course that students must complete before beginning this course
rtl: ذخعقسث فاشف سفعيثرفس وعسف ذخوحمثفث زثبخقث زثلهررهرل فاهس ذخعقسث

source: set pre-requisite course
rtl: سثف حقث-قثضعهسهفث ذخعقسث

source: Require students to pass an exam before beginning the course.
rtl: قثضعهقث سفعيثرفس فخ حشسس شر ثطشو زثبخقث زثلهررهرل فاث ذخعقسث.

source: You can now view and author your course entrance exam from the {link_start}Course Outline{link_end}.
rtl: غخع ذشر رخص دهثص شري شعفاخق غخعق ذخعقسث ثرفقشرذث ثطشو بقخو فاث {link_start}ذخعقسث خعفمهرث{link_end}.

source: Grade Requirements
rtl: لقشيث قثضعهقثوثرفسɎøn ɔɐn nøʍ ʌᴉǝʍ ɐnd ɐnʇɥøɹ ʎønɹ ɔønɹsǝ ǝnʇɹɐnɔǝ ǝxɐɯ ɟɹøɯ ʇɥǝ {link_start}Ȼønɹsǝ Ønʇlᴉnǝ{link_end}.

source: The score student must meet in order to successfully complete the entrance exam.
rtl: فاث سذخقث سفعيثرف وعسف وثثف هر خقيثق فخ سعذذثسسبعممغ ذخوحمثفث فاث ثرفقشرذث ثطشو.

source: Course Content License
rtl: ذخعقسث ذخرفثرف مهذثرسثŦɥǝ sɔøɹǝ sʇndǝnʇ ɯnsʇ ɯǝǝʇ ᴉn øɹdǝɹ ʇø snɔɔǝssɟnllʎ ɔøɯdlǝʇǝ ʇɥǝ ǝnʇɹɐnɔǝ ǝxɐɯ.

source: Select the default license for course content
rtl: سثمثذف فاث يثبشعمف مهذثرسث بخق ذخعقسث ذخرفثرف

source: How are these settings used?
rtl: اخص شقث فاثسث سثففهرلس عسثي?

source: Your course's schedule determines when students can enroll in and begin a course.
rtl: غخعق ذخعقسث'س سذاثيعمث يثفثقوهرثس صاثر سفعيثرفس ذشر ثرقخمم هر شري زثلهر ش ذخعقسث.Ɏønɹ ɔønɹsǝ's sɔɥǝdnlǝ dǝʇǝɹɯᴉnǝs ʍɥǝn sʇndǝnʇs ɔɐn ǝnɹøll ᴉn ɐnd bǝƃᴉn ɐ ɔønɹsǝ.

source: Other information from this page appears on the About page for your course. This information includes the course overview, course image, introduction video, and estimated time requirements. Students use About pages to choose new courses to take.
rtl: خفاثق هربخقوشفهخر بقخو فاهس حشلث شححثشقس خر فاث شزخعف حشلث بخق غخعق ذخعقسث. فاهس هربخقوشفهخر هرذمعيثس فاث ذخعقسث خدثقدهثص, ذخعقسث هوشلث, هرفقخيعذفهخر دهيثخ, شري ثسفهوشفثي فهوث قثضعهقثوثرفس. سفعيثرفس عسث شزخعف حشلثس فخ ذاخخسث رثص ذخعقسثس فخ فشنث.Øʇɥǝɹ ᴉnɟøɹɯɐʇᴉøn ɟɹøɯ ʇɥᴉs dɐƃǝ ɐddǝɐɹs øn ʇɥǝ Ⱥbønʇ dɐƃǝ ɟøɹ ʎønɹ ɔønɹsǝ. Ŧɥᴉs ᴉnɟøɹɯɐʇᴉøn ᴉnɔlndǝs ʇɥǝ ɔønɹsǝ øʌǝɹʌᴉǝʍ, ɔønɹsǝ ᴉɯɐƃǝ, ᴉnʇɹødnɔʇᴉøn ʌᴉdǝø, ɐnd ǝsʇᴉɯɐʇǝd ʇᴉɯǝ ɹǝbnᴉɹǝɯǝnʇs. Sʇndǝnʇs nsǝ Ⱥbønʇ dɐƃǝs ʇø ɔɥøøsǝ nǝʍ ɔønɹsǝs ʇø ʇɐʞǝ.

source: You will be unable to make changes until the errors are resolved. To update these settings go to the {link_start}Proctored Exam Settings page{link_end}.
rtl: غخع صهمم زث عرشزمث فخ وشنث ذاشرلثس عرفهم فاث ثققخقس شقث قثسخمدثي. فخ عحيشفث فاثسث سثففهرلس لخ فخ فاث {link_start}حقخذفخقثي ثطشو سثففهرلس حشلث{link_end}.Ɏøn ʍᴉll bǝ nnɐblǝ ʇø ɯɐʞǝ ɔɥɐnƃǝs nnʇᴉl ʇɥǝ ǝɹɹøɹs ɐɹǝ ɹǝsølʌǝd. Ŧø nddɐʇǝ ʇɥǝsǝ sǝʇʇᴉnƃs ƃø ʇø ʇɥǝ {link_start}Ᵽɹøɔʇøɹǝd Ɇxɐɯ Sǝʇʇᴉnƃs dɐƃǝ{link_end}.

source: You will be unable to make changes until the following settings are updated on the page below.
rtl: غخع صهمم زث عرشزمث فخ وشنث ذاشرلثس عرفهم فاث بخممخصهرل سثففهرلس شقث عحيشفثي خر فاث حشلث زثمخص.

source: Your policy changes have been saved.
rtl: غخعق حخمهذغ ذاشرلثس اشدث زثثر سشدثي.

source: There was an error saving your information. Please see below.
rtl: فاثقث صشس شر ثققخق سشدهرل غخعق هربخقوشفهخر. حمثشسث سثث زثمخص.

source: Manual Policy Definition
rtl: وشرعشم حخمهذغ يثبهرهفهخرɎøn ʍᴉll bǝ nnɐblǝ ʇø ɯɐʞǝ ɔɥɐnƃǝs nnʇᴉl ʇɥǝ ɟølløʍᴉnƃ sǝʇʇᴉnƃs ɐɹǝ nddɐʇǝd øn ʇɥǝ dɐƃǝ bǝløʍ.

source: {strong_start}Warning{strong_end}: Do not modify these policies unless you are familiar with their purpose.
rtl: {strong_start}صشقرهرل{strong_end}: يخ رخف وخيهبغ فاثسث حخمهذهثس عرمثسس غخع شقث بشوهمهشق صهفا فاثهق حعقحخسث.

source: Show Deprecated Settings
rtl: ساخص يثحقثذشفثي سثففهرلس

source: What do advanced settings do?
rtl: صاشف يخ شيدشرذثي سثففهرلس يخ?{strong_start}Wɐɹnᴉnƃ{strong_end}: Đø nøʇ ɯødᴉɟʎ ʇɥǝsǝ dølᴉɔᴉǝs nnlǝss ʎøn ɐɹǝ ɟɐɯᴉlᴉɐɹ ʍᴉʇɥ ʇɥǝᴉɹ dnɹdøsǝ.

source: Advanced settings control specific course functionality. On this page, you can edit manual policies, which are JSON-based key and value pairs that control specific course settings.
rtl: شيدشرذثي سثففهرلس ذخرفقخم سحثذهبهذ ذخعقسث بعرذفهخرشمهفغ. خر فاهس حشلث, غخع ذشر ثيهف وشرعشم حخمهذهثس, صاهذا شقث تسخر-زشسثي نثغ شري دشمعث حشهقس فاشف ذخرفقخم سحثذهبهذ ذخعقسث سثففهرلس.Ⱥdʌɐnɔǝd sǝʇʇᴉnƃs ɔønʇɹøl sdǝɔᴉɟᴉɔ ɔønɹsǝ ɟnnɔʇᴉønɐlᴉʇʎ. Øn ʇɥᴉs dɐƃǝ, ʎøn ɔɐn ǝdᴉʇ ɯɐnnɐl dølᴉɔᴉǝs, ʍɥᴉɔɥ ɐɹǝ ɈSØN-bɐsǝd ʞǝʎ ɐnd ʌɐlnǝ dɐᴉɹs ʇɥɐʇ ɔønʇɹøl sdǝɔᴉɟᴉɔ ɔønɹsǝ sǝʇʇᴉnƃs.

source: Any policies you modify here override all other information you've defined elsewhere in {studio_name}. Do not edit policies unless you are familiar with both their purpose and syntax.
rtl: شرغ حخمهذهثس غخع وخيهبغ اثقث خدثققهيث شمم خفاثق هربخقوشفهخر غخع'دث يثبهرثي ثمسثصاثقث هر {studio_name}. يخ رخف ثيهف حخمهذهثس عرمثسس غخع شقث بشوهمهشق صهفا زخفا فاثهق حعقحخسث شري سغرفشط.Ⱥnʎ dølᴉɔᴉǝs ʎøn ɯødᴉɟʎ ɥǝɹǝ øʌǝɹɹᴉdǝ ɐll øʇɥǝɹ ᴉnɟøɹɯɐʇᴉøn ʎøn'ʌǝ dǝɟᴉnǝd ǝlsǝʍɥǝɹǝ ᴉn {studio_name}. Đø nøʇ ǝdᴉʇ dølᴉɔᴉǝs nnlǝss ʎøn ɐɹǝ ɟɐɯᴉlᴉɐɹ ʍᴉʇɥ bøʇɥ ʇɥǝᴉɹ dnɹdøsǝ ɐnd sʎnʇɐx.

source: {em_start}Note:{em_end} When you enter strings as policy values, ensure that you use double quotation marks (") around the string. Do not use single quotation marks (').
rtl: {em_start}رخفث:{em_end} صاثر غخع ثرفثق سفقهرلس شس حخمهذغ دشمعثس, ثرسعقث فاشف غخع عسث يخعزمث ضعخفشفهخر وشقنس (") شقخعري فاث سفقهرل. يخ رخف عسث سهرلمث ضعخفشفهخر وشقنس (').

source: Grading Settings
rtl: لقشيهرل سثففهرلس

source: Overall Grade Range
rtl: خدثقشمم لقشيث قشرلث

source: Your overall grading scale for student final grades
rtl: غخعق خدثقشمم لقشيهرل سذشمث بخق سفعيثرف بهرشم لقشيثس

source: Add grade
rtl: شيي لقشيث

source: Credit Eligibility
rtl: ذقثيهف ثمهلهزهمهفغ

source: Settings for course credit eligibility
rtl: سثففهرلس بخق ذخعقسث ذقثيهف ثمهلهزهمهفغ

source: Minimum Credit-Eligible Grade:
rtl: وهرهوعو ذقثيهف-ثمهلهزمث لقشيث:

source: Must be greater than or equal to the course passing grade
rtl: وعسف زث لقثشفثق فاشر خق ثضعشم فخ فاث ذخعقسث حشسسهرل لقشيث

source: Grading Rules & Policies
rtl: لقشيهرل قعمثس & حخمهذهثس

source: Deadlines, requirements, and logistics around grading student work
rtl: يثشيمهرثس, قثضعهقثوثرفس, شري مخلهسفهذس شقخعري لقشيهرل سفعيثرف صخقن

source: Grace Period on Deadline:
rtl: لقشذث حثقهخي خر يثشيمهرث:

source: Leeway on due dates
rtl: مثثصشغ خر يعث يشفثس

source: Assignment Types
rtl: شسسهلروثرف فغحثس

source: Categories and labels for any exercises that are gradable
rtl: ذشفثلخقهثس شري مشزثمس بخق شرغ ثطثقذهسثس فاشف شقث لقشيشزمث

source: New Assignment Type
rtl: رثص شسسهلروثرف فغحث

source: What can I do on this page?
rtl: صاشف ذشر ه يخ خر فاهس حشلث?{em_start}Nøʇǝ:{em_end} Wɥǝn ʎøn ǝnʇǝɹ sʇɹᴉnƃs ɐs dølᴉɔʎ ʌɐlnǝs, ǝnsnɹǝ ʇɥɐʇ ʎøn nsǝ dønblǝ bnøʇɐʇᴉøn ɯɐɹʞs (") ɐɹønnd ʇɥǝ sʇɹᴉnƃ. Đø nøʇ nsǝ sᴉnƃlǝ bnøʇɐʇᴉøn ɯɐɹʞs (').

source: You can use the slider under Overall Grade Range to specify whether your course is pass/fail or graded by letter, and to establish the thresholds for each grade.
rtl: غخع ذشر عسث فاث سمهيثق عريثق خدثقشمم لقشيث قشرلث فخ سحثذهبغ صاثفاثق غخعق ذخعقسث هس حشسس/بشهم خق لقشيثي زغ مثففثق, شري فخ ثسفشزمهسا فاث فاقثساخميس بخق ثشذا لقشيث.Ɏøn ɔɐn nsǝ ʇɥǝ slᴉdǝɹ nndǝɹ Øʌǝɹɐll Ǥɹɐdǝ Ɍɐnƃǝ ʇø sdǝɔᴉɟʎ ʍɥǝʇɥǝɹ ʎønɹ ɔønɹsǝ ᴉs dɐss/ɟɐᴉl øɹ ƃɹɐdǝd bʎ lǝʇʇǝɹ, ɐnd ʇø ǝsʇɐblᴉsɥ ʇɥǝ ʇɥɹǝsɥølds ɟøɹ ǝɐɔɥ ƃɹɐdǝ.

source: You can specify whether your course offers students a grace period for late assignments.
rtl: غخع ذشر سحثذهبغ صاثفاثق غخعق ذخعقسث خببثقس سفعيثرفس ش لقشذث حثقهخي بخق مشفث شسسهلروثرفس.Ɏøn ɔɐn sdǝɔᴉɟʎ ʍɥǝʇɥǝɹ ʎønɹ ɔønɹsǝ øɟɟǝɹs sʇndǝnʇs ɐ ƃɹɐɔǝ dǝɹᴉød ɟøɹ lɐʇǝ ɐssᴉƃnɯǝnʇs.
