Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Source code for LaTeX documents. This feature is not well-supported.
rtl: سخعقذث ذخيث بخق مشفثط يخذعوثرفس. فاهس بثشفعقث هس رخف صثمم-سعححخقفثي.ɆɌɌØɌ: "{block_type}" ᴉs ɐn nnʞnøʍn ɔøɯdønǝnʇ ʇʎdǝ. Ŧɥᴉs ɔøɯdønǝnʇ ʍᴉll bǝ ɥᴉddǝn ᴉn ŁMS.

source: Select Visual to enter content and have the editor automatically create the HTML. Select Raw to edit HTML directly. If you change this setting, you must save the component and then re-open it for editing.
rtl: سثمثذف دهسعشم فخ ثرفثق ذخرفثرف شري اشدث فاث ثيهفخق شعفخوشفهذشممغ ذقثشفث فاث افوم. سثمثذف قشص فخ ثيهف افوم يهقثذفمغ. هب غخع ذاشرلث فاهس سثففهرل, غخع وعسف سشدث فاث ذخوحخرثرف شري فاثر قث-خحثر هف بخق ثيهفهرل.

source: Editor
rtl: ثيهفخق

source: Visual
rtl: دهسعشم

source: Raw
rtl: قشص

source: Hide Page From Learners
rtl: اهيث حشلث بقخو مثشقرثقسSǝlǝɔʇ Vᴉsnɐl ʇø ǝnʇǝɹ ɔønʇǝnʇ ɐnd ɥɐʌǝ ʇɥǝ ǝdᴉʇøɹ ɐnʇøɯɐʇᴉɔɐllʎ ɔɹǝɐʇǝ ʇɥǝ ĦŦMŁ. Sǝlǝɔʇ Ɍɐʍ ʇø ǝdᴉʇ ĦŦMŁ dᴉɹǝɔʇlʎ. Ɨɟ ʎøn ɔɥɐnƃǝ ʇɥᴉs sǝʇʇᴉnƃ, ʎøn ɯnsʇ sɐʌǝ ʇɥǝ ɔøɯdønǝnʇ ɐnd ʇɥǝn ɹǝ-ødǝn ᴉʇ ɟøɹ ǝdᴉʇᴉnƃ.

source: If you select this option, only course team members with the Staff or Admin role see this page.
rtl: هب غخع سثمثذف فاهس خحفهخر, خرمغ ذخعقسث فثشو وثوزثقس صهفا فاث سفشبب خق شيوهر قخمث سثث فاهس حشلث.

source: HTML for the additional pages
rtl: افوم بخق فاث شييهفهخرشم حشلثس

source: List of course update items
rtl: مهسف خب ذخعقسث عحيشفث هفثوس

source: Any Type
rtl: شرغ فغحثƗɟ ʎøn sǝlǝɔʇ ʇɥᴉs ødʇᴉøn, ønlʎ ɔønɹsǝ ʇǝɐɯ ɯǝɯbǝɹs ʍᴉʇɥ ʇɥǝ Sʇɐɟɟ øɹ Ⱥdɯᴉn ɹølǝ sǝǝ ʇɥᴉs dɐƃǝ.

source: Library
rtl: مهزقشقغ

source: Select the library from which you want to draw content.
rtl: سثمثذف فاث مهزقشقغ بقخو صاهذا غخع صشرف فخ يقشص ذخرفثرف.

source: Library Version
rtl: مهزقشقغ دثقسهخر

source: Determines how content is drawn from the library
rtl: يثفثقوهرثس اخص ذخرفثرف هس يقشصر بقخو فاث مهزقشقغ

source: Choose n at random
rtl: ذاخخسث ر شف قشريخو

source: Count
rtl: ذخعرف

source: Enter the number of components to display to each student.
rtl: ثرفثق فاث رعوزثق خب ذخوحخرثرفس فخ يهسحمشغ فخ ثشذا سفعيثرف.

source: Problem Type
rtl: حقخزمثو فغحث

source: Choose a problem type to fetch from the library. If "Any Type" is selected no filtering is applied.
rtl: ذاخخسث ش حقخزمثو فغحث فخ بثفذا بقخو فاث مهزقشقغ. هب "شرغ فغحث" هس سثمثذفثي رخ بهمفثقهرل هس شححمهثي.

source: This component is out of date. The library has new content.
rtl: فاهس ذخوحخرثرف هس خعف خب يشفث. فاث مهزقشقغ اشس رثص ذخرفثرف.Ȼɥøøsǝ ɐ dɹøblǝɯ ʇʎdǝ ʇø ɟǝʇɔɥ ɟɹøɯ ʇɥǝ lᴉbɹɐɹʎ. Ɨɟ "Ⱥnʎ Ŧʎdǝ" ᴉs sǝlǝɔʇǝd nø ɟᴉlʇǝɹᴉnƃ ᴉs ɐddlᴉǝd.

source: {refresh_icon} Update now.
rtl: {refresh_icon} عحيشفث رخص.

source: Library is invalid, corrupt, or has been deleted.
rtl: مهزقشقغ هس هردشمهي, ذخققعحف, خق اشس زثثر يثمثفثي.

source: Edit Library List.
rtl: ثيهف مهزقشقغ مهسف.

source: This course does not support content libraries. Contact your system administrator for more information.
rtl: فاهس ذخعقسث يخثس رخف سعححخقف ذخرفثرف مهزقشقهثس. ذخرفشذف غخعق سغسفثو شيوهرهسفقشفخق بخق وخقث هربخقوشفهخر.

source: A library has not yet been selected.
rtl: ش مهزقشقغ اشس رخف غثف زثثر سثمثذفثي.

source: Select a Library.
rtl: سثمثذف ش مهزقشقغ.

source: There are no matching problem types in the specified libraries.
rtl: فاثقث شقث رخ وشفذاهرل حقخزمثو فغحثس هر فاث سحثذهبهثي مهزقشقهثس.

source: Select another problem type.
rtl: سثمثذف شرخفاثق حقخزمثو فغحث.Ŧɥᴉs ɔønɹsǝ døǝs nøʇ snddøɹʇ ɔønʇǝnʇ lᴉbɹɐɹᴉǝs. Ȼønʇɐɔʇ ʎønɹ sʎsʇǝɯ ɐdɯᴉnᴉsʇɹɐʇøɹ ɟøɹ ɯøɹǝ ᴉnɟøɹɯɐʇᴉøn.

source: The specified library is configured to fetch {count} problem,
rtl: فاث سحثذهبهثي مهزقشقغ هس ذخربهلعقثي فخ بثفذا {count} حقخزمثو,

source: but there is only {actual} matching problem.
rtl: زعف فاثقث هس خرمغ {actual} وشفذاهرل حقخزمثو.

source: Edit the library configuration.
rtl: ثيهف فاث مهزقشقغ ذخربهلعقشفهخر.

source: Invalid Library
rtl: هردشمهي مهزقشقغ

source: No Library Selected
rtl: رخ مهزقشقغ سثمثذفثي

source: Library Display Name
rtl: مهزقشقغ يهسحمشغ رشوث

source: Enter the names of the advanced components to use in your library.
rtl: ثرفثق فاث رشوثس خب فاث شيدشرذثي ذخوحخرثرفس فخ عسث هر غخعق مهزقشقغ.

source: Library Blocks List
rtl: مهزقشقغ زمخذنس مهسف

source: Enter the IDs of the library XBlocks that you wish to use.
rtl: ثرفثق فاث هيس خب فاث مهزقشقغ طزمخذنس فاشف غخع صهسا فخ عسث.

source: A maximum of {0} components may be added.
rtl: ش وشطهوعو خب {0} ذخوحخرثرفس وشغ زث شييثي.

source: No XBlock has been configured for this component. Use the editor to select the target blocks.
rtl: رخ طزمخذن اشس زثثر ذخربهلعقثي بخق فاهس ذخوحخرثرف. عسث فاث ثيهفخق فخ سثمثذف فاث فشقلثف زمخذنس.

source: Open Editor
rtl: خحثر ثيهفخق

source: Importing Library Block failed - are the IDs valid and readable?
rtl: هوحخقفهرل مهزقشقغ زمخذن بشهمثي - شقث فاث هيس دشمهي شري قثشيشزمث?Nø XɃløɔʞ ɥɐs bǝǝn ɔønɟᴉƃnɹǝd ɟøɹ ʇɥᴉs ɔøɯdønǝnʇ. Ʉsǝ ʇɥǝ ǝdᴉʇøɹ ʇø sǝlǝɔʇ ʇɥǝ ʇɐɹƃǝʇ bløɔʞs.

source: The display name for this component. Analytics reports may also use the display name to identify this component.
rtl: فاث يهسحمشغ رشوث بخق فاهس ذخوحخرثرف. شرشمغفهذس قثحخقفس وشغ شمسخ عسث فاث يهسحمشغ رشوث فخ هيثرفهبغ فاهس ذخوحخرثرف.

source: LTI ID
rtl: مفه هيŦɥǝ dᴉsdlɐʎ nɐɯǝ ɟøɹ ʇɥᴉs ɔøɯdønǝnʇ. Ⱥnɐlʎʇᴉɔs ɹǝdøɹʇs ɯɐʎ ɐlsø nsǝ ʇɥǝ dᴉsdlɐʎ nɐɯǝ ʇø ᴉdǝnʇᴉɟʎ ʇɥᴉs ɔøɯdønǝnʇ.

source: Enter the LTI ID for the external LTI provider. This value must be the same LTI ID that you entered in the LTI Passports setting on the Advanced Settings page.{break_tag}See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
rtl: ثرفثق فاث مفه هي بخق فاث ثطفثقرشم مفه حقخدهيثق. فاهس دشمعث وعسف زث فاث سشوث مفه هي فاشف غخع ثرفثقثي هر فاث مفه حشسسحخقفس سثففهرل خر فاث شيدشرذثي سثففهرلس حشلث.{break_tag}سثث {docs_anchor_open}فاث ثيط مفه يخذعوثرفشفهخر{anchor_close} بخق وخقث يثفشهمس خر فاهس سثففهرل.

source: LTI URL
rtl: مفه عقمɆnʇǝɹ ʇɥǝ ŁŦƗ ƗĐ ɟøɹ ʇɥǝ ǝxʇǝɹnɐl ŁŦƗ dɹøʌᴉdǝɹ. Ŧɥᴉs ʌɐlnǝ ɯnsʇ bǝ ʇɥǝ sɐɯǝ ŁŦƗ ƗĐ ʇɥɐʇ ʎøn ǝnʇǝɹǝd ᴉn ʇɥǝ ŁŦƗ Ᵽɐssdøɹʇs sǝʇʇᴉnƃ øn ʇɥǝ Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs dɐƃǝ.{break_tag}Sǝǝ {docs_anchor_open}ʇɥǝ ǝdX ŁŦƗ døɔnɯǝnʇɐʇᴉøn{anchor_close} ɟøɹ ɯøɹǝ dǝʇɐᴉls øn ʇɥᴉs sǝʇʇᴉnƃ.

source: Enter the URL of the external tool that this component launches. This setting is only used when Hide External Tool is set to False.{break_tag}See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
rtl: ثرفثق فاث عقم خب فاث ثطفثقرشم فخخم فاشف فاهس ذخوحخرثرف مشعرذاثس. فاهس سثففهرل هس خرمغ عسثي صاثر اهيث ثطفثقرشم فخخم هس سثف فخ بشمسث.{break_tag}سثث {docs_anchor_open}فاث ثيط مفه يخذعوثرفشفهخر{anchor_close} بخق وخقث يثفشهمس خر فاهس سثففهرل.

source: Custom Parameters
rtl: ذعسفخو حشقشوثفثقسɆnʇǝɹ ʇɥǝ ɄɌŁ øɟ ʇɥǝ ǝxʇǝɹnɐl ʇøøl ʇɥɐʇ ʇɥᴉs ɔøɯdønǝnʇ lɐnnɔɥǝs. Ŧɥᴉs sǝʇʇᴉnƃ ᴉs ønlʎ nsǝd ʍɥǝn Ħᴉdǝ Ɇxʇǝɹnɐl Ŧøøl ᴉs sǝʇ ʇø Fɐlsǝ.{break_tag}Sǝǝ {docs_anchor_open}ʇɥǝ ǝdX ŁŦƗ døɔnɯǝnʇɐʇᴉøn{anchor_close} ɟøɹ ɯøɹǝ dǝʇɐᴉls øn ʇɥᴉs sǝʇʇᴉnƃ.

source: Add the key/value pair for any custom parameters, such as the page your e-book should open to or the background color for this component.{break_tag}See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
rtl: شيي فاث نثغ/دشمعث حشهق بخق شرغ ذعسفخو حشقشوثفثقس, سعذا شس فاث حشلث غخعق ث-زخخن ساخعمي خحثر فخ خق فاث زشذنلقخعري ذخمخق بخق فاهس ذخوحخرثرف.{break_tag}سثث {docs_anchor_open}فاث ثيط مفه يخذعوثرفشفهخر{anchor_close} بخق وخقث يثفشهمس خر فاهس سثففهرل.

source: Open in New Page
rtl: خحثر هر رثص حشلثȺdd ʇɥǝ ʞǝʎ/ʌɐlnǝ dɐᴉɹ ɟøɹ ɐnʎ ɔnsʇøɯ dɐɹɐɯǝʇǝɹs, snɔɥ ɐs ʇɥǝ dɐƃǝ ʎønɹ ǝ-bøøʞ sɥønld ødǝn ʇø øɹ ʇɥǝ bɐɔʞƃɹønnd ɔøløɹ ɟøɹ ʇɥᴉs ɔøɯdønǝnʇ.{break_tag}Sǝǝ {docs_anchor_open}ʇɥǝ ǝdX ŁŦƗ døɔnɯǝnʇɐʇᴉøn{anchor_close} ɟøɹ ɯøɹǝ dǝʇɐᴉls øn ʇɥᴉs sǝʇʇᴉnƃ.

source: Select True if you want students to click a link that opens the LTI tool in a new window. Select False if you want the LTI content to open in an IFrame in the current page. This setting is only used when Hide External Tool is set to False.
rtl: سثمثذف فقعث هب غخع صشرف سفعيثرفس فخ ذمهذن ش مهرن فاشف خحثرس فاث مفه فخخم هر ش رثص صهريخص. سثمثذف بشمسث هب غخع صشرف فاث مفه ذخرفثرف فخ خحثر هر شر هبقشوث هر فاث ذعققثرف حشلث. فاهس سثففهرل هس خرمغ عسثي صاثر اهيث ثطفثقرشم فخخم هس سثف فخ بشمسث.

source: Scored
rtl: سذخقثيSǝlǝɔʇ Ŧɹnǝ ᴉɟ ʎøn ʍɐnʇ sʇndǝnʇs ʇø ɔlᴉɔʞ ɐ lᴉnʞ ʇɥɐʇ ødǝns ʇɥǝ ŁŦƗ ʇøøl ᴉn ɐ nǝʍ ʍᴉndøʍ. Sǝlǝɔʇ Fɐlsǝ ᴉɟ ʎøn ʍɐnʇ ʇɥǝ ŁŦƗ ɔønʇǝnʇ ʇø ødǝn ᴉn ɐn ƗFɹɐɯǝ ᴉn ʇɥǝ ɔnɹɹǝnʇ dɐƃǝ. Ŧɥᴉs sǝʇʇᴉnƃ ᴉs ønlʎ nsǝd ʍɥǝn Ħᴉdǝ Ɇxʇǝɹnɐl Ŧøøl ᴉs sǝʇ ʇø Fɐlsǝ.

source: Select True if this component will receive a numerical score from the external LTI system.
rtl: سثمثذف فقعث هب فاهس ذخوحخرثرف صهمم قثذثهدث ش رعوثقهذشم سذخقث بقخو فاث ثطفثقرشم مفه سغسفثو.

source: Weight
rtl: صثهلافSǝlǝɔʇ Ŧɹnǝ ᴉɟ ʇɥᴉs ɔøɯdønǝnʇ ʍᴉll ɹǝɔǝᴉʌǝ ɐ nnɯǝɹᴉɔɐl sɔøɹǝ ɟɹøɯ ʇɥǝ ǝxʇǝɹnɐl ŁŦƗ sʎsʇǝɯ.

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
rtl: ثرفثق فاث رعوزثق خب حخهرفس حخسسهزمث بخق فاهس ذخوحخرثرف. فاث يثبشعمف دشمعث هس 1.0. فاهس سثففهرل هس خرمغ عسثي صاثر سذخقثي هس سثف فخ فقعث.Ɇnʇǝɹ ʇɥǝ nnɯbǝɹ øɟ døᴉnʇs døssᴉblǝ ɟøɹ ʇɥᴉs ɔøɯdønǝnʇ. Ŧɥǝ dǝɟɐnlʇ ʌɐlnǝ ᴉs 1.0. Ŧɥᴉs sǝʇʇᴉnƃ ᴉs ønlʎ nsǝd ʍɥǝn Sɔøɹǝd ᴉs sǝʇ ʇø Ŧɹnǝ.

source: The score kept in the xblock KVS -- duplicate of the published score in django DB
rtl: فاث سذخقث نثحف هر فاث طزمخذن ندس -- يعحمهذشفث خب فاث حعزمهساثي سذخقث هر يتشرلخ يز

source: Comment as returned from grader, LTI2.0 spec
rtl: ذخووثرف شس قثفعقرثي بقخو لقشيثق, مفه2.0 سحثذ

source: Hide External Tool
rtl: اهيث ثطفثقرشم فخخمŦɥǝ sɔøɹǝ ʞǝdʇ ᴉn ʇɥǝ xbløɔʞ ꝀVS -- dndlᴉɔɐʇǝ øɟ ʇɥǝ dnblᴉsɥǝd sɔøɹǝ ᴉn dɾɐnƃø ĐɃ

source: Select True if you want to use this component as a placeholder for syncing with an external grading system rather than launch an external tool. This setting hides the Launch button and any IFrames for this component.
rtl: سثمثذف فقعث هب غخع صشرف فخ عسث فاهس ذخوحخرثرف شس ش حمشذثاخميثق بخق سغرذهرل صهفا شر ثطفثقرشم لقشيهرل سغسفثو قشفاثق فاشر مشعرذا شر ثطفثقرشم فخخم. فاهس سثففهرل اهيثس فاث مشعرذا زعففخر شري شرغ هبقشوثس بخق فاهس ذخوحخرثرف.

source: Request user's username
rtl: قثضعثسف عسثق'س عسثقرشوثSǝlǝɔʇ Ŧɹnǝ ᴉɟ ʎøn ʍɐnʇ ʇø nsǝ ʇɥᴉs ɔøɯdønǝnʇ ɐs ɐ dlɐɔǝɥøldǝɹ ɟøɹ sʎnɔᴉnƃ ʍᴉʇɥ ɐn ǝxʇǝɹnɐl ƃɹɐdᴉnƃ sʎsʇǝɯ ɹɐʇɥǝɹ ʇɥɐn lɐnnɔɥ ɐn ǝxʇǝɹnɐl ʇøøl. Ŧɥᴉs sǝʇʇᴉnƃ ɥᴉdǝs ʇɥǝ Łɐnnɔɥ bnʇʇøn ɐnd ɐnʎ ƗFɹɐɯǝs ɟøɹ ʇɥᴉs ɔøɯdønǝnʇ.

source: Select True to request the user's username.
rtl: سثمثذف فقعث فخ قثضعثسف فاث عسثق'س عسثقرشوث.

source: Request user's email
rtl: قثضعثسف عسثق'س ثوشهم

source: Select True to request the user's email address.
rtl: سثمثذف فقعث فخ قثضعثسف فاث عسثق'س ثوشهم شييقثسس.

source: LTI Application Information
rtl: مفه شححمهذشفهخر هربخقوشفهخر

source: Enter a description of the third party application. If requesting username and/or email, use this text box to inform users why their username and/or email will be forwarded to a third party application.
rtl: ثرفثق ش يثسذقهحفهخر خب فاث فاهقي حشقفغ شححمهذشفهخر. هب قثضعثسفهرل عسثقرشوث شري/خق ثوشهم, عسث فاهس فثطف زخط فخ هربخقو عسثقس صاغ فاثهق عسثقرشوث شري/خق ثوشهم صهمم زث بخقصشقيثي فخ ش فاهقي حشقفغ شححمهذشفهخر.

source: Button Text
rtl: زعففخر فثطفɆnʇǝɹ ɐ dǝsɔɹᴉdʇᴉøn øɟ ʇɥǝ ʇɥᴉɹd dɐɹʇʎ ɐddlᴉɔɐʇᴉøn. Ɨɟ ɹǝbnǝsʇᴉnƃ nsǝɹnɐɯǝ ɐnd/øɹ ǝɯɐᴉl, nsǝ ʇɥᴉs ʇǝxʇ bøx ʇø ᴉnɟøɹɯ nsǝɹs ʍɥʎ ʇɥǝᴉɹ nsǝɹnɐɯǝ ɐnd/øɹ ǝɯɐᴉl ʍᴉll bǝ ɟøɹʍɐɹdǝd ʇø ɐ ʇɥᴉɹd dɐɹʇʎ ɐddlᴉɔɐʇᴉøn.

source: Enter the text on the button used to launch the third party application.
rtl: ثرفثق فاث فثطف خر فاث زعففخر عسثي فخ مشعرذا فاث فاهقي حشقفغ شححمهذشفهخر.

source: Accept grades past deadline
rtl: شذذثحف لقشيثس حشسف يثشيمهرثɆnʇǝɹ ʇɥǝ ʇǝxʇ øn ʇɥǝ bnʇʇøn nsǝd ʇø lɐnnɔɥ ʇɥǝ ʇɥᴉɹd dɐɹʇʎ ɐddlᴉɔɐʇᴉøn.

source: Select True to allow third party systems to post grades past the deadline.
rtl: سثمثذف فقعث فخ شممخص فاهقي حشقفغ سغسفثوس فخ حخسف لقشيثس حشسف فاث يثشيمهرث.Sǝlǝɔʇ Ŧɹnǝ ʇø ɐlløʍ ʇɥᴉɹd dɐɹʇʎ sʎsʇǝɯs ʇø døsʇ ƃɹɐdǝs dɐsʇ ʇɥǝ dǝɐdlᴉnǝ.

source: Could not parse custom parameter: {custom_parameter}. Should be "x=y" string.
rtl: ذخعمي رخف حشقسث ذعسفخو حشقشوثفثق: {custom_parameter}. ساخعمي زث "ط=غ" سفقهرل.Ȼønld nøʇ dɐɹsǝ ɔnsʇøɯ dɐɹɐɯǝʇǝɹ: {custom_parameter}. Sɥønld bǝ "x=ʎ" sʇɹᴉnƃ.

source: Could not parse LTI passport: {lti_passport}. Should be "id:key:secret" string.
rtl: ذخعمي رخف حشقسث مفه حشسسحخقف: {lti_passport}. ساخعمي زث "هي:نثغ:سثذقثف" سفقهرل.Ȼønld nøʇ dɐɹsǝ ŁŦƗ dɐssdøɹʇ: {lti_passport}. Sɥønld bǝ "ᴉd:ʞǝʎ:sǝɔɹǝʇ" sʇɹᴉnƃ.

source: Due Date
rtl: يعث يشفث

source: Enter the default date by which problems are due.
rtl: ثرفثق فاث يثبشعمف يشفث زغ صاهذا حقخزمثوس شقث يعث.

source: Number of Relative Weeks Due By
rtl: رعوزثق خب قثمشفهدث صثثنس يعث زغ

source: Enter the number of weeks the problems are due by relative to the learner's enrollment date
rtl: ثرفثق فاث رعوزثق خب صثثنس فاث حقخزمثوس شقث يعث زغ قثمشفهدث فخ فاث مثشقرثق'س ثرقخمموثرف يشفثɆnʇǝɹ ʇɥǝ nnɯbǝɹ øɟ ʍǝǝʞs ʇɥǝ dɹøblǝɯs ɐɹǝ dnǝ bʎ ɹǝlɐʇᴉʌǝ ʇø ʇɥǝ lǝɐɹnǝɹ's ǝnɹøllɯǝnʇ dɐʇǝ

source: If true, can be seen only by course staff, regardless of start date.
rtl: هب فقعث, ذشر زث سثثر خرمغ زغ ذخعقسث سفشبب, قثلشقيمثسس خب سفشقف يشفث.

source: GIT URL
rtl: لهف عقم

source: Enter the URL for the course data GIT repository.
rtl: ثرفثق فاث عقم بخق فاث ذخعقسث يشفش لهف قثحخسهفخقغ.

source: XQA Key
rtl: طضش نثغ

source: This setting is not currently supported.
rtl: فاهس سثففهرل هس رخف ذعققثرفمغ سعححخقفثي.

source: Enter the ids for the content groups this problem belongs to.
rtl: ثرفثق فاث هيس بخق فاث ذخرفثرف لقخعحس فاهس حقخزمثو زثمخرلس فخ.

source: Specify when the Show Answer button appears for each problem. Valid values are "always", "answered", "attempted", "closed", "finished", "past_due", "correct_or_past_due", "after_all_attempts", "after_all_attempts_or_correct", "attempted_no_past_due", and "never".
rtl: سحثذهبغ صاثر فاث ساخص شرسصثق زعففخر شححثشقس بخق ثشذا حقخزمثو. دشمهي دشمعثس شقث "شمصشغس", "شرسصثقثي", "شففثوحفثي", "ذمخسثي", "بهرهساثي", "حشسف_يعث", "ذخققثذف_خق_حشسف_يعث", "شبفثق_شمم_شففثوحفس", "شبفثق_شمم_شففثوحفس_خق_ذخققثذف", "شففثوحفثي_رخ_حشسف_يعث", شري "رثدثق".Sdǝɔᴉɟʎ ʍɥǝn ʇɥǝ Sɥøʍ Ⱥnsʍǝɹ bnʇʇøn ɐddǝɐɹs ɟøɹ ǝɐɔɥ dɹøblǝɯ. Vɐlᴉd ʌɐlnǝs ɐɹǝ "ɐlʍɐʎs", "ɐnsʍǝɹǝd", "ɐʇʇǝɯdʇǝd", "ɔløsǝd", "ɟᴉnᴉsɥǝd", "dɐsʇ_dnǝ", "ɔøɹɹǝɔʇ_øɹ_dɐsʇ_dnǝ", "ɐɟʇǝɹ_ɐll_ɐʇʇǝɯdʇs", "ɐɟʇǝɹ_ɐll_ɐʇʇǝɯdʇs_øɹ_ɔøɹɹǝɔʇ", "ɐʇʇǝɯdʇǝd_nø_dɐsʇ_dnǝ", ɐnd "nǝʌǝɹ".

source: Specify when to show answer correctness and score to learners. Valid values are "always", "never", and "past_due".
rtl: سحثذهبغ صاثر فخ ساخص شرسصثق ذخققثذفرثسس شري سذخقث فخ مثشقرثقس. دشمهي دشمعثس شقث "شمصشغس", "رثدثق", شري "حشسف_يعث".Sdǝɔᴉɟʎ ʍɥǝn ʇø sɥøʍ ɐnsʍǝɹ ɔøɹɹǝɔʇnǝss ɐnd sɔøɹǝ ʇø lǝɐɹnǝɹs. Vɐlᴉd ʌɐlnǝs ɐɹǝ "ɐlʍɐʎs", "nǝʌǝɹ", ɐnd "dɐsʇ_dnǝ".

source: Specify the default for how often variable values in a problem are randomized. This setting should be set to "never" unless you plan to provide a Python script to identify and randomize values in most of the problems in your course. Valid values are "always", "onreset", "never", and "per_student".
rtl: سحثذهبغ فاث يثبشعمف بخق اخص خبفثر دشقهشزمث دشمعثس هر ش حقخزمثو شقث قشريخوهظثي. فاهس سثففهرل ساخعمي زث سثف فخ "رثدثق" عرمثسس غخع حمشر فخ حقخدهيث ش حغفاخر سذقهحف فخ هيثرفهبغ شري قشريخوهظث دشمعثس هر وخسف خب فاث حقخزمثوس هر غخعق ذخعقسث. دشمهي دشمعثس شقث "شمصشغس", "خرقثسثف", "رثدثق", شري "حثق_سفعيثرف".

source: Days Early for Beta Users
rtl: يشغس ثشقمغ بخق زثفش عسثقسSdǝɔᴉɟʎ ʇɥǝ dǝɟɐnlʇ ɟøɹ ɥøʍ øɟʇǝn ʌɐɹᴉɐblǝ ʌɐlnǝs ᴉn ɐ dɹøblǝɯ ɐɹǝ ɹɐndøɯᴉzǝd. Ŧɥᴉs sǝʇʇᴉnƃ sɥønld bǝ sǝʇ ʇø "nǝʌǝɹ" nnlǝss ʎøn dlɐn ʇø dɹøʌᴉdǝ ɐ Ᵽʎʇɥøn sɔɹᴉdʇ ʇø ᴉdǝnʇᴉɟʎ ɐnd ɹɐndøɯᴉzǝ ʌɐlnǝs ᴉn ɯøsʇ øɟ ʇɥǝ dɹøblǝɯs ᴉn ʎønɹ ɔønɹsǝ. Vɐlᴉd ʌɐlnǝs ɐɹǝ "ɐlʍɐʎs", "ønɹǝsǝʇ", "nǝʌǝɹ", ɐnd "dǝɹ_sʇndǝnʇ".

source: Enter the number of days before the start date that beta users can access the course.
rtl: ثرفثق فاث رعوزثق خب يشغس زثبخقث فاث سفشقف يشفث فاشف زثفش عسثقس ذشر شذذثسس فاث ذخعقسث.

source: Static Asset Path
rtl: سفشفهذ شسسثف حشفاɆnʇǝɹ ʇɥǝ nnɯbǝɹ øɟ dɐʎs bǝɟøɹǝ ʇɥǝ sʇɐɹʇ dɐʇǝ ʇɥɐʇ bǝʇɐ nsǝɹs ɔɐn ɐɔɔǝss ʇɥǝ ɔønɹsǝ.

source: Enter the path to use for files on the Files & Uploads page. This value overrides the Studio default, c4x://.
rtl: ثرفثق فاث حشفا فخ عسث بخق بهمثس خر فاث بهمثس & عحمخشيس حشلث. فاهس دشمعث خدثققهيثس فاث سفعيهخ يثبشعمف, ذ4ط://.

source: Enable LaTeX Compiler
rtl: ثرشزمث مشفثط ذخوحهمثقɆnʇǝɹ ʇɥǝ dɐʇɥ ʇø nsǝ ɟøɹ ɟᴉlǝs øn ʇɥǝ Fᴉlǝs & Ʉdløɐds dɐƃǝ. Ŧɥᴉs ʌɐlnǝ øʌǝɹɹᴉdǝs ʇɥǝ Sʇndᴉø dǝɟɐnlʇ, ɔ4x://.

source: Enter true or false. If true, you can use the LaTeX templates for HTML components and advanced Problem components.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, غخع ذشر عسث فاث مشفثط فثوحمشفثس بخق افوم ذخوحخرثرفس شري شيدشرذثي حقخزمثو ذخوحخرثرفس.Ɇnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, ʎøn ɔɐn nsǝ ʇɥǝ ŁɐŦǝX ʇǝɯdlɐʇǝs ɟøɹ ĦŦMŁ ɔøɯdønǝnʇs ɐnd ɐdʌɐnɔǝd Ᵽɹøblǝɯ ɔøɯdønǝnʇs.

source: Enter the maximum number of times a student can try to answer problems. By default, Maximum Attempts is set to null, meaning that students have an unlimited number of attempts for problems. You can override this course-wide setting for individual problems. However, if the course-wide setting is a specific number, you cannot set the Maximum Attempts for individual problems to unlimited.
rtl: ثرفثق فاث وشطهوعو رعوزثق خب فهوثس ش سفعيثرف ذشر فقغ فخ شرسصثق حقخزمثوس. زغ يثبشعمف, وشطهوعو شففثوحفس هس سثف فخ رعمم, وثشرهرل فاشف سفعيثرفس اشدث شر عرمهوهفثي رعوزثق خب شففثوحفس بخق حقخزمثوس. غخع ذشر خدثققهيث فاهس ذخعقسث-صهيث سثففهرل بخق هريهدهيعشم حقخزمثوس. اخصثدثق, هب فاث ذخعقسث-صهيث سثففهرل هس ش سحثذهبهذ رعوزثق, غخع ذشررخف سثف فاث وشطهوعو شففثوحفس بخق هريهدهيعشم حقخزمثوس فخ عرمهوهفثي.Ɇnʇǝɹ ʇɥǝ ɯɐxᴉɯnɯ nnɯbǝɹ øɟ ʇᴉɯǝs ɐ sʇndǝnʇ ɔɐn ʇɹʎ ʇø ɐnsʍǝɹ dɹøblǝɯs. Ƀʎ dǝɟɐnlʇ, Mɐxᴉɯnɯ Ⱥʇʇǝɯdʇs ᴉs sǝʇ ʇø nnll, ɯǝɐnᴉnƃ ʇɥɐʇ sʇndǝnʇs ɥɐʌǝ ɐn nnlᴉɯᴉʇǝd nnɯbǝɹ øɟ ɐʇʇǝɯdʇs ɟøɹ dɹøblǝɯs. Ɏøn ɔɐn øʌǝɹɹᴉdǝ ʇɥᴉs ɔønɹsǝ-ʍᴉdǝ sǝʇʇᴉnƃ ɟøɹ ᴉndᴉʌᴉdnɐl dɹøblǝɯs. Ħøʍǝʌǝɹ, ᴉɟ ʇɥǝ ɔønɹsǝ-ʍᴉdǝ sǝʇʇᴉnƃ ᴉs ɐ sdǝɔᴉɟᴉɔ nnɯbǝɹ, ʎøn ɔɐnnøʇ sǝʇ ʇɥǝ Mɐxᴉɯnɯ Ⱥʇʇǝɯdʇs ɟøɹ ᴉndᴉʌᴉdnɐl dɹøblǝɯs ʇø nnlᴉɯᴉʇǝd.

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use in this course for the specified duration. Do not share the API key with other courses. Notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
rtl: ثرفثق فاث شحه نثغ حقخدهيثي زغ وشفاصخقنس بخق شذذثسسهرل فاث وشفمشز اخسفثي سثقدهذث. فاهس نثغ هس لقشرفثي بخق ثطذمعسهدث عسث هر فاهس ذخعقسث بخق فاث سحثذهبهثي يعقشفهخر. يخ رخف ساشقث فاث شحه نثغ صهفا خفاثق ذخعقسثس. رخفهبغ وشفاصخقنس هووثيهشفثمغ هب غخع زثمهثدث فاث نثغ هس ثطحخسثي خق ذخوحقخوهسثي. فخ خزفشهر ش نثغ بخق غخعق ذخعقسث, خق فخ قثحخقف شر هسسعث, حمثشسث ذخرفشذف وخخذسعححخقف@وشفاصخقنس.ذخوɆnʇǝɹ ʇɥǝ ȺⱣƗ ʞǝʎ dɹøʌᴉdǝd bʎ MɐʇɥWøɹʞs ɟøɹ ɐɔɔǝssᴉnƃ ʇɥǝ MȺŦŁȺɃ Ħøsʇǝd Sǝɹʌᴉɔǝ. Ŧɥᴉs ʞǝʎ ᴉs ƃɹɐnʇǝd ɟøɹ ǝxɔlnsᴉʌǝ nsǝ ᴉn ʇɥᴉs ɔønɹsǝ ɟøɹ ʇɥǝ sdǝɔᴉɟᴉǝd dnɹɐʇᴉøn. Đø nøʇ sɥɐɹǝ ʇɥǝ ȺⱣƗ ʞǝʎ ʍᴉʇɥ øʇɥǝɹ ɔønɹsǝs. Nøʇᴉɟʎ MɐʇɥWøɹʞs ᴉɯɯǝdᴉɐʇǝlʎ ᴉɟ ʎøn bǝlᴉǝʌǝ ʇɥǝ ʞǝʎ ᴉs ǝxdøsǝd øɹ ɔøɯdɹøɯᴉsǝd. Ŧø øbʇɐᴉn ɐ ʞǝʎ ɟøɹ ʎønɹ ɔønɹsǝ, øɹ ʇø ɹǝdøɹʇ ɐn ᴉssnǝ, dlǝɐsǝ ɔønʇɐɔʇ ɯøøɔsnddøɹʇ@ɯɐʇɥʍøɹʞs.ɔøɯ

source: Group Configurations
rtl: لقخعح ذخربهلعقشفهخرس

source: Enter the configurations that govern how students are grouped together.
rtl: ثرفثق فاث ذخربهلعقشفهخرس فاشف لخدثقر اخص سفعيثرفس شقث لقخعحثي فخلثفاثق.

source: Enable video caching system
rtl: ثرشزمث دهيثخ ذشذاهرل سغسفثوɆnʇǝɹ ʇɥǝ ɔønɟᴉƃnɹɐʇᴉøns ʇɥɐʇ ƃøʌǝɹn ɥøʍ sʇndǝnʇs ɐɹǝ ƃɹøndǝd ʇøƃǝʇɥǝɹ.

source: Enter true or false. If true, video caching will be used for HTML5 videos.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, دهيثخ ذشذاهرل صهمم زث عسثي بخق افوم5 دهيثخس.

source: Enable video auto-advance
rtl: ثرشزمث دهيثخ شعفخ-شيدشرذثɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, ʌᴉdǝø ɔɐɔɥᴉnƃ ʍᴉll bǝ nsǝd ɟøɹ ĦŦMŁ5 ʌᴉdǝøs.

source: Specify whether to show an auto-advance button in videos. If the student clicks it, when the last video in a unit finishes it will automatically move to the next unit and autoplay the first video.
rtl: سحثذهبغ صاثفاثق فخ ساخص شر شعفخ-شيدشرذث زعففخر هر دهيثخس. هب فاث سفعيثرف ذمهذنس هف, صاثر فاث مشسف دهيثخ هر ش عرهف بهرهساثس هف صهمم شعفخوشفهذشممغ وخدث فخ فاث رثطف عرهف شري شعفخحمشغ فاث بهقسف دهيثخ.

source: Video Pre-Roll
rtl: دهيثخ حقث-قخممSdǝɔᴉɟʎ ʍɥǝʇɥǝɹ ʇø sɥøʍ ɐn ɐnʇø-ɐdʌɐnɔǝ bnʇʇøn ᴉn ʌᴉdǝøs. Ɨɟ ʇɥǝ sʇndǝnʇ ɔlᴉɔʞs ᴉʇ, ʍɥǝn ʇɥǝ lɐsʇ ʌᴉdǝø ᴉn ɐ nnᴉʇ ɟᴉnᴉsɥǝs ᴉʇ ʍᴉll ɐnʇøɯɐʇᴉɔɐllʎ ɯøʌǝ ʇø ʇɥǝ nǝxʇ nnᴉʇ ɐnd ɐnʇødlɐʎ ʇɥǝ ɟᴉɹsʇ ʌᴉdǝø.

source: Identify a video, 5-10 seconds in length, to play before course videos. Enter the video ID from the Video Uploads page and one or more transcript files in the following format: {format}. For example, an entry for a video with two transcripts looks like this: {example}
rtl: هيثرفهبغ ش دهيثخ, 5-10 سثذخريس هر مثرلفا, فخ حمشغ زثبخقث ذخعقسث دهيثخس. ثرفثق فاث دهيثخ هي بقخو فاث دهيثخ عحمخشيس حشلث شري خرث خق وخقث فقشرسذقهحف بهمثس هر فاث بخممخصهرل بخقوشف: {format}. بخق ثطشوحمث, شر ثرفقغ بخق ش دهيثخ صهفا فصخ فقشرسذقهحفس مخخنس مهنث فاهس: {example}

source: Show Reset Button for Problems
rtl: ساخص قثسثف زعففخر بخق حقخزمثوسƗdǝnʇᴉɟʎ ɐ ʌᴉdǝø, 5-10 sǝɔønds ᴉn lǝnƃʇɥ, ʇø dlɐʎ bǝɟøɹǝ ɔønɹsǝ ʌᴉdǝøs. Ɇnʇǝɹ ʇɥǝ ʌᴉdǝø ƗĐ ɟɹøɯ ʇɥǝ Vᴉdǝø Ʉdløɐds dɐƃǝ ɐnd ønǝ øɹ ɯøɹǝ ʇɹɐnsɔɹᴉdʇ ɟᴉlǝs ᴉn ʇɥǝ ɟølløʍᴉnƃ ɟøɹɯɐʇ: {format}. Føɹ ǝxɐɯdlǝ, ɐn ǝnʇɹʎ ɟøɹ ɐ ʌᴉdǝø ʍᴉʇɥ ʇʍø ʇɹɐnsɔɹᴉdʇs løøʞs lᴉʞǝ ʇɥᴉs: {example}

source: Enter true or false. If true, problems in the course default to always displaying a 'Reset' button. You can override this in each problem's settings. All existing problems are affected when this course-wide setting is changed.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, حقخزمثوس هر فاث ذخعقسث يثبشعمف فخ شمصشغس يهسحمشغهرل ش 'قثسثف' زعففخر. غخع ذشر خدثققهيث فاهس هر ثشذا حقخزمثو'س سثففهرلس. شمم ثطهسفهرل حقخزمثوس شقث شببثذفثي صاثر فاهس ذخعقسث-صهيث سثففهرل هس ذاشرلثي.

source: Enable Student Notes
rtl: ثرشزمث سفعيثرف رخفثسɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, dɹøblǝɯs ᴉn ʇɥǝ ɔønɹsǝ dǝɟɐnlʇ ʇø ɐlʍɐʎs dᴉsdlɐʎᴉnƃ ɐ 'Ɍǝsǝʇ' bnʇʇøn. Ɏøn ɔɐn øʌǝɹɹᴉdǝ ʇɥᴉs ᴉn ǝɐɔɥ dɹøblǝɯ's sǝʇʇᴉnƃs. Ⱥll ǝxᴉsʇᴉnƃ dɹøblǝɯs ɐɹǝ ɐɟɟǝɔʇǝd ʍɥǝn ʇɥᴉs ɔønɹsǝ-ʍᴉdǝ sǝʇʇᴉnƃ ᴉs ɔɥɐnƃǝd.

source: Enter true or false. If true, students can use the Student Notes feature.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, سفعيثرفس ذشر عسث فاث سفعيثرف رخفثس بثشفعقث.Ɇnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, sʇndǝnʇs ɔɐn nsǝ ʇɥǝ Sʇndǝnʇ Nøʇǝs ɟǝɐʇnɹǝ.

source: Indicates whether Student Notes are visible in the course. Students can also show or hide their notes in the courseware.
rtl: هريهذشفثس صاثفاثق سفعيثرف رخفثس شقث دهسهزمث هر فاث ذخعقسث. سفعيثرفس ذشر شمسخ ساخص خق اهيث فاثهق رخفثس هر فاث ذخعقسثصشقث.

source: Tag this module as part of an Entrance Exam section
rtl: فشل فاهس وخيعمث شس حشقف خب شر ثرفقشرذث ثطشو سثذفهخرƗndᴉɔɐʇǝs ʍɥǝʇɥǝɹ Sʇndǝnʇ Nøʇǝs ɐɹǝ ʌᴉsᴉblǝ ᴉn ʇɥǝ ɔønɹsǝ. Sʇndǝnʇs ɔɐn ɐlsø sɥøʍ øɹ ɥᴉdǝ ʇɥǝᴉɹ nøʇǝs ᴉn ʇɥǝ ɔønɹsǝʍɐɹǝ.

source: Enter true or false. If true, answer submissions for problem modules will be considered in the Entrance Exam scoring/gating algorithm.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, شرسصثق سعزوهسسهخرس بخق حقخزمثو وخيعمثس صهمم زث ذخرسهيثقثي هر فاث ثرفقشرذث ثطشو سذخقهرل/لشفهرل شملخقهفاو.

source: Error while reading {}. Check file for XML errors.
rtl: ثققخق صاهمث قثشيهرل {}. ذاثذن بهمث بخق طوم ثققخقس.

source: Failed to import module: {} at location: {}
rtl: بشهمثي فخ هوحخقف وخيعمث: {} شف مخذشفهخر: {}Ɇnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, ɐnsʍǝɹ snbɯᴉssᴉøns ɟøɹ dɹøblǝɯ ɯødnlǝs ʍᴉll bǝ ɔønsᴉdǝɹǝd ᴉn ʇɥǝ Ɇnʇɹɐnɔǝ Ɇxɐɯ sɔøɹᴉnƃ/ƃɐʇᴉnƃ ɐlƃøɹᴉʇɥɯ.

source: Enrollment Track Groups
rtl: ثرقخمموثرف فقشذن لقخعحس

source: Partition for segmenting users by enrollment track
rtl: حشقفهفهخر بخق سثلوثرفهرل عسثقس زغ ثرقخمموثرف فقشذن

source: Whether this student has voted on the poll
rtl: صاثفاثق فاهس سفعيثرف اشس دخفثي خر فاث حخمم

source: Student answer
rtl: سفعيثرف شرسصثق

source: Poll answers from all students
rtl: حخمم شرسصثقس بقخو شمم سفعيثرفس

source: Poll answers from xml
rtl: حخمم شرسصثقس بقخو طوم

source: Poll question
rtl: حخمم ضعثسفهخر

source: Enter the date by which problems are due.
rtl: ثرفثق فاث يشفث زغ صاهذا حقخزمثوس شقث يعث.

source: Hide sequence content After Due Date
rtl: اهيث سثضعثرذث ذخرفثرف شبفثق يعث يشفث
