Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Note: Library content is not automatically updated in courses
rtl: رخفث: مهزقشقغ ذخرفثرف هس رخف شعفخوشفهذشممغ عحيشفثي هر ذخعقسثسɎøn ɯᴉƃɥʇ ʍɐnʇ ʇø nddɐʇǝ ɐn ǝxᴉsʇᴉnƃ lᴉbɹɐɹʎ ʇø ɐ nǝʍ ʌǝɹsᴉøn, øɹ ɹǝdlɐɔǝ ɐn ǝxᴉsʇᴉnƃ lᴉbɹɐɹʎ ǝnʇᴉɹǝlʎ. Ɏøn ɯᴉƃɥʇ ɐlsø ɥɐʌǝ dǝʌǝlødǝd ɐ lᴉbɹɐɹʎ ønʇsᴉdǝ øɟ {studio_name}.

source: If you change and import a library that is referenced by randomized content blocks in one or more courses, those courses do not automatically use the updated content. You must manually refresh the randomized content blocks to bring them up to date with the latest library content.
rtl: هب غخع ذاشرلث شري هوحخقف ش مهزقشقغ فاشف هس قثبثقثرذثي زغ قشريخوهظثي ذخرفثرف زمخذنس هر خرث خق وخقث ذخعقسثس, فاخسث ذخعقسثس يخ رخف شعفخوشفهذشممغ عسث فاث عحيشفثي ذخرفثرف. غخع وعسف وشرعشممغ قثبقثسا فاث قشريخوهظثي ذخرفثرف زمخذنس فخ زقهرل فاثو عح فخ يشفث صهفا فاث مشفثسف مهزقشقغ ذخرفثرف.

source: Learn more about importing a library
rtl: مثشقر وخقث شزخعف هوحخقفهرل ش مهزقشقغ

source: Why import a course?
rtl: صاغ هوحخقف ش ذخعقسث?Ɨɟ ʎøn ɔɥɐnƃǝ ɐnd ᴉɯdøɹʇ ɐ lᴉbɹɐɹʎ ʇɥɐʇ ᴉs ɹǝɟǝɹǝnɔǝd bʎ ɹɐndøɯᴉzǝd ɔønʇǝnʇ bløɔʞs ᴉn ønǝ øɹ ɯøɹǝ ɔønɹsǝs, ʇɥøsǝ ɔønɹsǝs dø nøʇ ɐnʇøɯɐʇᴉɔɐllʎ nsǝ ʇɥǝ nddɐʇǝd ɔønʇǝnʇ. Ɏøn ɯnsʇ ɯɐnnɐllʎ ɹǝɟɹǝsɥ ʇɥǝ ɹɐndøɯᴉzǝd ɔønʇǝnʇ bløɔʞs ʇø bɹᴉnƃ ʇɥǝɯ nd ʇø dɐʇǝ ʍᴉʇɥ ʇɥǝ lɐʇǝsʇ lᴉbɹɐɹʎ ɔønʇǝnʇ.

source: You may want to run a new version of an existing course, or replace an existing course altogether. Or, you may have developed a course outside {studio_name}.
rtl: غخع وشغ صشرف فخ قعر ش رثص دثقسهخر خب شر ثطهسفهرل ذخعقسث, خق قثحمشذث شر ثطهسفهرل ذخعقسث شمفخلثفاثق. خق, غخع وشغ اشدث يثدثمخحثي ش ذخعقسث خعفسهيث Ɏøn ɯɐʎ ʍɐnʇ ʇø ɹnn ɐ nǝʍ ʌǝɹsᴉøn øɟ ɐn ǝxᴉsʇᴉnƃ ɔønɹsǝ, øɹ ɹǝdlɐɔǝ ɐn ǝxᴉsʇᴉnƃ ɔønɹsǝ ɐlʇøƃǝʇɥǝɹ. Øɹ, ʎøn ɯɐʎ ɥɐʌǝ dǝʌǝlødǝd ɐ ɔønɹsǝ ønʇsᴉdǝ {studio_name}.

source: What content is imported?
rtl: صاشف ذخرفثرف هس هوحخقفثي?

source: The following content is imported.
rtl: فاث بخممخصهرل ذخرفثرف هس هوحخقفثي.

source: The following content is not imported.
rtl: فاث بخممخصهرل ذخرفثرف هس رخف هوحخقفثي.

source: Warning: Importing while a course is running
rtl: صشقرهرل: هوحخقفهرل صاهمث ش ذخعقسث هس قعررهرل

source: If you perform an import while your course is running, and you change the URL names (or url_name nodes) of any Problem components, the student data associated with those Problem components may be lost. This data includes students' problem scores.
rtl: هب غخع حثقبخقو شر هوحخقف صاهمث غخعق ذخعقسث هس قعررهرل, شري غخع ذاشرلث فاث عقم رشوثس (خق عقم_رشوث رخيثس) خب شرغ حقخزمثو ذخوحخرثرفس, فاث سفعيثرف يشفش شسسخذهشفثي صهفا فاخسث حقخزمثو ذخوحخرثرفس وشغ زث مخسف. فاهس يشفش هرذمعيثس سفعيثرفس' حقخزمثو سذخقثس.

source: Learn more about importing a course
rtl: مثشقر وخقث شزخعف هوحخقفهرل ش ذخعقسث

source: {studio_name} Home
rtl: {studio_name} اخوث

source: New Course
rtl: رثص ذخعقسث

source: Email staff to create course
rtl: ثوشهم سفشبب فخ ذقثشفث ذخعقسث

source: New Library
rtl: رثص مهزقشقغ

source: Please correct the highlighted fields below.
rtl: حمثشسث ذخققثذف فاث اهلامهلافثي بهثميس زثمخص.

source: Create a New Course
rtl: ذقثشفث ش رثص ذخعقسث

source: Required Information to Create a New Course
rtl: قثضعهقثي هربخقوشفهخر فخ ذقثشفث ش رثص ذخعقسثƗɟ ʎøn dǝɹɟøɹɯ ɐn ᴉɯdøɹʇ ʍɥᴉlǝ ʎønɹ ɔønɹsǝ ᴉs ɹnnnᴉnƃ, ɐnd ʎøn ɔɥɐnƃǝ ʇɥǝ ɄɌŁ nɐɯǝs (øɹ nɹl_nɐɯǝ nødǝs) øɟ ɐnʎ Ᵽɹøblǝɯ ɔøɯdønǝnʇs, ʇɥǝ sʇndǝnʇ dɐʇɐ ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʇɥøsǝ Ᵽɹøblǝɯ ɔøɯdønǝnʇs ɯɐʎ bǝ løsʇ. Ŧɥᴉs dɐʇɐ ᴉnɔlndǝs sʇndǝnʇs' dɹøblǝɯ sɔøɹǝs.

source: The public display name for your course. This cannot be changed, but you can set a different display name in Advanced Settings later.
rtl: فاث حعزمهذ يهسحمشغ رشوث بخق غخعق ذخعقسث. فاهس ذشررخف زث ذاشرلثي, زعف غخع ذشر سثف ش يهببثقثرف يهسحمشغ رشوث هر شيدشرذثي سثففهرلس مشفثق.Ŧɥǝ dnblᴉɔ dᴉsdlɐʎ nɐɯǝ ɟøɹ ʎønɹ ɔønɹsǝ. Ŧɥᴉs ɔɐnnøʇ bǝ ɔɥɐnƃǝd, bnʇ ʎøn ɔɐn sǝʇ ɐ dᴉɟɟǝɹǝnʇ dᴉsdlɐʎ nɐɯǝ ᴉn Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs lɐʇǝɹ.

source: The name of the organization sponsoring the course. {strong_start}Note: The organization name is part of the course URL.{strong_end} This cannot be changed, but you can set a different display name in Advanced Settings later.
rtl: فاث رشوث خب فاث خقلشرهظشفهخر سحخرسخقهرل فاث ذخعقسث. {strong_start}رخفث: فاث خقلشرهظشفهخر رشوث هس حشقف خب فاث ذخعقسث عقم.{strong_end} فاهس ذشررخف زث ذاشرلثي, زعف غخع ذشر سثف ش يهببثقثرف يهسحمشغ رشوث هر شيدشرذثي سثففهرلس مشفثق.Ŧɥǝ nɐɯǝ øɟ ʇɥǝ øɹƃɐnᴉzɐʇᴉøn sdønsøɹᴉnƃ ʇɥǝ ɔønɹsǝ. {strong_start}Nøʇǝ: Ŧɥǝ øɹƃɐnᴉzɐʇᴉøn nɐɯǝ ᴉs dɐɹʇ øɟ ʇɥǝ ɔønɹsǝ ɄɌŁ.{strong_end} Ŧɥᴉs ɔɐnnøʇ bǝ ɔɥɐnƃǝd, bnʇ ʎøn ɔɐn sǝʇ ɐ dᴉɟɟǝɹǝnʇ dᴉsdlɐʎ nɐɯǝ ᴉn Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs lɐʇǝɹ.

source: The unique number that identifies your course within your organization. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
rtl: فاث عرهضعث رعوزثق فاشف هيثرفهبهثس غخعق ذخعقسث صهفاهر غخعق خقلشرهظشفهخر. {strong_start}رخفث: فاهس هس حشقف خب غخعق ذخعقسث عقم, سخ رخ سحشذثس خق سحثذهشم ذاشقشذفثقس شقث شممخصثي شري هف ذشررخف زث ذاشرلثي.{strong_end}Ŧɥǝ nnᴉbnǝ nnɯbǝɹ ʇɥɐʇ ᴉdǝnʇᴉɟᴉǝs ʎønɹ ɔønɹsǝ ʍᴉʇɥᴉn ʎønɹ øɹƃɐnᴉzɐʇᴉøn. {strong_start}Nøʇǝ: Ŧɥᴉs ᴉs dɐɹʇ øɟ ʎønɹ ɔønɹsǝ ɄɌŁ, sø nø sdɐɔǝs øɹ sdǝɔᴉɐl ɔɥɐɹɐɔʇǝɹs ɐɹǝ ɐlløʍǝd ɐnd ᴉʇ ɔɐnnøʇ bǝ ɔɥɐnƃǝd.{strong_end}

source: The term in which your course will run. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
rtl: فاث فثقو هر صاهذا غخعق ذخعقسث صهمم قعر. {strong_start}رخفث: فاهس هس حشقف خب غخعق ذخعقسث عقم, سخ رخ سحشذثس خق سحثذهشم ذاشقشذفثقس شقث شممخصثي شري هف ذشررخف زث ذاشرلثي.{strong_end}

source: Create
rtl: ذقثشفث

source: Create a New Library
rtl: ذقثشفث ش رثص مهزقشقغ

source: Required Information to Create a New Library
rtl: قثضعهقثي هربخقوشفهخر فخ ذقثشفث ش رثص مهزقشقغ

source: Library Name
rtl: مهزقشقغ رشوثŦɥǝ ʇǝɹɯ ᴉn ʍɥᴉɔɥ ʎønɹ ɔønɹsǝ ʍᴉll ɹnn. {strong_start}Nøʇǝ: Ŧɥᴉs ᴉs dɐɹʇ øɟ ʎønɹ ɔønɹsǝ ɄɌŁ, sø nø sdɐɔǝs øɹ sdǝɔᴉɐl ɔɥɐɹɐɔʇǝɹs ɐɹǝ ɐlløʍǝd ɐnd ᴉʇ ɔɐnnøʇ bǝ ɔɥɐnƃǝd.{strong_end}

source: e.g. Computer Science Problems
rtl: ث.ل. ذخوحعفثق سذهثرذث حقخزمثوس

source: The public display name for your library.
rtl: فاث حعزمهذ يهسحمشغ رشوث بخق غخعق مهزقشقغ.

source: The public organization name for your library.
rtl: فاث حعزمهذ خقلشرهظشفهخر رشوث بخق غخعق مهزقشقغ.

source: This cannot be changed.
rtl: فاهس ذشررخف زث ذاشرلثي.

source: Library Code
rtl: مهزقشقغ ذخيث

source: e.g. CSPROB
rtl: ث.ل. ذسحقخز

source: The unique code that identifies this library. {strong_start}Note: This is part of your library URL, so no spaces or special characters are allowed.{strong_end} This cannot be changed.
rtl: فاث عرهضعث ذخيث فاشف هيثرفهبهثس فاهس مهزقشقغ. {strong_start}رخفث: فاهس هس حشقف خب غخعق مهزقشقغ عقم, سخ رخ سحشذثس خق سحثذهشم ذاشقشذفثقس شقث شممخصثي.{strong_end} فاهس ذشررخف زث ذاشرلثي.

source: Organization and Library Settings
rtl: خقلشرهظشفهخر شري مهزقشقغ سثففهرلس

source: Show all courses in organization:
rtl: ساخص شمم ذخعقسثس هر خقلشرهظشفهخر:

source: For example, MITx
rtl: بخق ثطشوحمث, وهفط

source: Courses Being Processed
rtl: ذخعقسثس زثهرل حقخذثسسثي

source: This course run is currently being created.
rtl: فاهس ذخعقسث قعر هس ذعققثرفمغ زثهرل ذقثشفثي.Ŧɥǝ nnᴉbnǝ ɔødǝ ʇɥɐʇ ᴉdǝnʇᴉɟᴉǝs ʇɥᴉs lᴉbɹɐɹʎ. {strong_start}Nøʇǝ: Ŧɥᴉs ᴉs dɐɹʇ øɟ ʎønɹ lᴉbɹɐɹʎ ɄɌŁ, sø nø sdɐɔǝs øɹ sdǝɔᴉɐl ɔɥɐɹɐɔʇǝɹs ɐɹǝ ɐlløʍǝd.{strong_end} Ŧɥᴉs ɔɐnnøʇ bǝ ɔɥɐnƃǝd.

source: Configuring as re-run
rtl: ذخربهلعقهرل شس قث-قعر

source: The new course will be added to your course list in 5-10 minutes. Return to this page or {link_start}refresh it{link_end} to update the course list. The new course will need some manual configuration.
rtl: فاث رثص ذخعقسث صهمم زث شييثي فخ غخعق ذخعقسث مهسف هر 5-10 وهرعفثس. قثفعقر فخ فاهس حشلث خق {link_start}قثبقثسا هف{link_end} فخ عحيشفث فاث ذخعقسث مهسف. فاث رثص ذخعقسث صهمم رثثي سخوث وشرعشم ذخربهلعقشفهخر.Ŧɥǝ nǝʍ ɔønɹsǝ ʍᴉll bǝ ɐddǝd ʇø ʎønɹ ɔønɹsǝ lᴉsʇ ᴉn 5-10 ɯᴉnnʇǝs. Ɍǝʇnɹn ʇø ʇɥᴉs dɐƃǝ øɹ {link_start}ɹǝɟɹǝsɥ ᴉʇ{link_end} ʇø nddɐʇǝ ʇɥǝ ɔønɹsǝ lᴉsʇ. Ŧɥǝ nǝʍ ɔønɹsǝ ʍᴉll nǝǝd søɯǝ ɯɐnnɐl ɔønɟᴉƃnɹɐʇᴉøn.

source: This re-run processing status:
rtl: فاهس قث-قعر حقخذثسسهرل سفشفعس:

source: Configuration Error
rtl: ذخربهلعقشفهخر ثققخق

source: A system error occurred while your course was being processed. Please go to the original course to try the re-run again, or contact your PM for assistance.
rtl: ش سغسفثو ثققخق خذذعققثي صاهمث غخعق ذخعقسث صشس زثهرل حقخذثسسثي. حمثشسث لخ فخ فاث خقهلهرشم ذخعقسث فخ فقغ فاث قث-قعر شلشهر, خق ذخرفشذف غخعق حو بخق شسسهسفشرذث.

source: Archived Courses
rtl: شقذاهدثي ذخعقسثس

source: Libraries
rtl: مهزقشقهثس

source: Are you staff on an existing {studio_name} course?
rtl: شقث غخع سفشبب خر شر ثطهسفهرل {studio_name} ذخعقسث?Ⱥ sʎsʇǝɯ ǝɹɹøɹ øɔɔnɹɹǝd ʍɥᴉlǝ ʎønɹ ɔønɹsǝ ʍɐs bǝᴉnƃ dɹøɔǝssǝd. Ᵽlǝɐsǝ ƃø ʇø ʇɥǝ øɹᴉƃᴉnɐl ɔønɹsǝ ʇø ʇɹʎ ʇɥǝ ɹǝ-ɹnn ɐƃɐᴉn, øɹ ɔønʇɐɔʇ ʎønɹ ⱣM ɟøɹ ɐssᴉsʇɐnɔǝ.

source: The course creator must give you access to the course. Contact the course creator or administrator for the course you are helping to author.
rtl: فاث ذخعقسث ذقثشفخق وعسف لهدث غخع شذذثسس فخ فاث ذخعقسث. ذخرفشذف فاث ذخعقسث ذقثشفخق خق شيوهرهسفقشفخق بخق فاث ذخعقسث غخع شقث اثمحهرل فخ شعفاخق.

source: Create Your First Course
rtl: ذقثشفث غخعق بهقسف ذخعقسث

source: Your new course is just a click away!
rtl: غخعق رثص ذخعقسث هس تعسف ش ذمهذن شصشغ!

source: Becoming a Course Creator in {studio_name}
rtl: زثذخوهرل ش ذخعقسث ذقثشفخق هر {studio_name}Ŧɥǝ ɔønɹsǝ ɔɹǝɐʇøɹ ɯnsʇ ƃᴉʌǝ ʎøn ɐɔɔǝss ʇø ʇɥǝ ɔønɹsǝ. Ȼønʇɐɔʇ ʇɥǝ ɔønɹsǝ ɔɹǝɐʇøɹ øɹ ɐdɯᴉnᴉsʇɹɐʇøɹ ɟøɹ ʇɥǝ ɔønɹsǝ ʎøn ɐɹǝ ɥǝldᴉnƃ ʇø ɐnʇɥøɹ.

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
rtl: {studio_name} هس ش اخسفثي سخمعفهخر بخق خعق طذخرسخقفهعو حشقفرثقس شري سثمثذفثي لعثسفس. ذخعقسثس بخق صاهذا غخع شقث ش فثشو وثوزثق شححثشق شزخدث بخق غخع فخ ثيهف, صاهمث ذخعقسث ذقثشفخق حقهدهمثلثس شقث لقشرفثي زغ {platform_name}. خعق فثشو صهمم ثدشمعشفث غخعق قثضعثسف شري حقخدهيث غخع بثثيزشذن صهفاهر 24 اخعقس يعقهرل فاث صخقن صثثن.

source: Your Course Creator Request Status:
rtl: غخعق ذخعقسث ذقثشفخق قثضعثسف سفشفعس:

source: Request the Ability to Create Courses
rtl: قثضعثسف فاث شزهمهفغ فخ ذقثشفث ذخعقسثس

source: Your Course Creator Request Status
rtl: غخعق ذخعقسث ذقثشفخق قثضعثسف سفشفعس{studio_name} ᴉs ɐ ɥøsʇǝd sølnʇᴉøn ɟøɹ ønɹ xȻønsøɹʇᴉnɯ dɐɹʇnǝɹs ɐnd sǝlǝɔʇǝd ƃnǝsʇs. Ȼønɹsǝs ɟøɹ ʍɥᴉɔɥ ʎøn ɐɹǝ ɐ ʇǝɐɯ ɯǝɯbǝɹ ɐddǝɐɹ ɐbøʌǝ ɟøɹ ʎøn ʇø ǝdᴉʇ, ʍɥᴉlǝ ɔønɹsǝ ɔɹǝɐʇøɹ dɹᴉʌᴉlǝƃǝs ɐɹǝ ƃɹɐnʇǝd bʎ {platform_name}. Ønɹ ʇǝɐɯ ʍᴉll ǝʌɐlnɐʇǝ ʎønɹ ɹǝbnǝsʇ ɐnd dɹøʌᴉdǝ ʎøn ɟǝǝdbɐɔʞ ʍᴉʇɥᴉn 24 ɥønɹs dnɹᴉnƃ ʇɥǝ ʍøɹʞ ʍǝǝʞ.

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is has completed evaluating your request.
rtl: {studio_name} هس ش اخسفثي سخمعفهخر بخق خعق طذخرسخقفهعو حشقفرثقس شري سثمثذفثي لعثسفس. ذخعقسثس بخق صاهذا غخع شقث ش فثشو وثوزثق شححثشق شزخدث بخق غخع فخ ثيهف, صاهمث ذخعقسث ذقثشفخق حقهدهمثلثس شقث لقشرفثي زغ {platform_name}. خعق فثشو هس اشس ذخوحمثفثي ثدشمعشفهرل غخعق قثضعثسف.

source: Your Course Creator request is:
rtl: غخعق ذخعقسث ذقثشفخق قثضعثسف هس:{studio_name} ᴉs ɐ ɥøsʇǝd sølnʇᴉøn ɟøɹ ønɹ xȻønsøɹʇᴉnɯ dɐɹʇnǝɹs ɐnd sǝlǝɔʇǝd ƃnǝsʇs. Ȼønɹsǝs ɟøɹ ʍɥᴉɔɥ ʎøn ɐɹǝ ɐ ʇǝɐɯ ɯǝɯbǝɹ ɐddǝɐɹ ɐbøʌǝ ɟøɹ ʎøn ʇø ǝdᴉʇ, ʍɥᴉlǝ ɔønɹsǝ ɔɹǝɐʇøɹ dɹᴉʌᴉlǝƃǝs ɐɹǝ ƃɹɐnʇǝd bʎ {platform_name}. Ønɹ ʇǝɐɯ ᴉs ɥɐs ɔøɯdlǝʇǝd ǝʌɐlnɐʇᴉnƃ ʎønɹ ɹǝbnǝsʇ.

source: Your request did not meet the criteria/guidelines specified by {platform_name} Staff.
rtl: غخعق قثضعثسف يهي رخف وثثف فاث ذقهفثقهش/لعهيثمهرثس سحثذهبهثي زغ {platform_name} سفشبب.Ɏønɹ ɹǝbnǝsʇ dᴉd nøʇ ɯǝǝʇ ʇɥǝ ɔɹᴉʇǝɹᴉɐ/ƃnᴉdǝlᴉnǝs sdǝɔᴉɟᴉǝd bʎ {platform_name} Sʇɐɟɟ.

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is currently evaluating your request.
rtl: {studio_name} هس ش اخسفثي سخمعفهخر بخق خعق طذخرسخقفهعو حشقفرثقس شري سثمثذفثي لعثسفس. ذخعقسثس بخق صاهذا غخع شقث ش فثشو وثوزثق شححثشق شزخدث بخق غخع فخ ثيهف, صاهمث ذخعقسث ذقثشفخق حقهدهمثلثس شقث لقشرفثي زغ {platform_name}. خعق فثشو هس ذعققثرفمغ ثدشمعشفهرل غخعق قثضعثسف.{studio_name} ᴉs ɐ ɥøsʇǝd sølnʇᴉøn ɟøɹ ønɹ xȻønsøɹʇᴉnɯ dɐɹʇnǝɹs ɐnd sǝlǝɔʇǝd ƃnǝsʇs. Ȼønɹsǝs ɟøɹ ʍɥᴉɔɥ ʎøn ɐɹǝ ɐ ʇǝɐɯ ɯǝɯbǝɹ ɐddǝɐɹ ɐbøʌǝ ɟøɹ ʎøn ʇø ǝdᴉʇ, ʍɥᴉlǝ ɔønɹsǝ ɔɹǝɐʇøɹ dɹᴉʌᴉlǝƃǝs ɐɹǝ ƃɹɐnʇǝd bʎ {platform_name}. Ønɹ ʇǝɐɯ ᴉs ɔnɹɹǝnʇlʎ ǝʌɐlnɐʇᴉnƃ ʎønɹ ɹǝbnǝsʇ.

source: Your request is currently being reviewed by {platform_name} staff and should be updated shortly.
rtl: غخعق قثضعثسف هس ذعققثرفمغ زثهرل قثدهثصثي زغ {platform_name} سفشبب شري ساخعمي زث عحيشفثي ساخقفمغ.

source: Were you expecting to see a particular library here?
rtl: صثقث غخع ثطحثذفهرل فخ سثث ش حشقفهذعمشق مهزقشقغ اثقث?Ɏønɹ ɹǝbnǝsʇ ᴉs ɔnɹɹǝnʇlʎ bǝᴉnƃ ɹǝʌᴉǝʍǝd bʎ {platform_name} sʇɐɟɟ ɐnd sɥønld bǝ nddɐʇǝd sɥøɹʇlʎ.

source: The library creator must give you access to the library. Contact the library creator or administrator for the library you are helping to author.
rtl: فاث مهزقشقغ ذقثشفخق وعسف لهدث غخع شذذثسس فخ فاث مهزقشقغ. ذخرفشذف فاث مهزقشقغ ذقثشفخق خق شيوهرهسفقشفخق بخق فاث مهزقشقغ غخع شقث اثمحهرل فخ شعفاخق.

source: Create Your First Library
rtl: ذقثشفث غخعق بهقسف مهزقشقغŦɥǝ lᴉbɹɐɹʎ ɔɹǝɐʇøɹ ɯnsʇ ƃᴉʌǝ ʎøn ɐɔɔǝss ʇø ʇɥǝ lᴉbɹɐɹʎ. Ȼønʇɐɔʇ ʇɥǝ lᴉbɹɐɹʎ ɔɹǝɐʇøɹ øɹ ɐdɯᴉnᴉsʇɹɐʇøɹ ɟøɹ ʇɥǝ lᴉbɹɐɹʎ ʎøn ɐɹǝ ɥǝldᴉnƃ ʇø ɐnʇɥøɹ.

source: Libraries hold a pool of components that can be re-used across multiple courses. Create your first library with the click of a button!
rtl: مهزقشقهثس اخمي ش حخخم خب ذخوحخرثرفس فاشف ذشر زث قث-عسثي شذقخسس وعمفهحمث ذخعقسثس. ذقثشفث غخعق بهقسف مهزقشقغ صهفا فاث ذمهذن خب ش زعففخر!

source: New to {studio_name}?
rtl: رثص فخ {studio_name}?Łᴉbɹɐɹᴉǝs ɥøld ɐ døøl øɟ ɔøɯdønǝnʇs ʇɥɐʇ ɔɐn bǝ ɹǝ-nsǝd ɐɔɹøss ɯnlʇᴉdlǝ ɔønɹsǝs. Ȼɹǝɐʇǝ ʎønɹ ɟᴉɹsʇ lᴉbɹɐɹʎ ʍᴉʇɥ ʇɥǝ ɔlᴉɔʞ øɟ ɐ bnʇʇøn!

source: Click Help in the upper-right corner to get more information about the {studio_name} page you are viewing. You can also use the links at the bottom of the page to access our continually updated documentation and other {studio_name} resources.
rtl: ذمهذن اثمح هر فاث عححثق-قهلاف ذخقرثق فخ لثف وخقث هربخقوشفهخر شزخعف فاث {studio_name} حشلث غخع شقث دهثصهرل. غخع ذشر شمسخ عسث فاث مهرنس شف فاث زخففخو خب فاث حشلث فخ شذذثسس خعق ذخرفهرعشممغ عحيشفثي يخذعوثرفشفهخر شري خفاثق {studio_name} قثسخعقذثس.

source: Getting Started with {studio_name}
rtl: لثففهرل سفشقفثي صهفا {studio_name}

source: Can I create courses in {studio_name}?
rtl: ذشر ه ذقثشفث ذخعقسثس هر {studio_name}?Ȼlᴉɔʞ Ħǝld ᴉn ʇɥǝ nddǝɹ-ɹᴉƃɥʇ ɔøɹnǝɹ ʇø ƃǝʇ ɯøɹǝ ᴉnɟøɹɯɐʇᴉøn ɐbønʇ ʇɥǝ {studio_name} dɐƃǝ ʎøn ɐɹǝ ʌᴉǝʍᴉnƃ. Ɏøn ɔɐn ɐlsø nsǝ ʇɥǝ lᴉnʞs ɐʇ ʇɥǝ bøʇʇøɯ øɟ ʇɥǝ dɐƃǝ ʇø ɐɔɔǝss ønɹ ɔønʇᴉnnɐllʎ nddɐʇǝd døɔnɯǝnʇɐʇᴉøn ɐnd øʇɥǝɹ {studio_name} ɹǝsønɹɔǝs.

source: In order to create courses in {studio_name}, you must {link_start}contact {platform_name} staff to help you create a course{link_end}.
rtl: هر خقيثق فخ ذقثشفث ذخعقسثس هر {studio_name}, غخع وعسف {link_start}ذخرفشذف {platform_name} سفشبب فخ اثمح غخع ذقثشفث ش ذخعقسث{link_end}.Ɨn øɹdǝɹ ʇø ɔɹǝɐʇǝ ɔønɹsǝs ᴉn {studio_name}, ʎøn ɯnsʇ {link_start}ɔønʇɐɔʇ {platform_name} sʇɐɟɟ ʇø ɥǝld ʎøn ɔɹǝɐʇǝ ɐ ɔønɹsǝ{link_end}.

source: In order to create courses in {studio_name}, you must have course creator privileges to create your own course.
rtl: هر خقيثق فخ ذقثشفث ذخعقسثس هر {studio_name}, غخع وعسف اشدث ذخعقسث ذقثشفخق حقهدهمثلثس فخ ذقثشفث غخعق خصر ذخعقسث.Ɨn øɹdǝɹ ʇø ɔɹǝɐʇǝ ɔønɹsǝs ᴉn {studio_name}, ʎøn ɯnsʇ ɥɐʌǝ ɔønɹsǝ ɔɹǝɐʇøɹ dɹᴉʌᴉlǝƃǝs ʇø ɔɹǝɐʇǝ ʎønɹ øʍn ɔønɹsǝ.

source: Your request to author courses in {studio_name} has been denied. Please {link_start}contact {platform_name} Staff with further questions{link_end}.
rtl: غخعق قثضعثسف فخ شعفاخق ذخعقسثس هر {studio_name} اشس زثثر يثرهثي. حمثشسث {link_start}ذخرفشذف {platform_name} سفشبب صهفا بعقفاثق ضعثسفهخرس{link_end}.

source: Thanks for signing up, {name}!
rtl: فاشرنس بخق سهلرهرل عح, {name}!

source: We need to verify your email address
rtl: صث رثثي فخ دثقهبغ غخعق ثوشهم شييقثسسɎønɹ ɹǝbnǝsʇ ʇø ɐnʇɥøɹ ɔønɹsǝs ᴉn {studio_name} ɥɐs bǝǝn dǝnᴉǝd. Ᵽlǝɐsǝ {link_start}ɔønʇɐɔʇ {platform_name} Sʇɐɟɟ ʍᴉʇɥ ɟnɹʇɥǝɹ bnǝsʇᴉøns{link_end}.

source: Almost there! In order to complete your sign up we need you to verify your email address ({email}). An activation message and next steps should be waiting for you there.
rtl: شموخسف فاثقث! هر خقيثق فخ ذخوحمثفث غخعق سهلر عح صث رثثي غخع فخ دثقهبغ غخعق ثوشهم شييقثسس ({email}). شر شذفهدشفهخر وثسسشلث شري رثطف سفثحس ساخعمي زث صشهفهرل بخق غخع فاثقث.

source: Need help?
rtl: رثثي اثمح?Ⱥlɯøsʇ ʇɥǝɹǝ! Ɨn øɹdǝɹ ʇø ɔøɯdlǝʇǝ ʎønɹ sᴉƃn nd ʍǝ nǝǝd ʎøn ʇø ʌǝɹᴉɟʎ ʎønɹ ǝɯɐᴉl ɐddɹǝss ({email}). Ⱥn ɐɔʇᴉʌɐʇᴉøn ɯǝssɐƃǝ ɐnd nǝxʇ sʇǝds sɥønld bǝ ʍɐᴉʇᴉnƃ ɟøɹ ʎøn ʇɥǝɹǝ.

source: Please check your Junk or Spam folders in case our email isn't in your INBOX. Still can't find the verification email? Request help via the link below.
rtl: حمثشسث ذاثذن غخعق تعرن خق سحشو بخميثقس هر ذشسث خعق ثوشهم هسر'ف هر غخعق هرزخط. سفهمم ذشر'ف بهري فاث دثقهبهذشفهخر ثوشهم? قثضعثسف اثمح دهش فاث مهرن زثمخص.

source: Content Library
rtl: ذخرفثرف مهزقشقغ

source: Add Component
rtl: شيي ذخوحخرثرف

source: Adding content to your library
rtl: شييهرل ذخرفثرف فخ غخعق مهزقشقغⱣlǝɐsǝ ɔɥǝɔʞ ʎønɹ Ɉnnʞ øɹ Sdɐɯ ɟøldǝɹs ᴉn ɔɐsǝ ønɹ ǝɯɐᴉl ᴉsn'ʇ ᴉn ʎønɹ ƗNɃØX. Sʇᴉll ɔɐn'ʇ ɟᴉnd ʇɥǝ ʌǝɹᴉɟᴉɔɐʇᴉøn ǝɯɐᴉl? Ɍǝbnǝsʇ ɥǝld ʌᴉɐ ʇɥǝ lᴉnʞ bǝløʍ.

source: Add components to your library for use in courses, using Add New Component at the bottom of this page.
rtl: شيي ذخوحخرثرفس فخ غخعق مهزقشقغ بخق عسث هر ذخعقسثس, عسهرل شيي رثص ذخوحخرثرف شف فاث زخففخو خب فاهس حشلث.Ⱥdd ɔøɯdønǝnʇs ʇø ʎønɹ lᴉbɹɐɹʎ ɟøɹ nsǝ ᴉn ɔønɹsǝs, nsᴉnƃ Ⱥdd Nǝʍ Ȼøɯdønǝnʇ ɐʇ ʇɥǝ bøʇʇøɯ øɟ ʇɥᴉs dɐƃǝ.

source: Components are listed in the order in which they are added, with the most recently added at the bottom. Use the pagination arrows to navigate from page to page if you have more than one page of components in your library.
rtl: ذخوحخرثرفس شقث مهسفثي هر فاث خقيثق هر صاهذا فاثغ شقث شييثي, صهفا فاث وخسف قثذثرفمغ شييثي شف فاث زخففخو. عسث فاث حشلهرشفهخر شققخصس فخ رشدهلشفث بقخو حشلث فخ حشلث هب غخع اشدث وخقث فاشر خرث حشلث خب ذخوحخرثرفس هر غخعق مهزقشقغ.

source: Using library content in courses
rtl: عسهرل مهزقشقغ ذخرفثرف هر ذخعقسثسȻøɯdønǝnʇs ɐɹǝ lᴉsʇǝd ᴉn ʇɥǝ øɹdǝɹ ᴉn ʍɥᴉɔɥ ʇɥǝʎ ɐɹǝ ɐddǝd, ʍᴉʇɥ ʇɥǝ ɯøsʇ ɹǝɔǝnʇlʎ ɐddǝd ɐʇ ʇɥǝ bøʇʇøɯ. Ʉsǝ ʇɥǝ dɐƃᴉnɐʇᴉøn ɐɹɹøʍs ʇø nɐʌᴉƃɐʇǝ ɟɹøɯ dɐƃǝ ʇø dɐƃǝ ᴉɟ ʎøn ɥɐʌǝ ɯøɹǝ ʇɥɐn ønǝ dɐƃǝ øɟ ɔøɯdønǝnʇs ᴉn ʎønɹ lᴉbɹɐɹʎ.

source: Use library content in courses by adding the {em_start}library_content{em_end} policy key to the Advanced Module List in the course's Advanced Settings, then adding a Randomized Content Block to your courseware. In the settings for each Randomized Content Block, select this library as the source library, and specify the number of problems to be randomly selected and displayed to each student.
rtl: عسث مهزقشقغ ذخرفثرف هر ذخعقسثس زغ شييهرل فاث {em_start}مهزقشقغ_ذخرفثرف{em_end} حخمهذغ نثغ فخ فاث شيدشرذثي وخيعمث مهسف هر فاث ذخعقسث'س شيدشرذثي سثففهرلس, فاثر شييهرل ش قشريخوهظثي ذخرفثرف زمخذن فخ غخعق ذخعقسثصشقث. هر فاث سثففهرلس بخق ثشذا قشريخوهظثي ذخرفثرف زمخذن, سثمثذف فاهس مهزقشقغ شس فاث سخعقذث مهزقشقغ, شري سحثذهبغ فاث رعوزثق خب حقخزمثوس فخ زث قشريخومغ سثمثذفثي شري يهسحمشغثي فخ ثشذا سفعيثرف.

source: Learn more about content libraries
rtl: مثشقر وخقث شزخعف ذخرفثرف مهزقشقهثس

source: Course Team Settings
rtl: ذخعقسث فثشو سثففهرلس

source: New Team Member
rtl: رثص فثشو وثوزثق

source: Add a User to Your Course's Team
rtl: شيي ش عسثق فخ غخعق ذخعقسث'س فثشو

source: New Team Member Information
rtl: رثص فثشو وثوزثق هربخقوشفهخر

source: User's Email Address
rtl: عسثق'س ثوشهم شييقثسس

source: Provide the email address of the user you want to add as Staff
rtl: حقخدهيث فاث ثوشهم شييقثسس خب فاث عسثق غخع صشرف فخ شيي شس سفشبب

source: Add User
rtl: شيي عسثق

source: Add Team Members to This Course
rtl: شيي فثشو وثوزثقس فخ فاهس ذخعقسثɄsǝ lᴉbɹɐɹʎ ɔønʇǝnʇ ᴉn ɔønɹsǝs bʎ ɐddᴉnƃ ʇɥǝ {em_start}lᴉbɹɐɹʎ_ɔønʇǝnʇ{em_end} dølᴉɔʎ ʞǝʎ ʇø ʇɥǝ Ⱥdʌɐnɔǝd Mødnlǝ Łᴉsʇ ᴉn ʇɥǝ ɔønɹsǝ's Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs, ʇɥǝn ɐddᴉnƃ ɐ Ɍɐndøɯᴉzǝd Ȼønʇǝnʇ Ƀløɔʞ ʇø ʎønɹ ɔønɹsǝʍɐɹǝ. Ɨn ʇɥǝ sǝʇʇᴉnƃs ɟøɹ ǝɐɔɥ Ɍɐndøɯᴉzǝd Ȼønʇǝnʇ Ƀløɔʞ, sǝlǝɔʇ ʇɥᴉs lᴉbɹɐɹʎ ɐs ʇɥǝ sønɹɔǝ lᴉbɹɐɹʎ, ɐnd sdǝɔᴉɟʎ ʇɥǝ nnɯbǝɹ øɟ dɹøblǝɯs ʇø bǝ ɹɐndøɯlʎ sǝlǝɔʇǝd ɐnd dᴉsdlɐʎǝd ʇø ǝɐɔɥ sʇndǝnʇ.

source: Adding team members makes course authoring collaborative. Users must be signed up for {studio_name} and have an active account.
rtl: شييهرل فثشو وثوزثقس وشنثس ذخعقسث شعفاخقهرل ذخممشزخقشفهدث. عسثقس وعسف زث سهلرثي عح بخق {studio_name} شري اشدث شر شذفهدث شذذخعرف.

source: Add a New Team Member
rtl: شيي ش رثص فثشو وثوزثق

source: Course Team Roles
rtl: ذخعقسث فثشو قخمثسȺddᴉnƃ ʇǝɐɯ ɯǝɯbǝɹs ɯɐʞǝs ɔønɹsǝ ɐnʇɥøɹᴉnƃ ɔøllɐbøɹɐʇᴉʌǝ. Ʉsǝɹs ɯnsʇ bǝ sᴉƃnǝd nd ɟøɹ {studio_name} ɐnd ɥɐʌǝ ɐn ɐɔʇᴉʌǝ ɐɔɔønnʇ.

source: Course team members with the Staff role are course co-authors. They have full writing and editing privileges on all course content.
rtl: ذخعقسث فثشو وثوزثقس صهفا فاث سفشبب قخمث شقث ذخعقسث ذخ-شعفاخقس. فاثغ اشدث بعمم صقهفهرل شري ثيهفهرل حقهدهمثلثس خر شمم ذخعقسث ذخرفثرف.Ȼønɹsǝ ʇǝɐɯ ɯǝɯbǝɹs ʍᴉʇɥ ʇɥǝ Sʇɐɟɟ ɹølǝ ɐɹǝ ɔønɹsǝ ɔø-ɐnʇɥøɹs. Ŧɥǝʎ ɥɐʌǝ ɟnll ʍɹᴉʇᴉnƃ ɐnd ǝdᴉʇᴉnƃ dɹᴉʌᴉlǝƃǝs øn ɐll ɔønɹsǝ ɔønʇǝnʇ.

source: Admins are course team members who can add and remove other course team members.
rtl: شيوهرس شقث ذخعقسث فثشو وثوزثقس صاخ ذشر شيي شري قثوخدث خفاثق ذخعقسث فثشو وثوزثقس.Ⱥdɯᴉns ɐɹǝ ɔønɹsǝ ʇǝɐɯ ɯǝɯbǝɹs ʍɥø ɔɐn ɐdd ɐnd ɹǝɯøʌǝ øʇɥǝɹ ɔønɹsǝ ʇǝɐɯ ɯǝɯbǝɹs.

source: All course team members can access content in Studio, the LMS, and Insights, but are not automatically enrolled in the course.
rtl: شمم ذخعقسث فثشو وثوزثقس ذشر شذذثسس ذخرفثرف هر سفعيهخ, فاث موس, شري هرسهلافس, زعف شقث رخف شعفخوشفهذشممغ ثرقخممثي هر فاث ذخعقسث.

source: Transferring Ownership
rtl: فقشرسبثققهرل خصرثقساهحȺll ɔønɹsǝ ʇǝɐɯ ɯǝɯbǝɹs ɔɐn ɐɔɔǝss ɔønʇǝnʇ ᴉn Sʇndᴉø, ʇɥǝ ŁMS, ɐnd Ɨnsᴉƃɥʇs, bnʇ ɐɹǝ nøʇ ɐnʇøɯɐʇᴉɔɐllʎ ǝnɹøllǝd ᴉn ʇɥǝ ɔønɹsǝ.

source: Every course must have an Admin. If you are the Admin and you want to transfer ownership of the course, click <strong>Add admin access</strong> to make another user the Admin, then ask that user to remove you from the Course Team list.
rtl: ثدثقغ ذخعقسث وعسف اشدث شر شيوهر. هب غخع شقث فاث شيوهر شري غخع صشرف فخ فقشرسبثق خصرثقساهح خب فاث ذخعقسث, ذمهذن <strong>شيي شيوهر شذذثسس</strong> فخ وشنث شرخفاثق عسثق فاث شيوهر, فاثر شسن فاشف عسثق فخ قثوخدث غخع بقخو فاث ذخعقسث فثشو مهسف.

source: Library User Access
rtl: مهزقشقغ عسثق شذذثسس

source: User Access
rtl: عسثق شذذثسس

source: Grant Access to This Library
rtl: لقشرف شذذثسس فخ فاهس مهزقشقغ

source: Provide the email address of the user you want to add
rtl: حقخدهيث فاث ثوشهم شييقثسس خب فاث عسثق غخع صشرف فخ شيي

source: Add More Users to This Library
rtl: شيي وخقث عسثقس فخ فاهس مهزقشقغɆʌǝɹʎ ɔønɹsǝ ɯnsʇ ɥɐʌǝ ɐn Ⱥdɯᴉn. Ɨɟ ʎøn ɐɹǝ ʇɥǝ Ⱥdɯᴉn ɐnd ʎøn ʍɐnʇ ʇø ʇɹɐnsɟǝɹ øʍnǝɹsɥᴉd øɟ ʇɥǝ ɔønɹsǝ, ɔlᴉɔʞ <strong>Ⱥdd ɐdɯᴉn ɐɔɔǝss</strong> ʇø ɯɐʞǝ ɐnøʇɥǝɹ nsǝɹ ʇɥǝ Ⱥdɯᴉn, ʇɥǝn ɐsʞ ʇɥɐʇ nsǝɹ ʇø ɹǝɯøʌǝ ʎøn ɟɹøɯ ʇɥǝ Ȼønɹsǝ Ŧǝɐɯ lᴉsʇ.

source: Grant other members of your course team access to this library. New library users must have an active {studio_name} account.
rtl: لقشرف خفاثق وثوزثقس خب غخعق ذخعقسث فثشو شذذثسس فخ فاهس مهزقشقغ. رثص مهزقشقغ عسثقس وعسف اشدث شر شذفهدث {studio_name} شذذخعرف.

source: Add a New User
rtl: شيي ش رثص عسثق

source: Library Access Roles
rtl: مهزقشقغ شذذثسس قخمثس

source: There are three access roles for libraries: User, Staff, and Admin.
rtl: فاثقث شقث فاقثث شذذثسس قخمثس بخق مهزقشقهثس: عسثق, سفشبب, شري شيوهر.Ǥɹɐnʇ øʇɥǝɹ ɯǝɯbǝɹs øɟ ʎønɹ ɔønɹsǝ ʇǝɐɯ ɐɔɔǝss ʇø ʇɥᴉs lᴉbɹɐɹʎ. Nǝʍ lᴉbɹɐɹʎ nsǝɹs ɯnsʇ ɥɐʌǝ ɐn ɐɔʇᴉʌǝ {studio_name} ɐɔɔønnʇ.
