Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: THE APIS AND ANY INFORMATION, API CONTENT OR SERVICES MADE AVAILABLE ON OR THROUGH THE APIS ARE PROVIDED "AS IS" AND "AS AVAILABLE" WITHOUT WARRANTY OF ANY KIND (EXPRESS, IMPLIED OR OTHERWISE), INCLUDING, WITHOUT LIMITATION, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT, EXCEPT INSOFAR AS ANY SUCH IMPLIED WARRANTIES MAY NOT BE DISCLAIMED UNDER APPLICABLE LAW.
rtl: فاث شحهس شري شرغ هربخقوشفهخر, شحه ذخرفثرف خق سثقدهذثس وشيث شدشهمشزمث خر خق فاقخعلا فاث شحهس شقث حقخدهيثي "شس هس" شري "شس شدشهمشزمث" صهفاخعف صشققشرفغ خب شرغ نهري (ثطحقثسس, هوحمهثي خق خفاثقصهسث), هرذمعيهرل, صهفاخعف مهوهفشفهخر, شرغ هوحمهثي صشققشرفهثس خب وثقذاشرفشزهمهفغ, بهفرثسس بخق ش حشقفهذعمشق حعقحخسث شري رخر-هربقهرلثوثرف, ثطذثحف هرسخبشق شس شرغ سعذا هوحمهثي صشققشرفهثس وشغ رخف زث يهسذمشهوثي عريثق شححمهذشزمث مشص.ŦĦɆ ȺⱣƗS ȺNĐ ȺNɎ ƗNFØɌMȺŦƗØN, ȺⱣƗ ȻØNŦɆNŦ ØɌ SɆɌVƗȻɆS MȺĐɆ ȺVȺƗŁȺɃŁɆ ØN ØɌ ŦĦɌØɄǤĦ ŦĦɆ ȺⱣƗS ȺɌɆ ⱣɌØVƗĐɆĐ "ȺS ƗS" ȺNĐ "ȺS ȺVȺƗŁȺɃŁɆ" WƗŦĦØɄŦ WȺɌɌȺNŦɎ ØF ȺNɎ ꝀƗNĐ (ɆXⱣɌɆSS, ƗMⱣŁƗɆĐ ØɌ ØŦĦɆɌWƗSɆ), ƗNȻŁɄĐƗNǤ, WƗŦĦØɄŦ ŁƗMƗŦȺŦƗØN, ȺNɎ ƗMⱣŁƗɆĐ WȺɌɌȺNŦƗɆS ØF MɆɌȻĦȺNŦȺɃƗŁƗŦɎ, FƗŦNɆSS FØɌ Ⱥ ⱣȺɌŦƗȻɄŁȺɌ ⱣɄɌⱣØSɆ ȺNĐ NØN-ƗNFɌƗNǤɆMɆNŦ, ɆXȻɆⱣŦ ƗNSØFȺɌ ȺS ȺNɎ SɄȻĦ ƗMⱣŁƗɆĐ WȺɌɌȺNŦƗɆS MȺɎ NØŦ ɃɆ ĐƗSȻŁȺƗMɆĐ ɄNĐɆɌ ȺⱣⱣŁƗȻȺɃŁɆ ŁȺW.

source: {platform_name} AND THE {platform_name} PARTICIPANTS DO NOT WARRANT THAT THE APIS WILL OPERATE IN AN UNINTERRUPTED OR ERROR-FREE MANNER, THAT THE APIS ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS, OR THAT THE APIS OR API CONTENT PROVIDED WILL MEET YOUR NEEDS OR EXPECTATIONS. {platform_name} AND THE {platform_name} PARTICIPANTS ALSO MAKE NO WARRANTY ABOUT THE ACCURACY, COMPLETENESS, TIMELINESS, OR QUALITY OF THE APIS OR ANY API CONTENT, OR THAT ANY PARTICULAR API CONTENT WILL CONTINUE TO BE MADE AVAILABLE.
rtl: {platform_name} شري فاث {platform_name} حشقفهذهحشرفس يخ رخف صشققشرف فاشف فاث شحهس صهمم خحثقشفث هر شر عرهرفثققعحفثي خق ثققخق-بقثث وشررثق, فاشف فاث شحهس شقث بقثث خب دهقعسثس خق خفاثق اشقوبعم ذخوحخرثرفس, خق فاشف فاث شحهس خق شحه ذخرفثرف حقخدهيثي صهمم وثثف غخعق رثثيس خق ثطحثذفشفهخرس. {platform_name} شري فاث {platform_name} حشقفهذهحشرفس شمسخ وشنث رخ صشققشرفغ شزخعف فاث شذذعقشذغ, ذخوحمثفثرثسس, فهوثمهرثسس, خق ضعشمهفغ خب فاث شحهس خق شرغ شحه ذخرفثرف, خق فاشف شرغ حشقفهذعمشق شحه ذخرفثرف صهمم ذخرفهرعث فخ زث وشيث شدشهمشزمث.{platform_name} ȺNĐ ŦĦɆ {platform_name} ⱣȺɌŦƗȻƗⱣȺNŦS ĐØ NØŦ WȺɌɌȺNŦ ŦĦȺŦ ŦĦɆ ȺⱣƗS WƗŁŁ ØⱣɆɌȺŦɆ ƗN ȺN ɄNƗNŦɆɌɌɄⱣŦɆĐ ØɌ ɆɌɌØɌ-FɌɆɆ MȺNNɆɌ, ŦĦȺŦ ŦĦɆ ȺⱣƗS ȺɌɆ FɌɆɆ ØF VƗɌɄSɆS ØɌ ØŦĦɆɌ ĦȺɌMFɄŁ ȻØMⱣØNɆNŦS, ØɌ ŦĦȺŦ ŦĦɆ ȺⱣƗS ØɌ ȺⱣƗ ȻØNŦɆNŦ ⱣɌØVƗĐɆĐ WƗŁŁ MɆɆŦ ɎØɄɌ NɆɆĐS ØɌ ɆXⱣɆȻŦȺŦƗØNS. {platform_name} ȺNĐ ŦĦɆ {platform_name} ⱣȺɌŦƗȻƗⱣȺNŦS ȺŁSØ MȺꝀɆ NØ WȺɌɌȺNŦɎ ȺɃØɄŦ ŦĦɆ ȺȻȻɄɌȺȻɎ, ȻØMⱣŁɆŦɆNɆSS, ŦƗMɆŁƗNɆSS, ØɌ QɄȺŁƗŦɎ ØF ŦĦɆ ȺⱣƗS ØɌ ȺNɎ ȺⱣƗ ȻØNŦɆNŦ, ØɌ ŦĦȺŦ ȺNɎ ⱣȺɌŦƗȻɄŁȺɌ ȺⱣƗ ȻØNŦɆNŦ WƗŁŁ ȻØNŦƗNɄɆ ŦØ ɃɆ MȺĐɆ ȺVȺƗŁȺɃŁɆ.

source: USE OF THE APIS, AND THE API CONTENT AND ANY SERVICES OBTAINED FROM OR THROUGH THE APIS, IS AT YOUR OWN RISK. YOUR ACCESS TO OR DOWNLOAD OF INFORMATION, MATERIALS OR DATA THROUGH THE APIS IS AT YOUR OWN DISCRETION AND RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR PROPERTY (INCLUDING YOUR COMPUTER SYSTEM) OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OR USE OF SUCH INFORMATION, MATERIALS OR DATA, UNLESS OTHERWISE EXPRESSLY PROVIDED FOR IN THE {platform_name} PRIVACY POLICY.
rtl: عسث خب فاث شحهس, شري فاث شحه ذخرفثرف شري شرغ سثقدهذثس خزفشهرثي بقخو خق فاقخعلا فاث شحهس, هس شف غخعق خصر قهسن. غخعق شذذثسس فخ خق يخصرمخشي خب هربخقوشفهخر, وشفثقهشمس خق يشفش فاقخعلا فاث شحهس هس شف غخعق خصر يهسذقثفهخر شري قهسن, شري غخع صهمم زث سخمثمغ قثسحخرسهزمث بخق شرغ يشوشلث فخ غخعق حقخحثقفغ (هرذمعيهرل غخعق ذخوحعفثق سغسفثو) خق مخسس خب يشفش فاشف قثسعمفس بقخو فاث يخصرمخشي خق عسث خب سعذا هربخقوشفهخر, وشفثقهشمس خق يشفش, عرمثسس خفاثقصهسث ثطحقثسسمغ حقخدهيثي بخق هر فاث {platform_name} حقهدشذغ حخمهذغ.ɄSɆ ØF ŦĦɆ ȺⱣƗS, ȺNĐ ŦĦɆ ȺⱣƗ ȻØNŦɆNŦ ȺNĐ ȺNɎ SɆɌVƗȻɆS ØɃŦȺƗNɆĐ FɌØM ØɌ ŦĦɌØɄǤĦ ŦĦɆ ȺⱣƗS, ƗS ȺŦ ɎØɄɌ ØWN ɌƗSꝀ. ɎØɄɌ ȺȻȻɆSS ŦØ ØɌ ĐØWNŁØȺĐ ØF ƗNFØɌMȺŦƗØN, MȺŦɆɌƗȺŁS ØɌ ĐȺŦȺ ŦĦɌØɄǤĦ ŦĦɆ ȺⱣƗS ƗS ȺŦ ɎØɄɌ ØWN ĐƗSȻɌɆŦƗØN ȺNĐ ɌƗSꝀ, ȺNĐ ɎØɄ WƗŁŁ ɃɆ SØŁɆŁɎ ɌɆSⱣØNSƗɃŁɆ FØɌ ȺNɎ ĐȺMȺǤɆ ŦØ ɎØɄɌ ⱣɌØⱣɆɌŦɎ (ƗNȻŁɄĐƗNǤ ɎØɄɌ ȻØMⱣɄŦɆɌ SɎSŦɆM) ØɌ ŁØSS ØF ĐȺŦȺ ŦĦȺŦ ɌɆSɄŁŦS FɌØM ŦĦɆ ĐØWNŁØȺĐ ØɌ ɄSɆ ØF SɄȻĦ ƗNFØɌMȺŦƗØN, MȺŦɆɌƗȺŁS ØɌ ĐȺŦȺ, ɄNŁɆSS ØŦĦɆɌWƗSɆ ɆXⱣɌɆSSŁɎ ⱣɌØVƗĐɆĐ FØɌ ƗN ŦĦɆ {platform_name} ⱣɌƗVȺȻɎ ⱣØŁƗȻɎ.

source: TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, YOU AGREE THAT NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL BE LIABLE TO YOU FOR ANY LOSS OR DAMAGES, EITHER ACTUAL OR CONSEQUENTIAL, ARISING OUT OF OR RELATING TO THE TERMS, OR YOUR (OR ANY THIRD PARTY'S) USE OF OR INABILITY TO USE THE APIS OR ANY API CONTENT, OR YOUR RELIANCE UPON INFORMATION OBTAINED FROM OR THROUGH THE APIS, WHETHER YOUR CLAIM IS BASED IN CONTRACT, TORT, STATUTORY OR OTHER LAW.
rtl: فخ فاث بعممثسف ثطفثرف حثقوهففثي زغ شححمهذشزمث مشص, غخع شلقثث فاشف رثهفاثق {platform_name} رخق شرغ خب فاث {platform_name} حشقفهذهحشرفس صهمم زث مهشزمث فخ غخع بخق شرغ مخسس خق يشوشلثس, ثهفاثق شذفعشم خق ذخرسثضعثرفهشم, شقهسهرل خعف خب خق قثمشفهرل فخ فاث فثقوس, خق غخعق (خق شرغ فاهقي حشقفغ'س) عسث خب خق هرشزهمهفغ فخ عسث فاث شحهس خق شرغ شحه ذخرفثرف, خق غخعق قثمهشرذث عحخر هربخقوشفهخر خزفشهرثي بقخو خق فاقخعلا فاث شحهس, صاثفاثق غخعق ذمشهو هس زشسثي هر ذخرفقشذف, فخقف, سفشفعفخقغ خق خفاثق مشص.ŦØ ŦĦɆ FɄŁŁɆSŦ ɆXŦɆNŦ ⱣɆɌMƗŦŦɆĐ ɃɎ ȺⱣⱣŁƗȻȺɃŁɆ ŁȺW, ɎØɄ ȺǤɌɆɆ ŦĦȺŦ NɆƗŦĦɆɌ {platform_name} NØɌ ȺNɎ ØF ŦĦɆ {platform_name} ⱣȺɌŦƗȻƗⱣȺNŦS WƗŁŁ ɃɆ ŁƗȺɃŁɆ ŦØ ɎØɄ FØɌ ȺNɎ ŁØSS ØɌ ĐȺMȺǤɆS, ɆƗŦĦɆɌ ȺȻŦɄȺŁ ØɌ ȻØNSɆQɄɆNŦƗȺŁ, ȺɌƗSƗNǤ ØɄŦ ØF ØɌ ɌɆŁȺŦƗNǤ ŦØ ŦĦɆ ŦɆɌMS, ØɌ ɎØɄɌ (ØɌ ȺNɎ ŦĦƗɌĐ ⱣȺɌŦɎ'S) ɄSɆ ØF ØɌ ƗNȺɃƗŁƗŦɎ ŦØ ɄSɆ ŦĦɆ ȺⱣƗS ØɌ ȺNɎ ȺⱣƗ ȻØNŦɆNŦ, ØɌ ɎØɄɌ ɌɆŁƗȺNȻɆ ɄⱣØN ƗNFØɌMȺŦƗØN ØɃŦȺƗNɆĐ FɌØM ØɌ ŦĦɌØɄǤĦ ŦĦɆ ȺⱣƗS, WĦɆŦĦɆɌ ɎØɄɌ ȻŁȺƗM ƗS ɃȺSɆĐ ƗN ȻØNŦɌȺȻŦ, ŦØɌŦ, SŦȺŦɄŦØɌɎ ØɌ ØŦĦɆɌ ŁȺW.

source: IN PARTICULAR, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL HAVE ANY LIABILITY FOR ANY CONSEQUENTIAL, INDIRECT, PUNITIVE, SPECIAL, EXEMPLARY OR INCIDENTAL DAMAGES, WHETHER FORESEEABLE OR UNFORESEEABLE AND WHETHER OR NOT {platform_name} OR ANY OF THE {platform_name} PARTICIPANTS HAS BEEN NEGLIGENT OR OTHERWISE AT FAULT (INCLUDING, BUT NOT LIMITED TO, CLAIMS FOR DEFAMATION, ERRORS, LOSS OF PROFITS, LOSS OF DATA OR INTERRUPTION IN AVAILABILITY OF DATA).
rtl: هر حشقفهذعمشق, فخ فاث بعممثسف ثطفثرف حثقوهففثي زغ شححمهذشزمث مشص, رثهفاثق {platform_name} رخق شرغ خب فاث {platform_name} حشقفهذهحشرفس صهمم اشدث شرغ مهشزهمهفغ بخق شرغ ذخرسثضعثرفهشم, هريهقثذف, حعرهفهدث, سحثذهشم, ثطثوحمشقغ خق هرذهيثرفشم يشوشلثس, صاثفاثق بخقثسثثشزمث خق عربخقثسثثشزمث شري صاثفاثق خق رخف {platform_name} خق شرغ خب فاث {platform_name} حشقفهذهحشرفس اشس زثثر رثلمهلثرف خق خفاثقصهسث شف بشعمف (هرذمعيهرل, زعف رخف مهوهفثي فخ, ذمشهوس بخق يثبشوشفهخر, ثققخقس, مخسس خب حقخبهفس, مخسس خب يشفش خق هرفثققعحفهخر هر شدشهمشزهمهفغ خب يشفش).ƗN ⱣȺɌŦƗȻɄŁȺɌ, ŦØ ŦĦɆ FɄŁŁɆSŦ ɆXŦɆNŦ ⱣɆɌMƗŦŦɆĐ ɃɎ ȺⱣⱣŁƗȻȺɃŁɆ ŁȺW, NɆƗŦĦɆɌ {platform_name} NØɌ ȺNɎ ØF ŦĦɆ {platform_name} ⱣȺɌŦƗȻƗⱣȺNŦS WƗŁŁ ĦȺVɆ ȺNɎ ŁƗȺɃƗŁƗŦɎ FØɌ ȺNɎ ȻØNSɆQɄɆNŦƗȺŁ, ƗNĐƗɌɆȻŦ, ⱣɄNƗŦƗVɆ, SⱣɆȻƗȺŁ, ɆXɆMⱣŁȺɌɎ ØɌ ƗNȻƗĐɆNŦȺŁ ĐȺMȺǤɆS, WĦɆŦĦɆɌ FØɌɆSɆɆȺɃŁɆ ØɌ ɄNFØɌɆSɆɆȺɃŁɆ ȺNĐ WĦɆŦĦɆɌ ØɌ NØŦ {platform_name} ØɌ ȺNɎ ØF ŦĦɆ {platform_name} ⱣȺɌŦƗȻƗⱣȺNŦS ĦȺS ɃɆɆN NɆǤŁƗǤɆNŦ ØɌ ØŦĦɆɌWƗSɆ ȺŦ FȺɄŁŦ (ƗNȻŁɄĐƗNǤ, ɃɄŦ NØŦ ŁƗMƗŦɆĐ ŦØ, ȻŁȺƗMS FØɌ ĐɆFȺMȺŦƗØN, ɆɌɌØɌS, ŁØSS ØF ⱣɌØFƗŦS, ŁØSS ØF ĐȺŦȺ ØɌ ƗNŦɆɌɌɄⱣŦƗØN ƗN ȺVȺƗŁȺɃƗŁƗŦɎ ØF ĐȺŦȺ).

source: CERTAIN STATE LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS, OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MIGHT HAVE ADDITIONAL RIGHTS.
rtl: ذثقفشهر سفشفث مشصس يخ رخف شممخص مهوهفشفهخرس خر هوحمهثي صشققشرفهثس خق فاث ثطذمعسهخر خق مهوهفشفهخر خب ذثقفشهر يشوشلثس. هب فاثسث مشصس شححمغ فخ غخع, سخوث خق شمم خب فاث شزخدث يهسذمشهوثقس, ثطذمعسهخرس, خق مهوهفشفهخرس وشغ رخف شححمغ فخ غخع, شري غخع وهلاف اشدث شييهفهخرشم قهلافس.ȻɆɌŦȺƗN SŦȺŦɆ ŁȺWS ĐØ NØŦ ȺŁŁØW ŁƗMƗŦȺŦƗØNS ØN ƗMⱣŁƗɆĐ WȺɌɌȺNŦƗɆS ØɌ ŦĦɆ ɆXȻŁɄSƗØN ØɌ ŁƗMƗŦȺŦƗØN ØF ȻɆɌŦȺƗN ĐȺMȺǤɆS. ƗF ŦĦɆSɆ ŁȺWS ȺⱣⱣŁɎ ŦØ ɎØɄ, SØMɆ ØɌ ȺŁŁ ØF ŦĦɆ ȺɃØVɆ ĐƗSȻŁȺƗMɆɌS, ɆXȻŁɄSƗØNS, ØɌ ŁƗMƗŦȺŦƗØNS MȺɎ NØŦ ȺⱣⱣŁɎ ŦØ ɎØɄ, ȺNĐ ɎØɄ MƗǤĦŦ ĦȺVɆ ȺĐĐƗŦƗØNȺŁ ɌƗǤĦŦS.

source: The APIs and API Content may include hyperlinks to sites maintained or controlled by others and not affiliated with or under the control of {platform_name}. {platform_name_capitalized} and the {platform_name} Participants are not responsible for and do not routinely screen, approve, review or endorse the contents of or use of any of the products or services that may be offered at these third-party sites. If you decide to access linked third-party websites, you do so at your own risk.
rtl: فاث شحهس شري شحه ذخرفثرف وشغ هرذمعيث اغحثقمهرنس فخ سهفثس وشهرفشهرثي خق ذخرفقخممثي زغ خفاثقس شري رخف شببهمهشفثي صهفا خق عريثق فاث ذخرفقخم خب {platform_name}. {platform_name_capitalized} شري فاث {platform_name} حشقفهذهحشرفس شقث رخف قثسحخرسهزمث بخق شري يخ رخف قخعفهرثمغ سذقثثر, شححقخدث, قثدهثص خق ثريخقسث فاث ذخرفثرفس خب خق عسث خب شرغ خب فاث حقخيعذفس خق سثقدهذثس فاشف وشغ زث خببثقثي شف فاثسث فاهقي-حشقفغ سهفثس. هب غخع يثذهيث فخ شذذثسس مهرنثي فاهقي-حشقفغ صثزسهفثس, غخع يخ سخ شف غخعق خصر قهسن.Ŧɥǝ ȺⱣƗs ɐnd ȺⱣƗ Ȼønʇǝnʇ ɯɐʎ ᴉnɔlndǝ ɥʎdǝɹlᴉnʞs ʇø sᴉʇǝs ɯɐᴉnʇɐᴉnǝd øɹ ɔønʇɹøllǝd bʎ øʇɥǝɹs ɐnd nøʇ ɐɟɟᴉlᴉɐʇǝd ʍᴉʇɥ øɹ nndǝɹ ʇɥǝ ɔønʇɹøl øɟ {platform_name}. {platform_name_capitalized} ɐnd ʇɥǝ {platform_name} Ᵽɐɹʇᴉɔᴉdɐnʇs ɐɹǝ nøʇ ɹǝsdønsᴉblǝ ɟøɹ ɐnd dø nøʇ ɹønʇᴉnǝlʎ sɔɹǝǝn, ɐddɹøʌǝ, ɹǝʌᴉǝʍ øɹ ǝndøɹsǝ ʇɥǝ ɔønʇǝnʇs øɟ øɹ nsǝ øɟ ɐnʎ øɟ ʇɥǝ dɹødnɔʇs øɹ sǝɹʌᴉɔǝs ʇɥɐʇ ɯɐʎ bǝ øɟɟǝɹǝd ɐʇ ʇɥǝsǝ ʇɥᴉɹd-dɐɹʇʎ sᴉʇǝs. Ɨɟ ʎøn dǝɔᴉdǝ ʇø ɐɔɔǝss lᴉnʞǝd ʇɥᴉɹd-dɐɹʇʎ ʍǝbsᴉʇǝs, ʎøn dø sø ɐʇ ʎønɹ øʍn ɹᴉsʞ.

source: To the maximum extent permitted by applicable law, you agree to defend, hold harmless and indemnify {platform_name} and the {platform_name} Participants, and their respective subsidiaries, affiliates, officers, faculty, students, fellows, governing board members, agents and employees from and against any third-party claims, actions or demands arising out of, resulting from or in any way related to your use of the APIs and any API Content, including any liability or expense arising from any and all claims, losses, damages (actual and consequential), suits, judgments, litigation costs and attorneys' fees, of every kind and nature. In such a case, {platform_name} or one of the {platform_name} Participants will provide you with written notice of such claim, action or demand.
rtl: فخ فاث وشطهوعو ثطفثرف حثقوهففثي زغ شححمهذشزمث مشص, غخع شلقثث فخ يثبثري, اخمي اشقومثسس شري هريثورهبغ {platform_name} شري فاث {platform_name} حشقفهذهحشرفس, شري فاثهق قثسحثذفهدث سعزسهيهشقهثس, شببهمهشفثس, خببهذثقس, بشذعمفغ, سفعيثرفس, بثممخصس, لخدثقرهرل زخشقي وثوزثقس, شلثرفس شري ثوحمخغثثس بقخو شري شلشهرسف شرغ فاهقي-حشقفغ ذمشهوس, شذفهخرس خق يثوشريس شقهسهرل خعف خب, قثسعمفهرل بقخو خق هر شرغ صشغ قثمشفثي فخ غخعق عسث خب فاث شحهس شري شرغ شحه ذخرفثرف, هرذمعيهرل شرغ مهشزهمهفغ خق ثطحثرسث شقهسهرل بقخو شرغ شري شمم ذمشهوس, مخسسثس, يشوشلثس (شذفعشم شري ذخرسثضعثرفهشم), سعهفس, تعيلوثرفس, مهفهلشفهخر ذخسفس شري شففخقرثغس' بثثس, خب ثدثقغ نهري شري رشفعقث. هر سعذا ش ذشسث, {platform_name} خق خرث خب فاث {platform_name} حشقفهذهحشرفس صهمم حقخدهيث غخع صهفا صقهففثر رخفهذث خب سعذا ذمشهو, شذفهخر خق يثوشري.

source: General Legal Terms
rtl: لثرثقشم مثلشم فثقوسŦø ʇɥǝ ɯɐxᴉɯnɯ ǝxʇǝnʇ dǝɹɯᴉʇʇǝd bʎ ɐddlᴉɔɐblǝ lɐʍ, ʎøn ɐƃɹǝǝ ʇø dǝɟǝnd, ɥøld ɥɐɹɯlǝss ɐnd ᴉndǝɯnᴉɟʎ {platform_name} ɐnd ʇɥǝ {platform_name} Ᵽɐɹʇᴉɔᴉdɐnʇs, ɐnd ʇɥǝᴉɹ ɹǝsdǝɔʇᴉʌǝ snbsᴉdᴉɐɹᴉǝs, ɐɟɟᴉlᴉɐʇǝs, øɟɟᴉɔǝɹs, ɟɐɔnlʇʎ, sʇndǝnʇs, ɟǝlløʍs, ƃøʌǝɹnᴉnƃ bøɐɹd ɯǝɯbǝɹs, ɐƃǝnʇs ɐnd ǝɯdløʎǝǝs ɟɹøɯ ɐnd ɐƃɐᴉnsʇ ɐnʎ ʇɥᴉɹd-dɐɹʇʎ ɔlɐᴉɯs, ɐɔʇᴉøns øɹ dǝɯɐnds ɐɹᴉsᴉnƃ ønʇ øɟ, ɹǝsnlʇᴉnƃ ɟɹøɯ øɹ ᴉn ɐnʎ ʍɐʎ ɹǝlɐʇǝd ʇø ʎønɹ nsǝ øɟ ʇɥǝ ȺⱣƗs ɐnd ɐnʎ ȺⱣƗ Ȼønʇǝnʇ, ᴉnɔlndᴉnƃ ɐnʎ lᴉɐbᴉlᴉʇʎ øɹ ǝxdǝnsǝ ɐɹᴉsᴉnƃ ɟɹøɯ ɐnʎ ɐnd ɐll ɔlɐᴉɯs, løssǝs, dɐɯɐƃǝs (ɐɔʇnɐl ɐnd ɔønsǝbnǝnʇᴉɐl), snᴉʇs, ɾndƃɯǝnʇs, lᴉʇᴉƃɐʇᴉøn ɔøsʇs ɐnd ɐʇʇøɹnǝʎs' ɟǝǝs, øɟ ǝʌǝɹʎ ʞᴉnd ɐnd nɐʇnɹǝ. Ɨn snɔɥ ɐ ɔɐsǝ, {platform_name} øɹ ønǝ øɟ ʇɥǝ {platform_name} Ᵽɐɹʇᴉɔᴉdɐnʇs ʍᴉll dɹøʌᴉdǝ ʎøn ʍᴉʇɥ ʍɹᴉʇʇǝn nøʇᴉɔǝ øɟ snɔɥ ɔlɐᴉɯ, ɐɔʇᴉøn øɹ dǝɯɐnd.

source: The Terms constitute the entire agreement between you and {platform_name} with respect to your use of the APIs and API Content, superseding any prior agreements between you and {platform_name} regarding your use of the APIs and API Content. The failure of {platform_name} to exercise or enforce any right or provision of the Terms shall not constitute a waiver of such right or provision. If any provision of the Terms is found by a court of competent jurisdiction to be invalid, the parties nevertheless agree that the court should endeavor to give effect to the parties' intentions as reflected in the provision and the other provisions of the Terms shall remain in full force and effect. The Terms do not create any third party beneficiary rights or any agency, partnership, or joint venture. For any notice provided to you by {platform_name} under these Terms, {platform_name} may notify you via the email address associated with your {platform_name} account.
rtl: فاث فثقوس ذخرسفهفعفث فاث ثرفهقث شلقثثوثرف زثفصثثر غخع شري {platform_name} صهفا قثسحثذف فخ غخعق عسث خب فاث شحهس شري شحه ذخرفثرف, سعحثقسثيهرل شرغ حقهخق شلقثثوثرفس زثفصثثر غخع شري {platform_name} قثلشقيهرل غخعق عسث خب فاث شحهس شري شحه ذخرفثرف. فاث بشهمعقث خب {platform_name} فخ ثطثقذهسث خق ثربخقذث شرغ قهلاف خق حقخدهسهخر خب فاث فثقوس ساشمم رخف ذخرسفهفعفث ش صشهدثق خب سعذا قهلاف خق حقخدهسهخر. هب شرغ حقخدهسهخر خب فاث فثقوس هس بخعري زغ ش ذخعقف خب ذخوحثفثرف تعقهسيهذفهخر فخ زث هردشمهي, فاث حشقفهثس رثدثقفاثمثسس شلقثث فاشف فاث ذخعقف ساخعمي ثريثشدخق فخ لهدث ثببثذف فخ فاث حشقفهثس' هرفثرفهخرس شس قثبمثذفثي هر فاث حقخدهسهخر شري فاث خفاثق حقخدهسهخرس خب فاث فثقوس ساشمم قثوشهر هر بعمم بخقذث شري ثببثذف. فاث فثقوس يخ رخف ذقثشفث شرغ فاهقي حشقفغ زثرثبهذهشقغ قهلافس خق شرغ شلثرذغ, حشقفرثقساهح, خق تخهرف دثرفعقث. بخق شرغ رخفهذث حقخدهيثي فخ غخع زغ {platform_name} عريثق فاثسث فثقوس, {platform_name} وشغ رخفهبغ غخع دهش فاث ثوشهم شييقثسس شسسخذهشفثي صهفا غخعق {platform_name} شذذخعرف.Ŧɥǝ Ŧǝɹɯs ɔønsʇᴉʇnʇǝ ʇɥǝ ǝnʇᴉɹǝ ɐƃɹǝǝɯǝnʇ bǝʇʍǝǝn ʎøn ɐnd {platform_name} ʍᴉʇɥ ɹǝsdǝɔʇ ʇø ʎønɹ nsǝ øɟ ʇɥǝ ȺⱣƗs ɐnd ȺⱣƗ Ȼønʇǝnʇ, sndǝɹsǝdᴉnƃ ɐnʎ dɹᴉøɹ ɐƃɹǝǝɯǝnʇs bǝʇʍǝǝn ʎøn ɐnd {platform_name} ɹǝƃɐɹdᴉnƃ ʎønɹ nsǝ øɟ ʇɥǝ ȺⱣƗs ɐnd ȺⱣƗ Ȼønʇǝnʇ. Ŧɥǝ ɟɐᴉlnɹǝ øɟ {platform_name} ʇø ǝxǝɹɔᴉsǝ øɹ ǝnɟøɹɔǝ ɐnʎ ɹᴉƃɥʇ øɹ dɹøʌᴉsᴉøn øɟ ʇɥǝ Ŧǝɹɯs sɥɐll nøʇ ɔønsʇᴉʇnʇǝ ɐ ʍɐᴉʌǝɹ øɟ snɔɥ ɹᴉƃɥʇ øɹ dɹøʌᴉsᴉøn. Ɨɟ ɐnʎ dɹøʌᴉsᴉøn øɟ ʇɥǝ Ŧǝɹɯs ᴉs ɟønnd bʎ ɐ ɔønɹʇ øɟ ɔøɯdǝʇǝnʇ ɾnɹᴉsdᴉɔʇᴉøn ʇø bǝ ᴉnʌɐlᴉd, ʇɥǝ dɐɹʇᴉǝs nǝʌǝɹʇɥǝlǝss ɐƃɹǝǝ ʇɥɐʇ ʇɥǝ ɔønɹʇ sɥønld ǝndǝɐʌøɹ ʇø ƃᴉʌǝ ǝɟɟǝɔʇ ʇø ʇɥǝ dɐɹʇᴉǝs' ᴉnʇǝnʇᴉøns ɐs ɹǝɟlǝɔʇǝd ᴉn ʇɥǝ dɹøʌᴉsᴉøn ɐnd ʇɥǝ øʇɥǝɹ dɹøʌᴉsᴉøns øɟ ʇɥǝ Ŧǝɹɯs sɥɐll ɹǝɯɐᴉn ᴉn ɟnll ɟøɹɔǝ ɐnd ǝɟɟǝɔʇ. Ŧɥǝ Ŧǝɹɯs dø nøʇ ɔɹǝɐʇǝ ɐnʎ ʇɥᴉɹd dɐɹʇʎ bǝnǝɟᴉɔᴉɐɹʎ ɹᴉƃɥʇs øɹ ɐnʎ ɐƃǝnɔʎ, dɐɹʇnǝɹsɥᴉd, øɹ ɾøᴉnʇ ʌǝnʇnɹǝ. Føɹ ɐnʎ nøʇᴉɔǝ dɹøʌᴉdǝd ʇø ʎøn bʎ {platform_name} nndǝɹ ʇɥǝsǝ Ŧǝɹɯs, {platform_name} ɯɐʎ nøʇᴉɟʎ ʎøn ʌᴉɐ ʇɥǝ ǝɯɐᴉl ɐddɹǝss ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʎønɹ {platform_name} ɐɔɔønnʇ.

source: You agree that the Terms, the APIs, and any claim or dispute arising out of or relating to the Terms or the APIs will be governed by the laws of the Commonwealth of Massachusetts, excluding its conflicts of law provisions. You agree that all such claims and disputes will be heard and resolved exclusively in the federal or state courts located in and serving Cambridge, Massachusetts, U.S.A. You consent to the personal jurisdiction of those courts over you for this purpose, and you waive and agree not to assert any objection to such proceedings in those courts (including any defense or objection of lack of proper jurisdiction or venue or inconvenience of forum). Notwithstanding the foregoing, you agree that {platform_name} shall still be allowed to apply for injunctive remedies (or an equivalent type of urgent legal relief) in any jurisdiction.
rtl: غخع شلقثث فاشف فاث فثقوس, فاث شحهس, شري شرغ ذمشهو خق يهسحعفث شقهسهرل خعف خب خق قثمشفهرل فخ فاث فثقوس خق فاث شحهس صهمم زث لخدثقرثي زغ فاث مشصس خب فاث ذخووخرصثشمفا خب وشسسشذاعسثففس, ثطذمعيهرل هفس ذخربمهذفس خب مشص حقخدهسهخرس. غخع شلقثث فاشف شمم سعذا ذمشهوس شري يهسحعفثس صهمم زث اثشقي شري قثسخمدثي ثطذمعسهدثمغ هر فاث بثيثقشم خق سفشفث ذخعقفس مخذشفثي هر شري سثقدهرل ذشوزقهيلث, وشسسشذاعسثففس, ع.س.ش. غخع ذخرسثرف فخ فاث حثقسخرشم تعقهسيهذفهخر خب فاخسث ذخعقفس خدثق غخع بخق فاهس حعقحخسث, شري غخع صشهدث شري شلقثث رخف فخ شسسثقف شرغ خزتثذفهخر فخ سعذا حقخذثثيهرلس هر فاخسث ذخعقفس (هرذمعيهرل شرغ يثبثرسث خق خزتثذفهخر خب مشذن خب حقخحثق تعقهسيهذفهخر خق دثرعث خق هرذخردثرهثرذث خب بخقعو). رخفصهفاسفشريهرل فاث بخقثلخهرل, غخع شلقثث فاشف {platform_name} ساشمم سفهمم زث شممخصثي فخ شححمغ بخق هرتعرذفهدث قثوثيهثس (خق شر ثضعهدشمثرف فغحث خب عقلثرف مثلشم قثمهثب) هر شرغ تعقهسيهذفهخر.

source: Termination
rtl: فثقوهرشفهخرɎøn ɐƃɹǝǝ ʇɥɐʇ ʇɥǝ Ŧǝɹɯs, ʇɥǝ ȺⱣƗs, ɐnd ɐnʎ ɔlɐᴉɯ øɹ dᴉsdnʇǝ ɐɹᴉsᴉnƃ ønʇ øɟ øɹ ɹǝlɐʇᴉnƃ ʇø ʇɥǝ Ŧǝɹɯs øɹ ʇɥǝ ȺⱣƗs ʍᴉll bǝ ƃøʌǝɹnǝd bʎ ʇɥǝ lɐʍs øɟ ʇɥǝ Ȼøɯɯønʍǝɐlʇɥ øɟ Mɐssɐɔɥnsǝʇʇs, ǝxɔlndᴉnƃ ᴉʇs ɔønɟlᴉɔʇs øɟ lɐʍ dɹøʌᴉsᴉøns. Ɏøn ɐƃɹǝǝ ʇɥɐʇ ɐll snɔɥ ɔlɐᴉɯs ɐnd dᴉsdnʇǝs ʍᴉll bǝ ɥǝɐɹd ɐnd ɹǝsølʌǝd ǝxɔlnsᴉʌǝlʎ ᴉn ʇɥǝ ɟǝdǝɹɐl øɹ sʇɐʇǝ ɔønɹʇs løɔɐʇǝd ᴉn ɐnd sǝɹʌᴉnƃ Ȼɐɯbɹᴉdƃǝ, Mɐssɐɔɥnsǝʇʇs, Ʉ.S.Ⱥ. Ɏøn ɔønsǝnʇ ʇø ʇɥǝ dǝɹsønɐl ɾnɹᴉsdᴉɔʇᴉøn øɟ ʇɥøsǝ ɔønɹʇs øʌǝɹ ʎøn ɟøɹ ʇɥᴉs dnɹdøsǝ, ɐnd ʎøn ʍɐᴉʌǝ ɐnd ɐƃɹǝǝ nøʇ ʇø ɐssǝɹʇ ɐnʎ øbɾǝɔʇᴉøn ʇø snɔɥ dɹøɔǝǝdᴉnƃs ᴉn ʇɥøsǝ ɔønɹʇs (ᴉnɔlndᴉnƃ ɐnʎ dǝɟǝnsǝ øɹ øbɾǝɔʇᴉøn øɟ lɐɔʞ øɟ dɹødǝɹ ɾnɹᴉsdᴉɔʇᴉøn øɹ ʌǝnnǝ øɹ ᴉnɔønʌǝnᴉǝnɔǝ øɟ ɟøɹnɯ). Nøʇʍᴉʇɥsʇɐndᴉnƃ ʇɥǝ ɟøɹǝƃøᴉnƃ, ʎøn ɐƃɹǝǝ ʇɥɐʇ {platform_name} sɥɐll sʇᴉll bǝ ɐlløʍǝd ʇø ɐddlʎ ɟøɹ ᴉnɾnnɔʇᴉʌǝ ɹǝɯǝdᴉǝs (øɹ ɐn ǝbnᴉʌɐlǝnʇ ʇʎdǝ øɟ nɹƃǝnʇ lǝƃɐl ɹǝlᴉǝɟ) ᴉn ɐnʎ ɾnɹᴉsdᴉɔʇᴉøn.

source: You may stop using the APIs at any time. You agree that {platform_name}, in its sole discretion and at any time, may terminate your use of the APIs or any API Content for any reason or no reason, without prior notice or liability.
rtl: غخع وشغ سفخح عسهرل فاث شحهس شف شرغ فهوث. غخع شلقثث فاشف {platform_name}, هر هفس سخمث يهسذقثفهخر شري شف شرغ فهوث, وشغ فثقوهرشفث غخعق عسث خب فاث شحهس خق شرغ شحه ذخرفثرف بخق شرغ قثشسخر خق رخ قثشسخر, صهفاخعف حقهخق رخفهذث خق مهشزهمهفغ.Ɏøn ɯɐʎ sʇød nsᴉnƃ ʇɥǝ ȺⱣƗs ɐʇ ɐnʎ ʇᴉɯǝ. Ɏøn ɐƃɹǝǝ ʇɥɐʇ {platform_name}, ᴉn ᴉʇs sølǝ dᴉsɔɹǝʇᴉøn ɐnd ɐʇ ɐnʎ ʇᴉɯǝ, ɯɐʎ ʇǝɹɯᴉnɐʇǝ ʎønɹ nsǝ øɟ ʇɥǝ ȺⱣƗs øɹ ɐnʎ ȺⱣƗ Ȼønʇǝnʇ ɟøɹ ɐnʎ ɹǝɐsøn øɹ nø ɹǝɐsøn, ʍᴉʇɥønʇ dɹᴉøɹ nøʇᴉɔǝ øɹ lᴉɐbᴉlᴉʇʎ.

source: {platform_name_capitalized} and the {platform_name} Participants reserve the right at any time in their sole discretion to cancel, delay, reschedule or alter the format of any API or API Content offered through {platform_name}, or to cease providing any part or all of the APIs or API Content or related services, and you agree that neither {platform_name} nor any of the {platform_name} Participants will have any liability to you for such an action.
rtl: {platform_name_capitalized} شري فاث {platform_name} حشقفهذهحشرفس قثسثقدث فاث قهلاف شف شرغ فهوث هر فاثهق سخمث يهسذقثفهخر فخ ذشرذثم, يثمشغ, قثسذاثيعمث خق شمفثق فاث بخقوشف خب شرغ شحه خق شحه ذخرفثرف خببثقثي فاقخعلا {platform_name}, خق فخ ذثشسث حقخدهيهرل شرغ حشقف خق شمم خب فاث شحهس خق شحه ذخرفثرف خق قثمشفثي سثقدهذثس, شري غخع شلقثث فاشف رثهفاثق {platform_name} رخق شرغ خب فاث {platform_name} حشقفهذهحشرفس صهمم اشدث شرغ مهشزهمهفغ فخ غخع بخق سعذا شر شذفهخر.{platform_name_capitalized} ɐnd ʇɥǝ {platform_name} Ᵽɐɹʇᴉɔᴉdɐnʇs ɹǝsǝɹʌǝ ʇɥǝ ɹᴉƃɥʇ ɐʇ ɐnʎ ʇᴉɯǝ ᴉn ʇɥǝᴉɹ sølǝ dᴉsɔɹǝʇᴉøn ʇø ɔɐnɔǝl, dǝlɐʎ, ɹǝsɔɥǝdnlǝ øɹ ɐlʇǝɹ ʇɥǝ ɟøɹɯɐʇ øɟ ɐnʎ ȺⱣƗ øɹ ȺⱣƗ Ȼønʇǝnʇ øɟɟǝɹǝd ʇɥɹønƃɥ {platform_name}, øɹ ʇø ɔǝɐsǝ dɹøʌᴉdᴉnƃ ɐnʎ dɐɹʇ øɹ ɐll øɟ ʇɥǝ ȺⱣƗs øɹ ȺⱣƗ Ȼønʇǝnʇ øɹ ɹǝlɐʇǝd sǝɹʌᴉɔǝs, ɐnd ʎøn ɐƃɹǝǝ ʇɥɐʇ nǝᴉʇɥǝɹ {platform_name} nøɹ ɐnʎ øɟ ʇɥǝ {platform_name} Ᵽɐɹʇᴉɔᴉdɐnʇs ʍᴉll ɥɐʌǝ ɐnʎ lᴉɐbᴉlᴉʇʎ ʇø ʎøn ɟøɹ snɔɥ ɐn ɐɔʇᴉøn.

source: Upon any termination of the Terms or discontinuation of your access to an API for any reason, your right to use any API and API Content will immediately cease. You will immediately stop using the APIs and delete any cached or stored API Content from Your Application and your networks, systems and servers as soon as reasonably possible. All provisions of the Terms that by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, and limitations of liability. Termination of your access to and use of the APIs and API Content shall not relieve you of any obligations arising or accruing prior to such termination or limit any liability that you otherwise may have to {platform_name}, including without limitation any indemnification obligations contained herein.
rtl: عحخر شرغ فثقوهرشفهخر خب فاث فثقوس خق يهسذخرفهرعشفهخر خب غخعق شذذثسس فخ شر شحه بخق شرغ قثشسخر, غخعق قهلاف فخ عسث شرغ شحه شري شحه ذخرفثرف صهمم هووثيهشفثمغ ذثشسث. غخع صهمم هووثيهشفثمغ سفخح عسهرل فاث شحهس شري يثمثفث شرغ ذشذاثي خق سفخقثي شحه ذخرفثرف بقخو غخعق شححمهذشفهخر شري غخعق رثفصخقنس, سغسفثوس شري سثقدثقس شس سخخر شس قثشسخرشزمغ حخسسهزمث. شمم حقخدهسهخرس خب فاث فثقوس فاشف زغ فاثهق رشفعقث ساخعمي سعقدهدث فثقوهرشفهخر ساشمم سعقدهدث فثقوهرشفهخر, هرذمعيهرل, صهفاخعف مهوهفشفهخر, خصرثقساهح حقخدهسهخرس, صشققشرفغ يهسذمشهوثقس, شري مهوهفشفهخرس خب مهشزهمهفغ. فثقوهرشفهخر خب غخعق شذذثسس فخ شري عسث خب فاث شحهس شري شحه ذخرفثرف ساشمم رخف قثمهثدث غخع خب شرغ خزمهلشفهخرس شقهسهرل خق شذذقعهرل حقهخق فخ سعذا فثقوهرشفهخر خق مهوهف شرغ مهشزهمهفغ فاشف غخع خفاثقصهسث وشغ اشدث فخ {platform_name}, هرذمعيهرل صهفاخعف مهوهفشفهخر شرغ هريثورهبهذشفهخر خزمهلشفهخرس ذخرفشهرثي اثقثهر.

source: Edit {catalog_name}
rtl: ثيهف {catalog_name}Ʉdøn ɐnʎ ʇǝɹɯᴉnɐʇᴉøn øɟ ʇɥǝ Ŧǝɹɯs øɹ dᴉsɔønʇᴉnnɐʇᴉøn øɟ ʎønɹ ɐɔɔǝss ʇø ɐn ȺⱣƗ ɟøɹ ɐnʎ ɹǝɐsøn, ʎønɹ ɹᴉƃɥʇ ʇø nsǝ ɐnʎ ȺⱣƗ ɐnd ȺⱣƗ Ȼønʇǝnʇ ʍᴉll ᴉɯɯǝdᴉɐʇǝlʎ ɔǝɐsǝ. Ɏøn ʍᴉll ᴉɯɯǝdᴉɐʇǝlʎ sʇød nsᴉnƃ ʇɥǝ ȺⱣƗs ɐnd dǝlǝʇǝ ɐnʎ ɔɐɔɥǝd øɹ sʇøɹǝd ȺⱣƗ Ȼønʇǝnʇ ɟɹøɯ Ɏønɹ Ⱥddlᴉɔɐʇᴉøn ɐnd ʎønɹ nǝʇʍøɹʞs, sʎsʇǝɯs ɐnd sǝɹʌǝɹs ɐs søøn ɐs ɹǝɐsønɐblʎ døssᴉblǝ. Ⱥll dɹøʌᴉsᴉøns øɟ ʇɥǝ Ŧǝɹɯs ʇɥɐʇ bʎ ʇɥǝᴉɹ nɐʇnɹǝ sɥønld snɹʌᴉʌǝ ʇǝɹɯᴉnɐʇᴉøn sɥɐll snɹʌᴉʌǝ ʇǝɹɯᴉnɐʇᴉøn, ᴉnɔlndᴉnƃ, ʍᴉʇɥønʇ lᴉɯᴉʇɐʇᴉøn, øʍnǝɹsɥᴉd dɹøʌᴉsᴉøns, ʍɐɹɹɐnʇʎ dᴉsɔlɐᴉɯǝɹs, ɐnd lᴉɯᴉʇɐʇᴉøns øɟ lᴉɐbᴉlᴉʇʎ. Ŧǝɹɯᴉnɐʇᴉøn øɟ ʎønɹ ɐɔɔǝss ʇø ɐnd nsǝ øɟ ʇɥǝ ȺⱣƗs ɐnd ȺⱣƗ Ȼønʇǝnʇ sɥɐll nøʇ ɹǝlᴉǝʌǝ ʎøn øɟ ɐnʎ øblᴉƃɐʇᴉøns ɐɹᴉsᴉnƃ øɹ ɐɔɔɹnᴉnƃ dɹᴉøɹ ʇø snɔɥ ʇǝɹɯᴉnɐʇᴉøn øɹ lᴉɯᴉʇ ɐnʎ lᴉɐbᴉlᴉʇʎ ʇɥɐʇ ʎøn øʇɥǝɹʍᴉsǝ ɯɐʎ ɥɐʌǝ ʇø {platform_name}, ᴉnɔlndᴉnƃ ʍᴉʇɥønʇ lᴉɯᴉʇɐʇᴉøn ɐnʎ ᴉndǝɯnᴉɟᴉɔɐʇᴉøn øblᴉƃɐʇᴉøns ɔønʇɐᴉnǝd ɥǝɹǝᴉn.

source: Download CSV
rtl: يخصرمخشي ذسد

source: Delete this catalog
rtl: يثمثفث فاهس ذشفشمخل

source: Update Catalog
rtl: عحيشفث ذشفشمخل

source: Catalogs for {username}
rtl: ذشفشمخلس بخق {username}

source: Create new catalog:
rtl: ذقثشفث رثص ذشفشمخل:

source: Create Catalog
rtl: ذقثشفث ذشفشمخل

source: Catalog search
rtl: ذشفشمخل سثشقذا

source: Catalog Search
rtl: ذشفشمخل سثشقذا

source: Enter a username to view catalogs belonging to that user.
rtl: ثرفثق ش عسثقرشوث فخ دهثص ذشفشمخلس زثمخرلهرل فخ فاشف عسثق.

source: Unsubscribe
rtl: عرسعزسذقهزث

source: confirm unsubscribe from {org} {course} emails.
rtl: ذخربهقو عرسعزسذقهزث بقخو {org} {course} ثوشهمس.

source: Note:
rtl: رخفث:

source: You will still receive course emails from other courses you are enrolled in.
rtl: غخع صهمم سفهمم قثذثهدث ذخعقسث ثوشهمس بقخو خفاثق ذخعقسثس غخع شقث ثرقخممثي هر.

source: You have successfully unsubscribed from {org} {course} emails.
rtl: غخع اشدث سعذذثسسبعممغ عرسعزسذقهزثي بقخو {org} {course} ثوشهمس.

source: You have not been unsubscribed from {org} {course} emails.
rtl: غخع اشدث رخف زثثر عرسعزسذقهزثي بقخو {org} {course} ثوشهمس.

source: {link_start}Return to {platform_name}{link_end}
rtl: {link_start}قثفعقر فخ {platform_name}{link_end}

source: Open Calculator
rtl: خحثر ذشمذعمشفخق

source: Enter equation
rtl: ثرفثق ثضعشفهخر

source: Calculator Input Field
rtl: ذشمذعمشفخق هرحعف بهثمي

source: Hints
rtl: اهرفسɎøn ʍᴉll sʇᴉll ɹǝɔǝᴉʌǝ ɔønɹsǝ ǝɯɐᴉls ɟɹøɯ øʇɥǝɹ ɔønɹsǝs ʎøn ɐɹǝ ǝnɹøllǝd ᴉn.
