Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: We're creating your certificate. You can keep working in your courses and a link to it will appear here and on your Dashboard when it is ready.
rtl: صث'قث ذقثشفهرل غخعق ذثقفهبهذشفث. غخع ذشر نثثح صخقنهرل هر غخعق ذخعقسثس شري ش مهرن فخ هف صهمم شححثشق اثقث شري خر غخعق يشسازخشقي صاثر هف هس قثشيغ.

source: Your certificate has been invalidated
rtl: غخعق ذثقفهبهذشفث اشس زثثر هردشمهيشفثي

source: Please contact your course team if you have any questions.
rtl: حمثشسث ذخرفشذف غخعق ذخعقسث فثشو هب غخع اشدث شرغ ضعثسفهخرس.

source: Congratulations, you qualified for a certificate!
rtl: ذخرلقشفعمشفهخرس, غخع ضعشمهبهثي بخق ش ذثقفهبهذشفث!

source: You've earned a certificate for this course.
rtl: غخع'دث ثشقرثي ش ذثقفهبهذشفث بخق فاهس ذخعقسث.

source: Certificate unavailable
rtl: ذثقفهبهذشفث عرشدشهمشزمثWǝ'ɹǝ ɔɹǝɐʇᴉnƃ ʎønɹ ɔǝɹʇᴉɟᴉɔɐʇǝ. Ɏøn ɔɐn ʞǝǝd ʍøɹʞᴉnƃ ᴉn ʎønɹ ɔønɹsǝs ɐnd ɐ lᴉnʞ ʇø ᴉʇ ʍᴉll ɐddǝɐɹ ɥǝɹǝ ɐnd øn ʎønɹ Đɐsɥbøɐɹd ʍɥǝn ᴉʇ ᴉs ɹǝɐdʎ.

source: Your certificate will be available soon!
rtl: Ɏønɹ ɔǝɹʇᴉɟᴉɔɐʇǝ ʍᴉll bǝ ɐʌɐᴉlɐblǝ søøn!

source: After this course officially ends, you will receive an email notification with your certificate.
rtl: Ⱥɟʇǝɹ ʇɥᴉs ɔønɹsǝ øɟɟᴉɔᴉɐllʎ ǝnds, ʎøn ʍᴉll ɹǝɔǝᴉʌǝ ɐn ǝɯɐᴉl nøʇᴉɟᴉɔɐʇᴉøn ʍᴉʇɥ ʎønɹ ɔǝɹʇᴉɟᴉɔɐʇǝ.

source: Your certificate is available
rtl: Ɏønɹ ɔǝɹʇᴉɟᴉɔɐʇǝ ᴉs ɐʌɐᴉlɐblǝ

source: You have not received a certificate because you do not have a current {platform_name} verified identity.
rtl: غخع اشدث رخف قثذثهدثي ش ذثقفهبهذشفث زثذشعسث غخع يخ رخف اشدث ش ذعققثرف {platform_name} دثقهبهثي هيثرفهفغ.

source: To see course content, {sign_in_link} or {register_link}.
rtl: فخ سثث ذخعقسث ذخرفثرف, {sign_in_link} خق {register_link}.

source: {sign_in_link} or {register_link}.
rtl: {sign_in_link} خق {register_link}.

source: Sign in
rtl: سهلر هر

source: You must be enrolled in the course to see course content. {enroll_link_start}Enroll now{enroll_link_end}.
rtl: غخع وعسف زث ثرقخممثي هر فاث ذخعقسث فخ سثث ذخعقسث ذخرفثرف. {enroll_link_start}ثرقخمم رخص{enroll_link_end}.

source: You must be enrolled in the course to see course content.
rtl: غخع وعسف زث ثرقخممثي هر فاث ذخعقسث فخ سثث ذخعقسث ذخرفثرف.Ɏøn ɯnsʇ bǝ ǝnɹøllǝd ᴉn ʇɥǝ ɔønɹsǝ ʇø sǝǝ ɔønɹsǝ ɔønʇǝnʇ. {enroll_link_start}Ɇnɹøll nøʍ{enroll_link_end}.

source: User does not exist.
rtl: عسثق يخثس رخف ثطهسف.

source: Invalid location.
rtl: هردشمهي مخذشفهخر.

source: User {username} has never accessed problem {location}
rtl: عسثق {username} اشس رثدثق شذذثسسثي حقخزمثو {location}

source: You must be signed in to {platform_name} to create a certificate.
rtl: غخع وعسف زث سهلرثي هر فخ {platform_name} فخ ذقثشفث ش ذثقفهبهذشفث.

source: Course is not valid
rtl: ذخعقسث هس رخف دشمهي

source: Your certificate will be available when you pass the course.
rtl: غخعق ذثقفهبهذشفث صهمم زث شدشهمشزمث صاثر غخع حشسس فاث ذخعقسث.

source: Certificate has already been created.
rtl: ذثقفهبهذشفث اشس شمقثشيغ زثثر ذقثشفثي.

source: Certificate is being created.
rtl: ذثقفهبهذشفث هس زثهرل ذقثشفثي.

source: {platform_name} now offers financial assistance for learners who want to earn Verified Certificates but who may not be able to pay the Verified Certificate fee. Eligible learners may receive up to 90{percent_sign} off the Verified Certificate fee for a course. To apply for financial assistance, enroll in the audit track for a course that offers Verified Certificates, and then complete this application. Note that you must complete a separate application for each course you take. We plan to use this information to evaluate your application for financial assistance and to further develop our financial assistance program.
rtl: {platform_name} رخص خببثقس بهرشرذهشم شسسهسفشرذث بخق مثشقرثقس صاخ صشرف فخ ثشقر دثقهبهثي ذثقفهبهذشفثس زعف صاخ وشغ رخف زث شزمث فخ حشغ فاث دثقهبهثي ذثقفهبهذشفث بثث. ثمهلهزمث مثشقرثقس وشغ قثذثهدث عح فخ 90{percent_sign} خبب فاث دثقهبهثي ذثقفهبهذشفث بثث بخق ش ذخعقسث. فخ شححمغ بخق بهرشرذهشم شسسهسفشرذث, ثرقخمم هر فاث شعيهف فقشذن بخق ش ذخعقسث فاشف خببثقس دثقهبهثي ذثقفهبهذشفثس, شري فاثر ذخوحمثفث فاهس شححمهذشفهخر. رخفث فاشف غخع وعسف ذخوحمثفث ش سثحشقشفث شححمهذشفهخر بخق ثشذا ذخعقسث غخع فشنث. صث حمشر فخ عسث فاهس هربخقوشفهخر فخ ثدشمعشفث غخعق شححمهذشفهخر بخق بهرشرذهشم شسسهسفشرذث شري فخ بعقفاثق يثدثمخح خعق بهرشرذهشم شسسهسفشرذث حقخلقشو.

source: Annual Household Income
rtl: شررعشم اخعسثاخمي هرذخوث{platform_name} nøʍ øɟɟǝɹs ɟᴉnɐnɔᴉɐl ɐssᴉsʇɐnɔǝ ɟøɹ lǝɐɹnǝɹs ʍɥø ʍɐnʇ ʇø ǝɐɹn Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝs bnʇ ʍɥø ɯɐʎ nøʇ bǝ ɐblǝ ʇø dɐʎ ʇɥǝ Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝ ɟǝǝ. Ɇlᴉƃᴉblǝ lǝɐɹnǝɹs ɯɐʎ ɹǝɔǝᴉʌǝ nd ʇø 90{percent_sign} øɟɟ ʇɥǝ Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝ ɟǝǝ ɟøɹ ɐ ɔønɹsǝ. Ŧø ɐddlʎ ɟøɹ ɟᴉnɐnɔᴉɐl ɐssᴉsʇɐnɔǝ, ǝnɹøll ᴉn ʇɥǝ ɐndᴉʇ ʇɹɐɔʞ ɟøɹ ɐ ɔønɹsǝ ʇɥɐʇ øɟɟǝɹs Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝs, ɐnd ʇɥǝn ɔøɯdlǝʇǝ ʇɥᴉs ɐddlᴉɔɐʇᴉøn. Nøʇǝ ʇɥɐʇ ʎøn ɯnsʇ ɔøɯdlǝʇǝ ɐ sǝdɐɹɐʇǝ ɐddlᴉɔɐʇᴉøn ɟøɹ ǝɐɔɥ ɔønɹsǝ ʎøn ʇɐʞǝ. Wǝ dlɐn ʇø nsǝ ʇɥᴉs ᴉnɟøɹɯɐʇᴉøn ʇø ǝʌɐlnɐʇǝ ʎønɹ ɐddlᴉɔɐʇᴉøn ɟøɹ ɟᴉnɐnɔᴉɐl ɐssᴉsʇɐnɔǝ ɐnd ʇø ɟnɹʇɥǝɹ dǝʌǝlød ønɹ ɟᴉnɐnɔᴉɐl ɐssᴉsʇɐnɔǝ dɹøƃɹɐɯ.

source: Tell us about your current financial situation. Why do you need assistance?
rtl: فثمم عس شزخعف غخعق ذعققثرف بهرشرذهشم سهفعشفهخر. صاغ يخ غخع رثثي شسسهسفشرذث?Ŧǝll ns ɐbønʇ ʎønɹ ɔnɹɹǝnʇ ɟᴉnɐnɔᴉɐl sᴉʇnɐʇᴉøn. Wɥʎ dø ʎøn nǝǝd ɐssᴉsʇɐnɔǝ?

source: Tell us about your learning or professional goals. How will a Verified Certificate in this course help you achieve these goals?
rtl: فثمم عس شزخعف غخعق مثشقرهرل خق حقخبثسسهخرشم لخشمس. اخص صهمم ش دثقهبهثي ذثقفهبهذشفث هر فاهس ذخعقسث اثمح غخع شذاهثدث فاثسث لخشمس?Ŧǝll ns ɐbønʇ ʎønɹ lǝɐɹnᴉnƃ øɹ dɹøɟǝssᴉønɐl ƃøɐls. Ħøʍ ʍᴉll ɐ Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝ ᴉn ʇɥᴉs ɔønɹsǝ ɥǝld ʎøn ɐɔɥᴉǝʌǝ ʇɥǝsǝ ƃøɐls?

source: Tell us about your plans for this course. What steps will you take to help you complete the course work and receive a certificate?
rtl: فثمم عس شزخعف غخعق حمشرس بخق فاهس ذخعقسث. صاشف سفثحس صهمم غخع فشنث فخ اثمح غخع ذخوحمثفث فاث ذخعقسث صخقن شري قثذثهدث ش ذثقفهبهذشفث?

source: Use between 1250 and 2500 characters or so in your response.
rtl: عسث زثفصثثر 1250 شري 2500 ذاشقشذفثقس خق سخ هر غخعق قثسحخرسث.Ŧǝll ns ɐbønʇ ʎønɹ dlɐns ɟøɹ ʇɥᴉs ɔønɹsǝ. Wɥɐʇ sʇǝds ʍᴉll ʎøn ʇɐʞǝ ʇø ɥǝld ʎøn ɔøɯdlǝʇǝ ʇɥǝ ɔønɹsǝ ʍøɹʞ ɐnd ɹǝɔǝᴉʌǝ ɐ ɔǝɹʇᴉɟᴉɔɐʇǝ?

source: Select the course for which you want to earn a verified certificate. If the course does not appear in the list, make sure that you have enrolled in the audit track for the course.
rtl: سثمثذف فاث ذخعقسث بخق صاهذا غخع صشرف فخ ثشقر ش دثقهبهثي ذثقفهبهذشفث. هب فاث ذخعقسث يخثس رخف شححثشق هر فاث مهسف, وشنث سعقث فاشف غخع اشدث ثرقخممثي هر فاث شعيهف فقشذن بخق فاث ذخعقسث.

source: Specify your annual household income in US Dollars.
rtl: سحثذهبغ غخعق شررعشم اخعسثاخمي هرذخوث هر عس يخممشقس.Sǝlǝɔʇ ʇɥǝ ɔønɹsǝ ɟøɹ ʍɥᴉɔɥ ʎøn ʍɐnʇ ʇø ǝɐɹn ɐ ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ. Ɨɟ ʇɥǝ ɔønɹsǝ døǝs nøʇ ɐddǝɐɹ ᴉn ʇɥǝ lᴉsʇ, ɯɐʞǝ snɹǝ ʇɥɐʇ ʎøn ɥɐʌǝ ǝnɹøllǝd ᴉn ʇɥǝ ɐndᴉʇ ʇɹɐɔʞ ɟøɹ ʇɥǝ ɔønɹsǝ.

source: I allow {platform_name} to use the information provided in this application (except for financial information) for {platform_name} marketing purposes.
rtl: ه شممخص {platform_name} فخ عسث فاث هربخقوشفهخر حقخدهيثي هر فاهس شححمهذشفهخر (ثطذثحف بخق بهرشرذهشم هربخقوشفهخر) بخق {platform_name} وشقنثفهرل حعقحخسثس.

source: Title can't be empty
rtl: فهفمث ذشر'ف زث ثوحفغ

source: Body can't be empty
rtl: زخيغ ذشر'ف زث ثوحفغ

source: Topic doesn't exist
rtl: فخحهذ يخثسر'ف ثطهسف

source: Comment level too deep
rtl: ذخووثرف مثدثم فخخ يثثحƗ ɐlløʍ {platform_name} ʇø nsǝ ʇɥǝ ᴉnɟøɹɯɐʇᴉøn dɹøʌᴉdǝd ᴉn ʇɥᴉs ɐddlᴉɔɐʇᴉøn (ǝxɔǝdʇ ɟøɹ ɟᴉnɐnɔᴉɐl ᴉnɟøɹɯɐʇᴉøn) ɟøɹ {platform_name} ɯɐɹʞǝʇᴉnƃ dnɹdøsǝs.

source: Error uploading file. Please contact the site administrator. Thank you.
rtl: ثققخق عحمخشيهرل بهمث. حمثشسث ذخرفشذف فاث سهفث شيوهرهسفقشفخق. فاشرن غخع.

source: Good
rtl: لخخيɆɹɹøɹ ndløɐdᴉnƃ ɟᴉlǝ. Ᵽlǝɐsǝ ɔønʇɐɔʇ ʇɥǝ sᴉʇǝ ɐdɯᴉnᴉsʇɹɐʇøɹ. Ŧɥɐnʞ ʎøn.

source: %(course_name)s: Reported content awaits review
rtl: %(course_name)s: Ɍǝdøɹʇǝd ɔønʇǝnʇ ɐʍɐᴉʇs ɹǝʌᴉǝʍ

source: Go to Discussion
rtl: Ǥø ʇø Đᴉsɔnssᴉøn

source: %(course_name)s: Reported content awaits review
rtl: %(course_name)s: Ɍǝdøɹʇǝd ɔønʇǝnʇ ɐʍɐᴉʇs ɹǝʌᴉǝʍ

source: %(course_name)s %(course_id)s moderator content for review
rtl: %(course_name)s %(course_id)s ɯødǝɹɐʇøɹ ɔønʇǝnʇ ɟøɹ ɹǝʌᴉǝʍ

source: %(comment_username)s replied to {start_tag}%(thread_title)s{end_tag}:
rtl: %(comment_username)s قثحمهثي فخ {start_tag}%(thread_title)s{end_tag}:

source: View discussion
rtl: دهثص يهسذعسسهخر

source: %(comment_username)s replied to <b>%(thread_title)s</b>:
rtl: %(comment_username)s قثحمهثي فخ <b>%(thread_title)s</b>:

source: Response to %(thread_title)s
rtl: قثسحخرسث فخ %(thread_title)s

source: Access to this discussion is restricted to team members and staff.
rtl: شذذثسس فخ فاهس يهسذعسسهخر هس قثسفقهذفثي فخ فثشو وثوزثقس شري سفشبب.

source: EdxNotes Service is unavailable. Please try again in a few minutes.
rtl: ثيطرخفثس سثقدهذث هس عرشدشهمشزمث. حمثشسث فقغ شلشهر هر ش بثص وهرعفثس.

source: Invalid JSON response received from notes api.
rtl: هردشمهي تسخر قثسحخرسث قثذثهدثي بقخو رخفثس شحه.

source: Incorrect data received from notes api.
rtl: هرذخققثذف يشفش قثذثهدثي بقخو رخفثس شحه.

source: No endpoint was provided for EdxNotes.
rtl: رخ ثريحخهرف صشس حقخدهيثي بخق ثيطرخفثس.

source: Notes
rtl: رخفثس

source: Allow learners to highlight passages and make notes right in the course.
rtl: شممخص مثشقرثقس فخ اهلامهلاف حشسسشلثس شري وشنث رخفثس قهلاف هر فاث ذخعقسث.Ⱥlløʍ lǝɐɹnǝɹs ʇø ɥᴉƃɥlᴉƃɥʇ dɐssɐƃǝs ɐnd ɯɐʞǝ nøʇǝs ɹᴉƃɥʇ ᴉn ʇɥǝ ɔønɹsǝ.

source: Cannot override subsection grade: subsection is not available for target learner.
rtl: ذشررخف خدثققهيث سعزسثذفهخر لقشيث: سعزسثذفهخر هس رخف شدشهمشزمث بخق فشقلثف مثشقرثق.Ȼɐnnøʇ øʌǝɹɹᴉdǝ snbsǝɔʇᴉøn ƃɹɐdǝ: snbsǝɔʇᴉøn ᴉs nøʇ ɐʌɐᴉlɐblǝ ɟøɹ ʇɐɹƃǝʇ lǝɐɹnǝɹ.

source: Proctored Exam Review: {review_status}
rtl: حقخذفخقثي ثطشو قثدهثص: {review_status}

source: A proctored exam attempt for {exam_name} in {course_name} by username: {student_username} was reviewed as {review_status} by the proctored exam review provider. Review link: {review_url}
rtl: ش حقخذفخقثي ثطشو شففثوحف بخق {exam_name} هر {course_name} زغ عسثقرشوث: {student_username} صشس قثدهثصثي شس {review_status} زغ فاث حقخذفخقثي ثطشو قثدهثص حقخدهيثق. قثدهثص مهرن: {review_url}

source: Your Platform Insights
rtl: غخعق حمشفبخقو هرسهلافسȺ dɹøɔʇøɹǝd ǝxɐɯ ɐʇʇǝɯdʇ ɟøɹ {exam_name} ᴉn {course_name} bʎ nsǝɹnɐɯǝ: {student_username} ʍɐs ɹǝʌᴉǝʍǝd ɐs {review_status} bʎ ʇɥǝ dɹøɔʇøɹǝd ǝxɐɯ ɹǝʌᴉǝʍ dɹøʌᴉdǝɹ. Ɍǝʌᴉǝʍ lᴉnʞ: {review_url}

source: The {report_type} report is being created. To view the status of the report, see Pending Tasks below.
rtl: فاث {report_type} قثحخقف هس زثهرل ذقثشفثي. فخ دهثص فاث سفشفعس خب فاث قثحخقف, سثث حثريهرل فشسنس زثمخص.Ŧɥǝ {report_type} ɹǝdøɹʇ ᴉs bǝᴉnƃ ɔɹǝɐʇǝd. Ŧø ʌᴉǝʍ ʇɥǝ sʇɐʇns øɟ ʇɥǝ ɹǝdøɹʇ, sǝǝ Ᵽǝndᴉnƃ Ŧɐsʞs bǝløʍ.

source: Found a conflict with given identifier. Please try an alternative identifier
rtl: بخعري ش ذخربمهذف صهفا لهدثر هيثرفهبهثق. حمثشسث فقغ شر شمفثقرشفهدث هيثرفهبهثقFønnd ɐ ɔønɟlᴉɔʇ ʍᴉʇɥ ƃᴉʌǝn ᴉdǝnʇᴉɟᴉǝɹ. Ᵽlǝɐsǝ ʇɹʎ ɐn ɐlʇǝɹnɐʇᴉʌǝ ᴉdǝnʇᴉɟᴉǝɹ

source: Make sure that the file you upload is in CSV format with no extraneous characters or rows.
rtl: وشنث سعقث فاشف فاث بهمث غخع عحمخشي هس هر ذسد بخقوشف صهفا رخ ثطفقشرثخعس ذاشقشذفثقس خق قخصس.

source: Could not read uploaded file.
rtl: ذخعمي رخف قثشي عحمخشيثي بهمث.Mɐʞǝ snɹǝ ʇɥɐʇ ʇɥǝ ɟᴉlǝ ʎøn ndløɐd ᴉs ᴉn ȻSV ɟøɹɯɐʇ ʍᴉʇɥ nø ǝxʇɹɐnǝøns ɔɥɐɹɐɔʇǝɹs øɹ ɹøʍs.

source: Data in row #{row_num} must have between four and six columns: email, username, full name, country, cohort, and course mode. The last two columns are optional.
rtl: Đɐʇɐ ᴉn ɹøʍ #{row_num} ɯnsʇ ɥɐʌǝ bǝʇʍǝǝn ɟønɹ ɐnd sᴉx ɔølnɯns: ǝɯɐᴉl, nsǝɹnɐɯǝ, ɟnll nɐɯǝ, ɔønnʇɹʎ, ɔøɥøɹʇ, ɐnd ɔønɹsǝ ɯødǝ. Ŧɥǝ lɐsʇ ʇʍø ɔølnɯns ɐɹǝ ødʇᴉønɐl.

source: Data in row #{row_num} must have exactly four columns: email, username, full name, and country
rtl: يشفش هر قخص #{row_num} وعسف اشدث ثطشذفمغ بخعق ذخمعورس: ثوشهم, عسثقرشوث, بعمم رشوث, شري ذخعرفقغ name, and country.

source: Course is not cohorted but cohort provided. Ignoring cohort assignment for all users.
rtl: Ȼønɹsǝ ᴉs nøʇ ɔøɥøɹʇǝd bnʇ ɔøɥøɹʇ dɹøʌᴉdǝd. Ɨƃnøɹᴉnƃ ɔøɥøɹʇ ɐssᴉƃnɯǝnʇ ɟøɹ ɐll nsǝɹs.

source: Cohort name not found: {cohort}. Ignoring cohort assignment for all users.
rtl: Ȼøɥøɹʇ nɐɯǝ nøʇ ɟønnd: {cohort}. Ɨƃnøɹᴉnƃ ɔøɥøɹʇ ɐssᴉƃnɯǝnʇ ɟøɹ ɐll nsǝɹs.

source: Invalid course mode: {mode}. Falling back to the default mode, or keeping the current mode in case the user is already enrolled.
rtl: Ɨnʌɐlᴉd ɔønɹsǝ ɯødǝ: {mode}. Fɐllᴉnƃ bɐɔʞ ʇø ʇɥǝ dǝɟɐnlʇ ɯødǝ, øɹ ʞǝǝdᴉnƃ ʇɥǝ ɔnɹɹǝnʇ ɯødǝ ᴉn ɔɐsǝ ʇɥǝ nsǝɹ ᴉs ɐlɹǝɐdʎ ǝnɹøllǝd.

source: Invalid course mode: {mode}. Failling back to {default_mode}, or resetting to {default_mode} in case the user is already enrolled.
rtl: Ɨnʌɐlᴉd ɔønɹsǝ ɯødǝ: {mode}. Fɐᴉllᴉnƃ bɐɔʞ ʇø {default_mode}, øɹ ɹǝsǝʇʇᴉnƃ ʇø {default_mode} ᴉn ɔɐsǝ ʇɥǝ nsǝɹ ᴉs ɐlɹǝɐdʎ ǝnɹøllǝd.

source: Invalid email {email_address}.
rtl: هردشمهي ثوشهم {email_address}.

source: An account with email {email} exists but the provided username {username} is different. Enrolling anyway with {email}.
rtl: شر شذذخعرف صهفا ثوشهم {email} ثطهسفس زعف فاث حقخدهيثي عسثقرشوث {username} هس يهببثقثرف. ثرقخممهرل شرغصشغ صهفا {email}.

source: File is not attached.
rtl: بهمث هس رخف شففشذاثي.Ⱥn ɐɔɔønnʇ ʍᴉʇɥ ǝɯɐᴉl {email} ǝxᴉsʇs bnʇ ʇɥǝ dɹøʌᴉdǝd nsǝɹnɐɯǝ {username} ᴉs dᴉɟɟǝɹǝnʇ. Ɇnɹøllᴉnƃ ɐnʎʍɐʎ ʍᴉʇɥ {email}.

source: Username {user} already exists.
rtl: عسثقرشوث {user} شمقثشيغ ثطهسفس.

source: Error '{error}' while sending email to new user (user email={email}). Without the email student would not be able to login. Please contact support for further information.
rtl: ثققخق '{error}' صاهمث سثريهرل ثوشهم فخ رثص عسثق (عسثق ثوشهم={email}). صهفاخعف فاث ثوشهم سفعيثرف صخعمي رخف زث شزمث فخ مخلهر. حمثشسث ذخرفشذف سعححخقف بخق بعقفاثق هربخقوشفهخر.Ɇɹɹøɹ '{error}' ʍɥᴉlǝ sǝndᴉnƃ ǝɯɐᴉl ʇø nǝʍ nsǝɹ (nsǝɹ ǝɯɐᴉl={email}). Wᴉʇɥønʇ ʇɥǝ ǝɯɐᴉl sʇndǝnʇ ʍønld nøʇ bǝ ɐblǝ ʇø løƃᴉn. Ᵽlǝɐsǝ ɔønʇɐɔʇ snddøɹʇ ɟøɹ ɟnɹʇɥǝɹ ᴉnɟøɹɯɐʇᴉøn.

source: A usage key location for a section or a problem. If the location is a block that contains other blocks, (such as the course, section, subsection, or unit blocks) then all blocks under that block will be included in the report.
rtl: ش عسشلث نثغ مخذشفهخر بخق ش سثذفهخر خق ش حقخزمثو. هب فاث مخذشفهخر هس ش زمخذن فاشف ذخرفشهرس خفاثق زمخذنس, (سعذا شس فاث ذخعقسث, سثذفهخر, سعزسثذفهخر, خق عرهف زمخذنس) فاثر شمم زمخذنس عريثق فاشف زمخذن صهمم زث هرذمعيثي هر فاث قثحخقف.

source: A list of usage keys for the blocks to include in the report.
rtl: ش مهسف خب عسشلث نثغس بخق فاث زمخذنس فخ هرذمعيث هر فاث قثحخقف. Ⱥ nsɐƃǝ ʞǝʎ løɔɐʇᴉøn ɟøɹ ɐ sǝɔʇᴉøn øɹ ɐ dɹøblǝɯ. Ɨɟ ʇɥǝ løɔɐʇᴉøn ᴉs ɐ bløɔʞ ʇɥɐʇ ɔønʇɐᴉns øʇɥǝɹ bløɔʞs, (snɔɥ ɐs ʇɥǝ ɔønɹsǝ, sǝɔʇᴉøn, snbsǝɔʇᴉøn, øɹ nnᴉʇ bløɔʞs) ʇɥǝn ɐll bløɔʞs nndǝɹ ʇɥɐʇ bløɔʞ ʍᴉll bǝ ᴉnɔlndǝd ᴉn ʇɥǝ ɹǝdøɹʇ.

source: A list of problem/block types to generate the report for. This field can be omitted if the report should include details of allblock types.
rtl: ش مهسف خب حقخزمثو/زمخذن فغحثس فخ لثرثقشفث فاث قثحخقف بخق. فاهس بهثمي ذشر زث خوهففثي هب فاث قثحخقف ساخعمي هرذمعيث يثفشهمس خب شممزمخذن فغحثس.

source: User-friendly text describing current status of report generation.
rtl: عسثق-بقهثريمغ فثطف يثسذقهزهرل ذعققثرف سفشفعس خب قثحخقف لثرثقشفهخر.Ⱥ lᴉsʇ øɟ dɹøblǝɯ/bløɔʞ ʇʎdǝs ʇø ƃǝnǝɹɐʇǝ ʇɥǝ ɹǝdøɹʇ ɟøɹ. Ŧɥᴉs ɟᴉǝld ɔɐn bǝ øɯᴉʇʇǝd ᴉɟ ʇɥǝ ɹǝdøɹʇ sɥønld ᴉnɔlndǝ dǝʇɐᴉls øɟ ɐllbløɔʞ ʇʎdǝs.

source: A unique id for the report generation task. It can be used to query the latest report generation status.
rtl: ش عرهضعث هي بخق فاث قثحخقف لثرثقشفهخر فشسن. هف ذشر زث عسثي فخ ضعثقغ فاث مشفثسف قثحخقف لثرثقشفهخر سفشفعس.Ⱥ nnᴉbnǝ ᴉd ɟøɹ ʇɥǝ ɹǝdøɹʇ ƃǝnǝɹɐʇᴉøn ʇɐsʞ. Ɨʇ ɔɐn bǝ nsǝd ʇø bnǝɹʎ ʇɥǝ lɐʇǝsʇ ɹǝdøɹʇ ƃǝnǝɹɐʇᴉøn sʇɐʇns.

source: The provided parameters were invalid. Make sure you've provided at least one valid usage key for `problem_locations`.
rtl: فاث حقخدهيثي حشقشوثفثقس صثقث هردشمهي. وشنث سعقث غخع'دث حقخدهيثي شف مثشسف خرث دشمهي عسشلث نثغ بخق `حقخزمثو_مخذشفهخرس`.

source: The requesting user is not authenticated.
rtl: فاث قثضعثسفهرل عسثق هس رخف شعفاثرفهذشفثي.

source: The requesting user lacks access to the course.
rtl: فاث قثضعثسفهرل عسثق مشذنس شذذثسس فخ فاث ذخعقسث.Ŧɥǝ dɹøʌᴉdǝd dɐɹɐɯǝʇǝɹs ʍǝɹǝ ᴉnʌɐlᴉd. Mɐʞǝ snɹǝ ʎøn'ʌǝ dɹøʌᴉdǝd ɐʇ lǝɐsʇ ønǝ ʌɐlᴉd nsɐƃǝ ʞǝʎ ɟøɹ `dɹøblǝɯ_løɔɐʇᴉøns`.

source: problem responses
rtl: حقخزمثو قثسحخرسثس

source: Could not find problem with this location.
rtl: ذخعمي رخف بهري حقخزمثو صهفا فاهس مخذشفهخر.

source: CourseID
rtl: ذخعقسثهي

source: Certificate Type
rtl: ذثقفهبهذشفث فغحث

source: Total Certificates Issued
rtl: فخفشم ذثقفهبهذشفثس هسسعثي

source: Date Report Run
rtl: يشفث قثحخقف قعر

source: enrolled learner profile
rtl: ثرقخممثي مثشقرثق حقخبهمث

source: User ID
rtl: عسثق هي

source: Username
rtl: عسثقرشوث

source: Email
rtl: ثوشهم

source: Language
rtl: مشرلعشلث

source: Location
rtl: مخذشفهخر

source: Birth Year
rtl: زهقفا غثشق

source: Gender
rtl: لثريثق

source: Level of Education
rtl: مثدثم خب ثيعذشفهخر

source: Mailing Address
rtl: وشهمهرل شييقثسس

source: Goals
rtl: لخشمس

source: Enrollment Mode
rtl: ثرقخمموثرف وخيث

source: Verification Status
rtl: دثقهبهذشفهخر سفشفعس

source: Last Login
rtl: مشسف مخلهر

source: Date Joined
rtl: يشفث تخهرثي

source: External User Key
rtl: ثطفثقرشم عسثق نثغ

source: Cohort
rtl: ذخاخقف

source: Team
rtl: فثشو

source: City
rtl: ذهفغ

source: Country
rtl: ذخعرفقغ

source: enrollment
rtl: ثرقخمموثرف

source: The file must contain a 'cohort' column containing cohort names.
rtl: فاث بهمث وعسف ذخرفشهر ش 'ذخاخقف' ذخمعور ذخرفشهرهرل ذخاخقف رشوثس.

source: The file must contain a 'username' column, an 'email' column, or both.
rtl: فاث بهمث وعسف ذخرفشهر ش 'عسثقرشوث' ذخمعور, شر 'ثوشهم' ذخمعور, خق زخفا.Ŧɥǝ ɟᴉlǝ ɯnsʇ ɔønʇɐᴉn ɐ 'nsǝɹnɐɯǝ' ɔølnɯn, ɐn 'ǝɯɐᴉl' ɔølnɯn, øɹ bøʇɥ.

source: survey
rtl: سعقدثغ

source: proctored exam results
rtl: حقخذفخقثي ثطشو قثسعمفس

source: Anonymized User IDs
rtl: شرخرغوهظثي عسثق هيس

source: Enrollment status for {student}: unknown
rtl: ثرقخمموثرف سفشفعس بخق {student}: عرنرخصر

source: Enrollment status for {student}: active
rtl: ثرقخمموثرف سفشفعس بخق {student}: شذفهدث

source: Enrollment status for {student}: inactive
rtl: ثرقخمموثرف سفشفعس بخق {student}: هرشذفهدث

source: Enrollment status for {student}: pending
rtl: ثرقخمموثرف سفشفعس بخق {student}: حثريهرل

source: Enrollment status for {student}: never enrolled
rtl: ثرقخمموثرف سفشفعس بخق {student}: رثدثق ثرقخممثي

source: Module does not exist.
rtl: وخيعمث يخثس رخف ثطهسف.

source: An error occurred while deleting the score.
rtl: شر ثققخق خذذعققثي صاهمث يثمثفهرل فاث سذخقث.

source: Course has no entrance exam section.
rtl: ذخعقسث اشس رخ ثرفقشرذث ثطشو سثذفهخر.

source: all_students and unique_student_identifier are mutually exclusive.
rtl: شمم_سفعيثرفس شري عرهضعث_سفعيثرف_هيثرفهبهثق شقث وعفعشممغ ثطذمعسهدث.

source: all_students and delete_module are mutually exclusive.
rtl: شمم_سفعيثرفس شري يثمثفث_وخيعمث شقث وعفعشممغ ثطذمعسهدث.

source: Requires instructor access.
rtl: قثضعهقثس هرسفقعذفخق شذذثسس.

source: Course has no valid entrance exam section.
rtl: ذخعقسث اشس رخ دشمهي ثرفقشرذث ثطشو سثذفهخر.

source: All Students
rtl: شمم سفعيثرفس

source: Cannot rescore with all_students and unique_student_identifier.
rtl: ذشررخف قثسذخقث صهفا شمم_سفعيثرفس شري عرهضعث_سفعيثرف_هيثرفهبهثق.

source: Current status of task.
rtl: ذعققثرف سفشفعس خب فشسن.

source: Identifies the kind of task being performed, e.g. rescoring.
rtl: هيثرفهبهثس فاث نهري خب فشسن زثهرل حثقبخقوثي, ث.ل. قثسذخقهرل.

source: The celery ID for the task.
rtl: فاث ذثمثقغ هي بخق فاث فشسن.

source: The date and time when the task was created.
rtl: فاث يشفث شري فهوث صاثر فاث فشسن صشس ذقثشفثي.

source: The input parameters for the task. The format and content of this data will depend on the kind of task being performed. For instanceit may contain the problem locations for a problem resources task.
rtl: فاث هرحعف حشقشوثفثقس بخق فاث فشسن. فاث بخقوشف شري ذخرفثرف خب فاهس يشفش صهمم يثحثري خر فاث نهري خب فشسن زثهرل حثقبخقوثي. بخق هرسفشرذثهف وشغ ذخرفشهر فاث حقخزمثو مخذشفهخرس بخق ش حقخزمثو قثسخعقذثس فشسن.

source: The username of the user who initiated this task.
rtl: فاث عسثقرشوث خب فاث عسثق صاخ هرهفهشفثي فاهس فشسن.

source: The last knows state of the celery task.
rtl: فاث مشسف نرخصس سفشفث خب فاث ذثمثقغ فشسن.

source: Task duration information, if known
rtl: فشسن يعقشفهخر هربخقوشفهخر, هب نرخصر

source: User-friendly task status information, if available.
rtl: عسثق-بقهثريمغ فشسن سفشفعس هربخقوشفهخر, هب شدشهمشزمث.

source: List of instructor tasks.
rtl: مهسف خب هرسفقعذفخق فشسنس.

source: The requested course does not exist.
rtl: فاث قثضعثسفثي ذخعقسث يخثس رخف ثطهسف.

source: URL from which report can be downloaded.
rtl: عقم بقخو صاهذا قثحخقف ذشر زث يخصرمخشيثي.

source: Name of report.
rtl: رشوث خب قثحخقف.

source: HTML anchor tag that contains the name and link.
rtl: افوم شرذاخق فشل فاشف ذخرفشهرس فاث رشوث شري مهرن.

source: List of report downloads
rtl: مهسف خب قثحخقف يخصرمخشيس

source: ID for the course whose reports need to be listed.
rtl: هي بخق فاث ذخعقسث صاخسث قثحخقفس رثثي فخ زث مهسفثي.Ŧɥǝ ᴉndnʇ dɐɹɐɯǝʇǝɹs ɟøɹ ʇɥǝ ʇɐsʞ. Ŧɥǝ ɟøɹɯɐʇ ɐnd ɔønʇǝnʇ øɟ ʇɥᴉs dɐʇɐ ʍᴉll dǝdǝnd øn ʇɥǝ ʞᴉnd øɟ ʇɐsʞ bǝᴉnƃ dǝɹɟøɹɯǝd. Føɹ ᴉnsʇɐnɔǝᴉʇ ɯɐʎ ɔønʇɐᴉn ʇɥǝ dɹøblǝɯ løɔɐʇᴉøns ɟøɹ ɐ dɹøblǝɯ ɹǝsønɹɔǝs ʇɐsʞ.

source: Filter results to only return details of for the report with the specified name.
rtl: بهمفثق قثسعمفس فخ خرمغ قثفعقر يثفشهمس خب بخق فاث قثحخقف صهفا فاث سحثذهبهثي رشوث.Fᴉlʇǝɹ ɹǝsnlʇs ʇø ønlʎ ɹǝʇnɹn dǝʇɐᴉls øɟ ɟøɹ ʇɥǝ ɹǝdøɹʇ ʍᴉʇɥ ʇɥǝ sdǝɔᴉɟᴉǝd nɐɯǝ.

source: ORA data
rtl: خقش يشفش

source: ORA summary
rtl: خقش سعووشقغ

source: Attachments archive is being created.
rtl: شففشذاوثرفس شقذاهدث هس زثهرل ذقثشفثي.

source: grade
rtl: لقشيث

source: problem grade
rtl: حقخزمثو لقشيث

source: Successfully changed due date for student {0} for {1} to {2}
rtl: سعذذثسسبعممغ ذاشرلثي يعث يشفث بخق سفعيثرف {0} بخق {1} فخ {2}

source: Successfully removed invalid due date extension (unit has no due date).
rtl: سعذذثسسبعممغ قثوخدثي هردشمهي يعث يشفث ثطفثرسهخر (عرهف اشس رخ يعث يشفث).Snɔɔǝssɟnllʎ ɹǝɯøʌǝd ᴉnʌɐlᴉd dnǝ dɐʇǝ ǝxʇǝnsᴉøn (nnᴉʇ ɥɐs nø dnǝ dɐʇǝ).

source: Successfully reset due date for student {0} for {1} to {2}
rtl: سعذذثسسبعممغ قثسثف يعث يشفث بخق سفعيثرف {0} بخق {1} فخ {2}

source: This student (%s) will skip the entrance exam.
rtl: فاهس سفعيثرف (%s) صهمم سنهح فاث ثرفقشرذث ثطشو.

source: This student (%s) is already allowed to skip the entrance exam.
rtl: فاهس سفعيثرف (%s) هس شمقثشيغ شممخصثي فخ سنهح فاث ثرفقشرذث ثطشو.

source: Certificate generation task for all students of this course has been started. You can view the status of the generation task in the "Pending Tasks" section.
rtl: ذثقفهبهذشفث لثرثقشفهخر فشسن بخق شمم سفعيثرفس خب فاهس ذخعقسث اشس زثثر سفشقفثي. غخع ذشر دهثص فاث سفشفعس خب فاث لثرثقشفهخر فشسن هر فاث "حثريهرل فشسنس" سثذفهخر.Ȼǝɹʇᴉɟᴉɔɐʇǝ ƃǝnǝɹɐʇᴉøn ʇɐsʞ ɟøɹ ɐll sʇndǝnʇs øɟ ʇɥᴉs ɔønɹsǝ ɥɐs bǝǝn sʇɐɹʇǝd. Ɏøn ɔɐn ʌᴉǝʍ ʇɥǝ sʇɐʇns øɟ ʇɥǝ ƃǝnǝɹɐʇᴉøn ʇɐsʞ ᴉn ʇɥǝ "Ᵽǝndᴉnƃ Ŧɐsʞs" sǝɔʇᴉøn.

source: Please select one or more certificate statuses that require certificate regeneration.
rtl: حمثشسث سثمثذف خرث خق وخقث ذثقفهبهذشفث سفشفعسثس فاشف قثضعهقث ذثقفهبهذشفث قثلثرثقشفهخر.

source: Please select certificate statuses from the list only.
rtl: حمثشسث سثمثذف ذثقفهبهذشفث سفشفعسثس بقخو فاث مهسف خرمغ.Ᵽlǝɐsǝ sǝlǝɔʇ ønǝ øɹ ɯøɹǝ ɔǝɹʇᴉɟᴉɔɐʇǝ sʇɐʇnsǝs ʇɥɐʇ ɹǝbnᴉɹǝ ɔǝɹʇᴉɟᴉɔɐʇǝ ɹǝƃǝnǝɹɐʇᴉøn.

source: Certificate regeneration task has been started. You can view the status of the generation task in the "Pending Tasks" section.
rtl: ذثقفهبهذشفث قثلثرثقشفهخر فشسن اشس زثثر سفشقفثي. غخع ذشر دهثص فاث سفشفعس خب فاث لثرثقشفهخر فشسن هر فاث "حثريهرل فشسنس" سثذفهخر.Ȼǝɹʇᴉɟᴉɔɐʇǝ ɹǝƃǝnǝɹɐʇᴉøn ʇɐsʞ ɥɐs bǝǝn sʇɐɹʇǝd. Ɏøn ɔɐn ʌᴉǝʍ ʇɥǝ sʇɐʇns øɟ ʇɥǝ ƃǝnǝɹɐʇᴉøn ʇɐsʞ ᴉn ʇɥǝ "Ᵽǝndᴉnƃ Ŧɐsʞs" sǝɔʇᴉøn.
