Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: This will then trigger an automatic update of the main LMS site and update the contents of your course visible there to students if automatic git imports are configured.
rtl: فاهس صهمم فاثر فقهللثق شر شعفخوشفهذ عحيشفث خب فاث وشهر موس سهفث شري عحيشفث فاث ذخرفثرفس خب غخعق ذخعقسث دهسهزمث فاثقث فخ سفعيثرفس هب شعفخوشفهذ لهف هوحخقفس شقث ذخربهلعقثي.

source: Export Course to Git:
rtl: ثطحخقف ذخعقسث فخ لهف:Ŧɥᴉs ʍᴉll ʇɥǝn ʇɹᴉƃƃǝɹ ɐn ɐnʇøɯɐʇᴉɔ nddɐʇǝ øɟ ʇɥǝ ɯɐᴉn ŁMS sᴉʇǝ ɐnd nddɐʇǝ ʇɥǝ ɔønʇǝnʇs øɟ ʎønɹ ɔønɹsǝ ʌᴉsᴉblǝ ʇɥǝɹǝ ʇø sʇndǝnʇs ᴉɟ ɐnʇøɯɐʇᴉɔ ƃᴉʇ ᴉɯdøɹʇs ɐɹǝ ɔønɟᴉƃnɹǝd.

source: giturl must be defined in your course settings before you can export to git.
rtl: لهفعقم وعسف زث يثبهرثي هر غخعق ذخعقسث سثففهرلس زثبخقث غخع ذشر ثطحخقف فخ لهف.

source: Export Failed
rtl: ثطحخقف بشهمثي

source: Export Succeeded
rtl: ثطحخقف سعذذثثيثي

source: Your course:
rtl: غخعق ذخعقسث:

source: Course git url:
rtl: ذخعقسث لهف عقم:

source: Experiment Group Configurations
rtl: ثطحثقهوثرف لقخعح ذخربهلعقشفهخرس

source: This module is disabled at the moment.
rtl: فاهس وخيعمث هس يهسشزمثي شف فاث وخوثرف.ƃᴉʇnɹl ɯnsʇ bǝ dǝɟᴉnǝd ᴉn ʎønɹ ɔønɹsǝ sǝʇʇᴉnƃs bǝɟøɹǝ ʎøn ɔɐn ǝxdøɹʇ ʇø ƃᴉʇ.

source: Enrollment track groups allow you to offer different course content to learners in each enrollment track. Learners enrolled in each enrollment track in your course are automatically included in the corresponding enrollment track group.
rtl: ثرقخمموثرف فقشذن لقخعحس شممخص غخع فخ خببثق يهببثقثرف ذخعقسث ذخرفثرف فخ مثشقرثقس هر ثشذا ثرقخمموثرف فقشذن. مثشقرثقس ثرقخممثي هر ثشذا ثرقخمموثرف فقشذن هر غخعق ذخعقسث شقث شعفخوشفهذشممغ هرذمعيثي هر فاث ذخققثسحخريهرل ثرقخمموثرف فقشذن لقخعح.Ɇnɹøllɯǝnʇ ʇɹɐɔʞ ƃɹønds ɐlløʍ ʎøn ʇø øɟɟǝɹ dᴉɟɟǝɹǝnʇ ɔønɹsǝ ɔønʇǝnʇ ʇø lǝɐɹnǝɹs ᴉn ǝɐɔɥ ǝnɹøllɯǝnʇ ʇɹɐɔʞ. Łǝɐɹnǝɹs ǝnɹøllǝd ᴉn ǝɐɔɥ ǝnɹøllɯǝnʇ ʇɹɐɔʞ ᴉn ʎønɹ ɔønɹsǝ ɐɹǝ ɐnʇøɯɐʇᴉɔɐllʎ ᴉnɔlndǝd ᴉn ʇɥǝ ɔøɹɹǝsdøndᴉnƃ ǝnɹøllɯǝnʇ ʇɹɐɔʞ ƃɹønd.

source: On unit pages in the course outline, you can restrict access to components to learners based on their enrollment track.
rtl: خر عرهف حشلثس هر فاث ذخعقسث خعفمهرث, غخع ذشر قثسفقهذف شذذثسس فخ ذخوحخرثرفس فخ مثشقرثقس زشسثي خر فاثهق ثرقخمموثرف فقشذن.Øn nnᴉʇ dɐƃǝs ᴉn ʇɥǝ ɔønɹsǝ ønʇlᴉnǝ, ʎøn ɔɐn ɹǝsʇɹᴉɔʇ ɐɔɔǝss ʇø ɔøɯdønǝnʇs ʇø lǝɐɹnǝɹs bɐsǝd øn ʇɥǝᴉɹ ǝnɹøllɯǝnʇ ʇɹɐɔʞ.

source: You cannot edit enrollment track groups, but you can expand each group to view details of the course content that is designated for learners in the group.
rtl: غخع ذشررخف ثيهف ثرقخمموثرف فقشذن لقخعحس, زعف غخع ذشر ثطحشري ثشذا لقخعح فخ دهثص يثفشهمس خب فاث ذخعقسث ذخرفثرف فاشف هس يثسهلرشفثي بخق مثشقرثقس هر فاث لقخعح.Ɏøn ɔɐnnøʇ ǝdᴉʇ ǝnɹøllɯǝnʇ ʇɹɐɔʞ ƃɹønds, bnʇ ʎøn ɔɐn ǝxdɐnd ǝɐɔɥ ƃɹønd ʇø ʌᴉǝʍ dǝʇɐᴉls øɟ ʇɥǝ ɔønɹsǝ ɔønʇǝnʇ ʇɥɐʇ ᴉs dǝsᴉƃnɐʇǝd ɟøɹ lǝɐɹnǝɹs ᴉn ʇɥǝ ƃɹønd.

source: If you have cohorts enabled in your course, you can use content groups to create cohort-specific courseware. In other words, you can customize the content that particular cohorts see in your course.
rtl: هب غخع اشدث ذخاخقفس ثرشزمثي هر غخعق ذخعقسث, غخع ذشر عسث ذخرفثرف لقخعحس فخ ذقثشفث ذخاخقف-سحثذهبهذ ذخعقسثصشقث. هر خفاثق صخقيس, غخع ذشر ذعسفخوهظث فاث ذخرفثرف فاشف حشقفهذعمشق ذخاخقفس سثث هر غخعق ذخعقسث.Ɨɟ ʎøn ɥɐʌǝ ɔøɥøɹʇs ǝnɐblǝd ᴉn ʎønɹ ɔønɹsǝ, ʎøn ɔɐn nsǝ ɔønʇǝnʇ ƃɹønds ʇø ɔɹǝɐʇǝ ɔøɥøɹʇ-sdǝɔᴉɟᴉɔ ɔønɹsǝʍɐɹǝ. Ɨn øʇɥǝɹ ʍøɹds, ʎøn ɔɐn ɔnsʇøɯᴉzǝ ʇɥǝ ɔønʇǝnʇ ʇɥɐʇ dɐɹʇᴉɔnlɐɹ ɔøɥøɹʇs sǝǝ ᴉn ʎønɹ ɔønɹsǝ.

source: Each content group that you create can be associated with one or more cohorts. In addition to making course content available to all learners, you can restrict access to some content to learners in specific content groups. Only learners in the cohorts that are associated with the specified content groups see the additional content.
rtl: ثشذا ذخرفثرف لقخعح فاشف غخع ذقثشفث ذشر زث شسسخذهشفثي صهفا خرث خق وخقث ذخاخقفس. هر شييهفهخر فخ وشنهرل ذخعقسث ذخرفثرف شدشهمشزمث فخ شمم مثشقرثقس, غخع ذشر قثسفقهذف شذذثسس فخ سخوث ذخرفثرف فخ مثشقرثقس هر سحثذهبهذ ذخرفثرف لقخعحس. خرمغ مثشقرثقس هر فاث ذخاخقفس فاشف شقث شسسخذهشفثي صهفا فاث سحثذهبهثي ذخرفثرف لقخعحس سثث فاث شييهفهخرشم ذخرفثرف.Ɇɐɔɥ ɔønʇǝnʇ ƃɹønd ʇɥɐʇ ʎøn ɔɹǝɐʇǝ ɔɐn bǝ ɐssøɔᴉɐʇǝd ʍᴉʇɥ ønǝ øɹ ɯøɹǝ ɔøɥøɹʇs. Ɨn ɐddᴉʇᴉøn ʇø ɯɐʞᴉnƃ ɔønɹsǝ ɔønʇǝnʇ ɐʌɐᴉlɐblǝ ʇø ɐll lǝɐɹnǝɹs, ʎøn ɔɐn ɹǝsʇɹᴉɔʇ ɐɔɔǝss ʇø søɯǝ ɔønʇǝnʇ ʇø lǝɐɹnǝɹs ᴉn sdǝɔᴉɟᴉɔ ɔønʇǝnʇ ƃɹønds. Ønlʎ lǝɐɹnǝɹs ᴉn ʇɥǝ ɔøɥøɹʇs ʇɥɐʇ ɐɹǝ ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʇɥǝ sdǝɔᴉɟᴉǝd ɔønʇǝnʇ ƃɹønds sǝǝ ʇɥǝ ɐddᴉʇᴉønɐl ɔønʇǝnʇ.

source: Click {em_start}New content group{em_end} to add a new content group. To edit the name of a content group, hover over its box and click {em_start}Edit{em_end}. You can delete a content group only if it is not in use by a unit. To delete a content group, hover over its box and click the delete icon.
rtl: ذمهذن {em_start}رثص ذخرفثرف لقخعح{em_end} فخ شيي ش رثص ذخرفثرف لقخعح. فخ ثيهف فاث رشوث خب ش ذخرفثرف لقخعح, اخدثق خدثق هفس زخط شري ذمهذن {em_start}ثيهف{em_end}. غخع ذشر يثمثفث ش ذخرفثرف لقخعح خرمغ هب هف هس رخف هر عسث زغ ش عرهف. فخ يثمثفث ش ذخرفثرف لقخعح, اخدثق خدثق هفس زخط شري ذمهذن فاث يثمثفث هذخر.Ȼlᴉɔʞ {em_start}Nǝʍ ɔønʇǝnʇ ƃɹønd{em_end} ʇø ɐdd ɐ nǝʍ ɔønʇǝnʇ ƃɹønd. Ŧø ǝdᴉʇ ʇɥǝ nɐɯǝ øɟ ɐ ɔønʇǝnʇ ƃɹønd, ɥøʌǝɹ øʌǝɹ ᴉʇs bøx ɐnd ɔlᴉɔʞ {em_start}Ɇdᴉʇ{em_end}. Ɏøn ɔɐn dǝlǝʇǝ ɐ ɔønʇǝnʇ ƃɹønd ønlʎ ᴉɟ ᴉʇ ᴉs nøʇ ᴉn nsǝ bʎ ɐ nnᴉʇ. Ŧø dǝlǝʇǝ ɐ ɔønʇǝnʇ ƃɹønd, ɥøʌǝɹ øʌǝɹ ᴉʇs bøx ɐnd ɔlᴉɔʞ ʇɥǝ dǝlǝʇǝ ᴉɔøn.

source: Use experiment group configurations if you are conducting content experiments, also known as A/B testing, in your course. Experiment group configurations define how many groups of learners are in a content experiment. When you create a content experiment for a course, you select the group configuration to use.
rtl: عسث ثطحثقهوثرف لقخعح ذخربهلعقشفهخرس هب غخع شقث ذخريعذفهرل ذخرفثرف ثطحثقهوثرفس, شمسخ نرخصر شس ش/ز فثسفهرل, هر غخعق ذخعقسث. ثطحثقهوثرف لقخعح ذخربهلعقشفهخرس يثبهرث اخص وشرغ لقخعحس خب مثشقرثقس شقث هر ش ذخرفثرف ثطحثقهوثرف. صاثر غخع ذقثشفث ش ذخرفثرف ثطحثقهوثرف بخق ش ذخعقسث, غخع سثمثذف فاث لقخعح ذخربهلعقشفهخر فخ عسث.Ʉsǝ ǝxdǝɹᴉɯǝnʇ ƃɹønd ɔønɟᴉƃnɹɐʇᴉøns ᴉɟ ʎøn ɐɹǝ ɔøndnɔʇᴉnƃ ɔønʇǝnʇ ǝxdǝɹᴉɯǝnʇs, ɐlsø ʞnøʍn ɐs Ⱥ/Ƀ ʇǝsʇᴉnƃ, ᴉn ʎønɹ ɔønɹsǝ. Ɇxdǝɹᴉɯǝnʇ ƃɹønd ɔønɟᴉƃnɹɐʇᴉøns dǝɟᴉnǝ ɥøʍ ɯɐnʎ ƃɹønds øɟ lǝɐɹnǝɹs ɐɹǝ ᴉn ɐ ɔønʇǝnʇ ǝxdǝɹᴉɯǝnʇ. Wɥǝn ʎøn ɔɹǝɐʇǝ ɐ ɔønʇǝnʇ ǝxdǝɹᴉɯǝnʇ ɟøɹ ɐ ɔønɹsǝ, ʎøn sǝlǝɔʇ ʇɥǝ ƃɹønd ɔønɟᴉƃnɹɐʇᴉøn ʇø nsǝ.

source: Click {em_start}New Group Configuration{em_end} to add a new configuration. To edit a configuration, hover over its box and click {em_start}Edit{em_end}. You can delete a group configuration only if it is not in use in an experiment. To delete a configuration, hover over its box and click the delete icon.
rtl: ذمهذن {em_start}رثص لقخعح ذخربهلعقشفهخر{em_end} فخ شيي ش رثص ذخربهلعقشفهخر. فخ ثيهف ش ذخربهلعقشفهخر, اخدثق خدثق هفس زخط شري ذمهذن {em_start}ثيهف{em_end}. غخع ذشر يثمثفث ش لقخعح ذخربهلعقشفهخر خرمغ هب هف هس رخف هر عسث هر شر ثطحثقهوثرف. فخ يثمثفث ش ذخربهلعقشفهخر, اخدثق خدثق هفس زخط شري ذمهذن فاث يثمثفث هذخر.

source: Welcome
rtl: صثمذخوث

source: Welcome to {studio_name}
rtl: صثمذخوث فخ {studio_name}Ȼlᴉɔʞ {em_start}Nǝʍ Ǥɹønd Ȼønɟᴉƃnɹɐʇᴉøn{em_end} ʇø ɐdd ɐ nǝʍ ɔønɟᴉƃnɹɐʇᴉøn. Ŧø ǝdᴉʇ ɐ ɔønɟᴉƃnɹɐʇᴉøn, ɥøʌǝɹ øʌǝɹ ᴉʇs bøx ɐnd ɔlᴉɔʞ {em_start}Ɇdᴉʇ{em_end}. Ɏøn ɔɐn dǝlǝʇǝ ɐ ƃɹønd ɔønɟᴉƃnɹɐʇᴉøn ønlʎ ᴉɟ ᴉʇ ᴉs nøʇ ᴉn nsǝ ᴉn ɐn ǝxdǝɹᴉɯǝnʇ. Ŧø dǝlǝʇǝ ɐ ɔønɟᴉƃnɹɐʇᴉøn, ɥøʌǝɹ øʌǝɹ ᴉʇs bøx ɐnd ɔlᴉɔʞ ʇɥǝ dǝlǝʇǝ ᴉɔøn.

source: {studio_name} helps manage your online courses, so you can focus on teaching them
rtl: {studio_name} اثمحس وشرشلث غخعق خرمهرث ذخعقسثس, سخ غخع ذشر بخذعس خر فثشذاهرل فاثو

source: {studio_name}'s Many Features
rtl: {studio_name}'س وشرغ بثشفعقثس

source: {studio_name} Helps You Keep Your Courses Organized
rtl: {studio_name} اثمحس غخع نثثح غخعق ذخعقسثس خقلشرهظثي

source: Enlarge image
rtl: ثرمشقلث هوشلث

source: Keeping Your Course Organized
rtl: نثثحهرل غخعق ذخعقسث خقلشرهظثي{studio_name} ɥǝlds ɯɐnɐƃǝ ʎønɹ ønlᴉnǝ ɔønɹsǝs, sø ʎøn ɔɐn ɟøɔns øn ʇǝɐɔɥᴉnƃ ʇɥǝɯ

source: The backbone of your course is how it is organized. {studio_name} offers an {strong_start}Outline{strong_end} editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
rtl: فاث زشذنزخرث خب غخعق ذخعقسث هس اخص هف هس خقلشرهظثي. {studio_name} خببثقس شر {strong_start}خعفمهرث{strong_end} ثيهفخق, حقخدهيهرل ش سهوحمث اهثقشقذاغ شري ثشسغ يقشل شري يقخح فخ اثمح غخع شري غخعق سفعيثرفس سفشغ خقلشرهظثي.

source: Simple Organization For Content
rtl: سهوحمث خقلشرهظشفهخر بخق ذخرفثرفŦɥǝ bɐɔʞbønǝ øɟ ʎønɹ ɔønɹsǝ ᴉs ɥøʍ ᴉʇ ᴉs øɹƃɐnᴉzǝd. {studio_name} øɟɟǝɹs ɐn {strong_start}Ønʇlᴉnǝ{strong_end} ǝdᴉʇøɹ, dɹøʌᴉdᴉnƃ ɐ sᴉɯdlǝ ɥᴉǝɹɐɹɔɥʎ ɐnd ǝɐsʎ dɹɐƃ ɐnd dɹød ʇø ɥǝld ʎøn ɐnd ʎønɹ sʇndǝnʇs sʇɐʎ øɹƃɐnᴉzǝd.

source: {studio_name} uses a simple hierarchy of {strong_start}sections{strong_end} and {strong_start}subsections{strong_end} to organize your content.
rtl: {studio_name} عسثس ش سهوحمث اهثقشقذاغ خب {strong_start}سثذفهخرس{strong_end} شري {strong_start}سعزسثذفهخرس{strong_end} فخ خقلشرهظث غخعق ذخرفثرف.

source: Change Your Mind Anytime
rtl: ذاشرلث غخعق وهري شرغفهوث{studio_name} nsǝs ɐ sᴉɯdlǝ ɥᴉǝɹɐɹɔɥʎ øɟ {strong_start}sǝɔʇᴉøns{strong_end} ɐnd {strong_start}snbsǝɔʇᴉøns{strong_end} ʇø øɹƃɐnᴉzǝ ʎønɹ ɔønʇǝnʇ.

source: Draft your outline and build content anywhere. Simple drag and drop tools let you reorganize quickly.
rtl: يقشبف غخعق خعفمهرث شري زعهمي ذخرفثرف شرغصاثقث. سهوحمث يقشل شري يقخح فخخمس مثف غخع قثخقلشرهظث ضعهذنمغ.

source: Go A Week Or A Semester At A Time
rtl: لخ ش صثثن خق ش سثوثسفثق شف ش فهوثĐɹɐɟʇ ʎønɹ ønʇlᴉnǝ ɐnd bnᴉld ɔønʇǝnʇ ɐnʎʍɥǝɹǝ. Sᴉɯdlǝ dɹɐƃ ɐnd dɹød ʇøøls lǝʇ ʎøn ɹǝøɹƃɐnᴉzǝ bnᴉɔʞlʎ.

source: Build and release {strong_start}sections{strong_end} to your students incrementally. You don't have to have it all done at once.
rtl: زعهمي شري قثمثشسث {strong_start}سثذفهخرس{strong_end} فخ غخعق سفعيثرفس هرذقثوثرفشممغ. غخع يخر'ف اشدث فخ اشدث هف شمم يخرث شف خرذث.

source: Learning is More than Just Lectures
rtl: مثشقرهرل هس وخقث فاشر تعسف مثذفعقثسɃnᴉld ɐnd ɹǝlǝɐsǝ {strong_start}sǝɔʇᴉøns{strong_end} ʇø ʎønɹ sʇndǝnʇs ᴉnɔɹǝɯǝnʇɐllʎ. Ɏøn døn'ʇ ɥɐʌǝ ʇø ɥɐʌǝ ᴉʇ ɐll dønǝ ɐʇ ønɔǝ.

source: {studio_name} lets you weave your content together in a way that reinforces learning. Insert videos, discussions, and a wide variety of exercises with just a few clicks.
rtl: {studio_name} مثفس غخع صثشدث غخعق ذخرفثرف فخلثفاثق هر ش صشغ فاشف قثهربخقذثس مثشقرهرل. هرسثقف دهيثخس, يهسذعسسهخرس, شري ش صهيث دشقهثفغ خب ثطثقذهسثس صهفا تعسف ش بثص ذمهذنس.

source: Create Learning Pathways
rtl: ذقثشفث مثشقرهرل حشفاصشغس{studio_name} lǝʇs ʎøn ʍǝɐʌǝ ʎønɹ ɔønʇǝnʇ ʇøƃǝʇɥǝɹ ᴉn ɐ ʍɐʎ ʇɥɐʇ ɹǝᴉnɟøɹɔǝs lǝɐɹnᴉnƃ. Ɨnsǝɹʇ ʌᴉdǝøs, dᴉsɔnssᴉøns, ɐnd ɐ ʍᴉdǝ ʌɐɹᴉǝʇʎ øɟ ǝxǝɹɔᴉsǝs ʍᴉʇɥ ɾnsʇ ɐ ɟǝʍ ɔlᴉɔʞs.

source: Help your students understand one concept at a time with multimedia, HTML, and exercises.
rtl: اثمح غخعق سفعيثرفس عريثقسفشري خرث ذخرذثحف شف ش فهوث صهفا وعمفهوثيهش, افوم, شري ثطثقذهسثس.

source: Work Visually, Organize Quickly
rtl: صخقن دهسعشممغ, خقلشرهظث ضعهذنمغĦǝld ʎønɹ sʇndǝnʇs nndǝɹsʇɐnd ønǝ ɔønɔǝdʇ ɐʇ ɐ ʇᴉɯǝ ʍᴉʇɥ ɯnlʇᴉɯǝdᴉɐ, ĦŦMŁ, ɐnd ǝxǝɹɔᴉsǝs.

source: Work visually and see exactly what your students will see. Reorganize all your content with drag and drop.
rtl: صخقن دهسعشممغ شري سثث ثطشذفمغ صاشف غخعق سفعيثرفس صهمم سثث. قثخقلشرهظث شمم غخعق ذخرفثرف صهفا يقشل شري يقخح.

source: A Broad Library of Problem Types
rtl: ش زقخشي مهزقشقغ خب حقخزمثو فغحثسWøɹʞ ʌᴉsnɐllʎ ɐnd sǝǝ ǝxɐɔʇlʎ ʍɥɐʇ ʎønɹ sʇndǝnʇs ʍᴉll sǝǝ. Ɍǝøɹƃɐnᴉzǝ ɐll ʎønɹ ɔønʇǝnʇ ʍᴉʇɥ dɹɐƃ ɐnd dɹød.

source: It's more than just multiple choice. {studio_name} supports more than a dozen types of problems to challenge your learners.
rtl: هف'س وخقث فاشر تعسف وعمفهحمث ذاخهذث. {studio_name} سعححخقفس وخقث فاشر ش يخظثر فغحثس خب حقخزمثوس فخ ذاشممثرلث غخعق مثشقرثقس.Ɨʇ's ɯøɹǝ ʇɥɐn ɾnsʇ ɯnlʇᴉdlǝ ɔɥøᴉɔǝ. {studio_name} snddøɹʇs ɯøɹǝ ʇɥɐn ɐ døzǝn ʇʎdǝs øɟ dɹøblǝɯs ʇø ɔɥɐllǝnƃǝ ʎønɹ lǝɐɹnǝɹs.

source: {studio_name} Gives You Simple, Fast, and Incremental Publishing. With Friends.
rtl: {studio_name} لهدثس غخع سهوحمث, بشسف, شري هرذقثوثرفشم حعزمهساهرل. صهفا بقهثريس.

source: Simple, Fast, and Incremental Publishing. With Friends.
rtl: سهوحمث, بشسف, شري هرذقثوثرفشم حعزمهساهرل. صهفا بقهثريس.{studio_name} Ǥᴉʌǝs Ɏøn Sᴉɯdlǝ, Fɐsʇ, ɐnd Ɨnɔɹǝɯǝnʇɐl Ᵽnblᴉsɥᴉnƃ. Wᴉʇɥ Fɹᴉǝnds.

source: {studio_name} works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
rtl: {studio_name} صخقنس مهنث صثز شححمهذشفهخرس غخع شمقثشيغ نرخص, غثف عريثقسفشريس اخص غخع زعهمي ذعققهذعمعو. هرسفشرف حعزمهساهرل فخ فاث صثز صاثر غخع صشرف هف, هرذقثوثرفشم قثمثشسث صاثر هف وشنثس سثرسث. شري صهفا ذخ-شعفاخقس, غخع ذشر اشدث ش صاخمث فثشو زعهميهرل ش ذخعقسث, فخلثفاثق.

source: Instant Changes
rtl: هرسفشرف ذاشرلثس{studio_name} ʍøɹʞs lᴉʞǝ ʍǝb ɐddlᴉɔɐʇᴉøns ʎøn ɐlɹǝɐdʎ ʞnøʍ, ʎǝʇ nndǝɹsʇɐnds ɥøʍ ʎøn bnᴉld ɔnɹɹᴉɔnlnɯ. Ɨnsʇɐnʇ dnblᴉsɥᴉnƃ ʇø ʇɥǝ ʍǝb ʍɥǝn ʎøn ʍɐnʇ ᴉʇ, ᴉnɔɹǝɯǝnʇɐl ɹǝlǝɐsǝ ʍɥǝn ᴉʇ ɯɐʞǝs sǝnsǝ. Ⱥnd ʍᴉʇɥ ɔø-ɐnʇɥøɹs, ʎøn ɔɐn ɥɐʌǝ ɐ ʍɥølǝ ʇǝɐɯ bnᴉldᴉnƃ ɐ ɔønɹsǝ, ʇøƃǝʇɥǝɹ.

source: Caught a bug? No problem. When you want, your changes go live when you click Save.
rtl: ذشعلاف ش زعل? رخ حقخزمثو. صاثر غخع صشرف, غخعق ذاشرلثس لخ مهدث صاثر غخع ذمهذن سشدث.

source: Release-On Date Publishing
rtl: قثمثشسث-خر يشفث حعزمهساهرلȻɐnƃɥʇ ɐ bnƃ? Nø dɹøblǝɯ. Wɥǝn ʎøn ʍɐnʇ, ʎønɹ ɔɥɐnƃǝs ƃø lᴉʌǝ ʍɥǝn ʎøn ɔlᴉɔʞ Sɐʌǝ.

source: When you've finished a {strong_start}section{strong_end}, pick when you want it to go live and {studio_name} takes care of the rest. Build your course incrementally.
rtl: صاثر غخع'دث بهرهساثي ش {strong_start}سثذفهخر{strong_end}, حهذن صاثر غخع صشرف هف فخ لخ مهدث شري {studio_name} فشنثس ذشقث خب فاث قثسف. زعهمي غخعق ذخعقسث هرذقثوثرفشممغ.

source: Work in Teams
rtl: صخقن هر فثشوسWɥǝn ʎøn'ʌǝ ɟᴉnᴉsɥǝd ɐ {strong_start}sǝɔʇᴉøn{strong_end}, dᴉɔʞ ʍɥǝn ʎøn ʍɐnʇ ᴉʇ ʇø ƃø lᴉʌǝ ɐnd {studio_name} ʇɐʞǝs ɔɐɹǝ øɟ ʇɥǝ ɹǝsʇ. Ƀnᴉld ʎønɹ ɔønɹsǝ ᴉnɔɹǝɯǝnʇɐllʎ.

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
rtl: ذخ-شعفاخقس اشدث بعمم شذذثسس فخ شمم فاث سشوث شعفاخقهرل فخخمس. وشنث غخعق ذخعقسث زثففثق فاقخعلا ش فثشو ثببخقف.

source: Sign Up for {studio_name} Today!
rtl: سهلر عح بخق {studio_name} فخيشغ!

source: Sign Up & Start Making Your {platform_name} Course
rtl: سهلر عح & سفشقف وشنهرل غخعق {platform_name} ذخعقسث

source: Already have a {studio_name} Account? Sign In
rtl: شمقثشيغ اشدث ش {studio_name} شذذخعرف? سهلر هر

source: Outlining Your Course
rtl: خعفمهرهرل غخعق ذخعقسثȻø-ɐnʇɥøɹs ɥɐʌǝ ɟnll ɐɔɔǝss ʇø ɐll ʇɥǝ sɐɯǝ ɐnʇɥøɹᴉnƃ ʇøøls. Mɐʞǝ ʎønɹ ɔønɹsǝ bǝʇʇǝɹ ʇɥɹønƃɥ ɐ ʇǝɐɯ ǝɟɟøɹʇ.

source: Simple two-level outline to organize your course. Drag and drop, and see your course at a glance.
rtl: سهوحمث فصخ-مثدثم خعفمهرث فخ خقلشرهظث غخعق ذخعقسث. يقشل شري يقخح, شري سثث غخعق ذخعقسث شف ش لمشرذث.

source: More than Just Lectures
rtl: وخقث فاشر تعسف مثذفعقثسSᴉɯdlǝ ʇʍø-lǝʌǝl ønʇlᴉnǝ ʇø øɹƃɐnᴉzǝ ʎønɹ ɔønɹsǝ. Đɹɐƃ ɐnd dɹød, ɐnd sǝǝ ʎønɹ ɔønɹsǝ ɐʇ ɐ ƃlɐnɔǝ.

source: Quickly create videos, text snippets, inline discussions, and a variety of problem types.
rtl: ضعهذنمغ ذقثشفث دهيثخس, فثطف سرهححثفس, هرمهرث يهسذعسسهخرس, شري ش دشقهثفغ خب حقخزمثو فغحثس.

source: Publishing on Date
rtl: حعزمهساهرل خر يشفثQnᴉɔʞlʎ ɔɹǝɐʇǝ ʌᴉdǝøs, ʇǝxʇ snᴉddǝʇs, ᴉnlᴉnǝ dᴉsɔnssᴉøns, ɐnd ɐ ʌɐɹᴉǝʇʎ øɟ dɹøblǝɯ ʇʎdǝs.

source: Simply set the date of a section or subsection, and {studio_name} will publish it to your students for you.
rtl: سهوحمغ سثف فاث يشفث خب ش سثذفهخر خق سعزسثذفهخر, شري {studio_name} صهمم حعزمهسا هف فخ غخعق سفعيثرفس بخق غخع.

source: We're having trouble rendering your component
rtl: صث'قث اشدهرل فقخعزمث قثريثقهرل غخعق ذخوحخرثرفSᴉɯdlʎ sǝʇ ʇɥǝ dɐʇǝ øɟ ɐ sǝɔʇᴉøn øɹ snbsǝɔʇᴉøn, ɐnd {studio_name} ʍᴉll dnblᴉsɥ ᴉʇ ʇø ʎønɹ sʇndǝnʇs ɟøɹ ʎøn.

source: Students will not be able to access this component. Re-edit your component to fix the error.
rtl: سفعيثرفس صهمم رخف زث شزمث فخ شذذثسس فاهس ذخوحخرثرف. قث-ثيهف غخعق ذخوحخرثرف فخ بهط فاث ثققخق.

source: Library Import
rtl: مهزقشقغ هوحخقف

source: Course Import
rtl: ذخعقسث هوحخقفSʇndǝnʇs ʍᴉll nøʇ bǝ ɐblǝ ʇø ɐɔɔǝss ʇɥᴉs ɔøɯdønǝnʇ. Ɍǝ-ǝdᴉʇ ʎønɹ ɔøɯdønǝnʇ ʇø ɟᴉx ʇɥǝ ǝɹɹøɹ.

source: Be sure you want to import a library before continuing. The contents of the imported library will replace the contents of the existing library. {em_start}You cannot undo a library import{em_end}. Before you proceed, we recommend that you export the current library, so that you have a backup copy of it.
rtl: زث سعقث غخع صشرف فخ هوحخقف ش مهزقشقغ زثبخقث ذخرفهرعهرل. فاث ذخرفثرفس خب فاث هوحخقفثي مهزقشقغ صهمم قثحمشذث فاث ذخرفثرفس خب فاث ثطهسفهرل مهزقشقغ. {em_start}غخع ذشررخف عريخ ش مهزقشقغ هوحخقف{em_end}. زثبخقث غخع حقخذثثي, صث قثذخووثري فاشف غخع ثطحخقف فاث ذعققثرف مهزقشقغ, سخ فاشف غخع اشدث ش زشذنعح ذخحغ خب هف.Ƀǝ snɹǝ ʎøn ʍɐnʇ ʇø ᴉɯdøɹʇ ɐ lᴉbɹɐɹʎ bǝɟøɹǝ ɔønʇᴉnnᴉnƃ. Ŧɥǝ ɔønʇǝnʇs øɟ ʇɥǝ ᴉɯdøɹʇǝd lᴉbɹɐɹʎ ʍᴉll ɹǝdlɐɔǝ ʇɥǝ ɔønʇǝnʇs øɟ ʇɥǝ ǝxᴉsʇᴉnƃ lᴉbɹɐɹʎ. {em_start}Ɏøn ɔɐnnøʇ nndø ɐ lᴉbɹɐɹʎ ᴉɯdøɹʇ{em_end}. Ƀǝɟøɹǝ ʎøn dɹøɔǝǝd, ʍǝ ɹǝɔøɯɯǝnd ʇɥɐʇ ʎøn ǝxdøɹʇ ʇɥǝ ɔnɹɹǝnʇ lᴉbɹɐɹʎ, sø ʇɥɐʇ ʎøn ɥɐʌǝ ɐ bɐɔʞnd ɔødʎ øɟ ᴉʇ.

source: The library that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a library.xml file. It may also contain other files.
rtl: فاث مهزقشقغ فاشف غخع هوحخقف وعسف زث هر ش .فشق.لظ بهمث (فاشف هس, ش .فشق بهمث ذخوحقثسسثي صهفا لرع ظهح). فاهس .فشق.لظ بهمث وعسف ذخرفشهر ش مهزقشقغ.طوم بهمث. هف وشغ شمسخ ذخرفشهر خفاثق بهمثس.Ŧɥǝ lᴉbɹɐɹʎ ʇɥɐʇ ʎøn ᴉɯdøɹʇ ɯnsʇ bǝ ᴉn ɐ .ʇɐɹ.ƃz ɟᴉlǝ (ʇɥɐʇ ᴉs, ɐ .ʇɐɹ ɟᴉlǝ ɔøɯdɹǝssǝd ʍᴉʇɥ ǤNɄ Ƶᴉd). Ŧɥᴉs .ʇɐɹ.ƃz ɟᴉlǝ ɯnsʇ ɔønʇɐᴉn ɐ lᴉbɹɐɹʎ.xɯl ɟᴉlǝ. Ɨʇ ɯɐʎ ɐlsø ɔønʇɐᴉn øʇɥǝɹ ɟᴉlǝs.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your library until the import operation has completed.
rtl: فاث هوحخقف حقخذثسس اشس بهدث سفشلثس. يعقهرل فاث بهقسف فصخ سفشلثس, غخع وعسف سفشغ خر فاهس حشلث. غخع ذشر مثشدث فاهس حشلث شبفثق فاث عرحشذنهرل سفشلث اشس ذخوحمثفثي. صث قثذخووثري, اخصثدثق, فاشف غخع يخر'ف وشنث هوحخقفشرف ذاشرلثس فخ غخعق مهزقشقغ عرفهم فاث هوحخقف خحثقشفهخر اشس ذخوحمثفثي.Ŧɥǝ ᴉɯdøɹʇ dɹøɔǝss ɥɐs ɟᴉʌǝ sʇɐƃǝs. Đnɹᴉnƃ ʇɥǝ ɟᴉɹsʇ ʇʍø sʇɐƃǝs, ʎøn ɯnsʇ sʇɐʎ øn ʇɥᴉs dɐƃǝ. Ɏøn ɔɐn lǝɐʌǝ ʇɥᴉs dɐƃǝ ɐɟʇǝɹ ʇɥǝ Ʉndɐɔʞᴉnƃ sʇɐƃǝ ɥɐs ɔøɯdlǝʇǝd. Wǝ ɹǝɔøɯɯǝnd, ɥøʍǝʌǝɹ, ʇɥɐʇ ʎøn døn'ʇ ɯɐʞǝ ᴉɯdøɹʇɐnʇ ɔɥɐnƃǝs ʇø ʎønɹ lᴉbɹɐɹʎ nnʇᴉl ʇɥǝ ᴉɯdøɹʇ ødǝɹɐʇᴉøn ɥɐs ɔøɯdlǝʇǝd.

source: Be sure you want to import a course before continuing. The contents of the imported course will replace the contents of the existing course. {em_start}You cannot undo a course import{em_end}. Before you proceed, we recommend that you export the current course, so that you have a backup copy of it.
rtl: زث سعقث غخع صشرف فخ هوحخقف ش ذخعقسث زثبخقث ذخرفهرعهرل. فاث ذخرفثرفس خب فاث هوحخقفثي ذخعقسث صهمم قثحمشذث فاث ذخرفثرفس خب فاث ثطهسفهرل ذخعقسث. {em_start}غخع ذشررخف عريخ ش ذخعقسث هوحخقف{em_end}. زثبخقث غخع حقخذثثي, صث قثذخووثري فاشف غخع ثطحخقف فاث ذعققثرف ذخعقسث, سخ فاشف غخع اشدث ش زشذنعح ذخحغ خب هف.Ƀǝ snɹǝ ʎøn ʍɐnʇ ʇø ᴉɯdøɹʇ ɐ ɔønɹsǝ bǝɟøɹǝ ɔønʇᴉnnᴉnƃ. Ŧɥǝ ɔønʇǝnʇs øɟ ʇɥǝ ᴉɯdøɹʇǝd ɔønɹsǝ ʍᴉll ɹǝdlɐɔǝ ʇɥǝ ɔønʇǝnʇs øɟ ʇɥǝ ǝxᴉsʇᴉnƃ ɔønɹsǝ. {em_start}Ɏøn ɔɐnnøʇ nndø ɐ ɔønɹsǝ ᴉɯdøɹʇ{em_end}. Ƀǝɟøɹǝ ʎøn dɹøɔǝǝd, ʍǝ ɹǝɔøɯɯǝnd ʇɥɐʇ ʎøn ǝxdøɹʇ ʇɥǝ ɔnɹɹǝnʇ ɔønɹsǝ, sø ʇɥɐʇ ʎøn ɥɐʌǝ ɐ bɐɔʞnd ɔødʎ øɟ ᴉʇ.

source: The course that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a course.xml file. It may also contain other files.
rtl: فاث ذخعقسث فاشف غخع هوحخقف وعسف زث هر ش .فشق.لظ بهمث (فاشف هس, ش .فشق بهمث ذخوحقثسسثي صهفا لرع ظهح). فاهس .فشق.لظ بهمث وعسف ذخرفشهر ش ذخعقسث.طوم بهمث. هف وشغ شمسخ ذخرفشهر خفاثق بهمثس.Ŧɥǝ ɔønɹsǝ ʇɥɐʇ ʎøn ᴉɯdøɹʇ ɯnsʇ bǝ ᴉn ɐ .ʇɐɹ.ƃz ɟᴉlǝ (ʇɥɐʇ ᴉs, ɐ .ʇɐɹ ɟᴉlǝ ɔøɯdɹǝssǝd ʍᴉʇɥ ǤNɄ Ƶᴉd). Ŧɥᴉs .ʇɐɹ.ƃz ɟᴉlǝ ɯnsʇ ɔønʇɐᴉn ɐ ɔønɹsǝ.xɯl ɟᴉlǝ. Ɨʇ ɯɐʎ ɐlsø ɔønʇɐᴉn øʇɥǝɹ ɟᴉlǝs.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your course until the import operation has completed.
rtl: فاث هوحخقف حقخذثسس اشس بهدث سفشلثس. يعقهرل فاث بهقسف فصخ سفشلثس, غخع وعسف سفشغ خر فاهس حشلث. غخع ذشر مثشدث فاهس حشلث شبفثق فاث عرحشذنهرل سفشلث اشس ذخوحمثفثي. صث قثذخووثري, اخصثدثق, فاشف غخع يخر'ف وشنث هوحخقفشرف ذاشرلثس فخ غخعق ذخعقسث عرفهم فاث هوحخقف خحثقشفهخر اشس ذخوحمثفثي.

source: Select a .tar.gz File to Replace Your Library Content
rtl: سثمثذف ش .فشق.لظ بهمث فخ قثحمشذث غخعق مهزقشقغ ذخرفثرف

source: Select a .tar.gz File to Replace Your Course Content
rtl: سثمثذف ش .فشق.لظ بهمث فخ قثحمشذث غخعق ذخعقسث ذخرفثرف

source: Choose a File to Import
rtl: ذاخخسث ش بهمث فخ هوحخقف

source: File Chosen:
rtl: بهمث ذاخسثر:

source: Replace my library with the selected file
rtl: قثحمشذث وغ مهزقشقغ صهفا فاث سثمثذفثي بهمث

source: Replace my course with the selected file
rtl: قثحمشذث وغ ذخعقسث صهفا فاث سثمثذفثي بهمث

source: Library Import Status
rtl: مهزقشقغ هوحخقف سفشفعس

source: Course Import Status
rtl: ذخعقسث هوحخقف سفشفعس

source: Transferring your file to our servers
rtl: فقشرسبثققهرل غخعق بهمث فخ خعق سثقدثقس

source: Unpacking
rtl: عرحشذنهرلŦɥǝ ᴉɯdøɹʇ dɹøɔǝss ɥɐs ɟᴉʌǝ sʇɐƃǝs. Đnɹᴉnƃ ʇɥǝ ɟᴉɹsʇ ʇʍø sʇɐƃǝs, ʎøn ɯnsʇ sʇɐʎ øn ʇɥᴉs dɐƃǝ. Ɏøn ɔɐn lǝɐʌǝ ʇɥᴉs dɐƃǝ ɐɟʇǝɹ ʇɥǝ Ʉndɐɔʞᴉnƃ sʇɐƃǝ ɥɐs ɔøɯdlǝʇǝd. Wǝ ɹǝɔøɯɯǝnd, ɥøʍǝʌǝɹ, ʇɥɐʇ ʎøn døn'ʇ ɯɐʞǝ ᴉɯdøɹʇɐnʇ ɔɥɐnƃǝs ʇø ʎønɹ ɔønɹsǝ nnʇᴉl ʇɥǝ ᴉɯdøɹʇ ødǝɹɐʇᴉøn ɥɐs ɔøɯdlǝʇǝd.

source: Expanding and preparing folder/file structure (You can now leave this page safely, but avoid making drastic changes to content until this import is complete)
rtl: ثطحشريهرل شري حقثحشقهرل بخميثق/بهمث سفقعذفعقث (غخع ذشر رخص مثشدث فاهس حشلث سشبثمغ, زعف شدخهي وشنهرل يقشسفهذ ذاشرلثس فخ ذخرفثرف عرفهم فاهس هوحخقف هس ذخوحمثفث)

source: Verifying
rtl: دثقهبغهرل

source: Reviewing semantics, syntax, and required data
rtl: قثدهثصهرل سثوشرفهذس, سغرفشط, شري قثضعهقثي يشفش

source: Updating Library
rtl: عحيشفهرل مهزقشقغ

source: Updating Course
rtl: عحيشفهرل ذخعقسثɆxdɐndᴉnƃ ɐnd dɹǝdɐɹᴉnƃ ɟøldǝɹ/ɟᴉlǝ sʇɹnɔʇnɹǝ (Ɏøn ɔɐn nøʍ lǝɐʌǝ ʇɥᴉs dɐƃǝ sɐɟǝlʎ, bnʇ ɐʌøᴉd ɯɐʞᴉnƃ dɹɐsʇᴉɔ ɔɥɐnƃǝs ʇø ɔønʇǝnʇ nnʇᴉl ʇɥᴉs ᴉɯdøɹʇ ᴉs ɔøɯdlǝʇǝ)

source: Integrating your imported content into this library. This process might take longer with larger libraries.
rtl: هرفثلقشفهرل غخعق هوحخقفثي ذخرفثرف هرفخ فاهس مهزقشقغ. فاهس حقخذثسس وهلاف فشنث مخرلثق صهفا مشقلثق مهزقشقهثس.Ɨnʇǝƃɹɐʇᴉnƃ ʎønɹ ᴉɯdøɹʇǝd ɔønʇǝnʇ ᴉnʇø ʇɥᴉs lᴉbɹɐɹʎ. Ŧɥᴉs dɹøɔǝss ɯᴉƃɥʇ ʇɐʞǝ lønƃǝɹ ʍᴉʇɥ lɐɹƃǝɹ lᴉbɹɐɹᴉǝs.

source: Integrating your imported content into this course. This process might take longer with larger courses.
rtl: هرفثلقشفهرل غخعق هوحخقفثي ذخرفثرف هرفخ فاهس ذخعقسث. فاهس حقخذثسس وهلاف فشنث مخرلثق صهفا مشقلثق ذخعقسثس.

source: Your imported content has now been integrated into this library
rtl: غخعق هوحخقفثي ذخرفثرف اشس رخص زثثر هرفثلقشفثي هرفخ فاهس مهزقشقغ

source: Your imported content has now been integrated into this course
rtl: غخعق هوحخقفثي ذخرفثرف اشس رخص زثثر هرفثلقشفثي هرفخ فاهس ذخعقسث

source: View Updated Library
rtl: دهثص عحيشفثي مهزقشقغ

source: View Updated Outline
rtl: دهثص عحيشفثي خعفمهرث

source: Why import a library?
rtl: صاغ هوحخقف ش مهزقشقغ?Ɨnʇǝƃɹɐʇᴉnƃ ʎønɹ ᴉɯdøɹʇǝd ɔønʇǝnʇ ᴉnʇø ʇɥᴉs ɔønɹsǝ. Ŧɥᴉs dɹøɔǝss ɯᴉƃɥʇ ʇɐʞǝ lønƃǝɹ ʍᴉʇɥ lɐɹƃǝɹ ɔønɹsǝs.

source: You might want to update an existing library to a new version, or replace an existing library entirely. You might also have developed a library outside of {studio_name}.
rtl: غخع وهلاف صشرف فخ عحيشفث شر ثطهسفهرل مهزقشقغ فخ ش رثص دثقسهخر, خق قثحمشذث شر ثطهسفهرل مهزقشقغ ثرفهقثمغ. غخع وهلاف شمسخ اشدث يثدثمخحثي ش مهزقشقغ خعفسهيث خب {studio_name}.
