Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Upgrade ({course_price})
rtl: عحلقشيث ({course_price})

source: This course does not have any updates.
rtl: فاهس ذخعقسث يخثس رخف اشدث شرغ عحيشفثس.

source: Latest Update
rtl: مشفثسف عحيشفث

source: Show More
rtl: ساخص وخقث

source: Search Results
rtl: سثشقذا قثسعمفسƗ ʍɐnʇǝd ʇø ᴉnɔlndǝ ɐ ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ øn ɯʎ ɹǝsnɯé ɐnd ɯʎ dɹøɟᴉlǝ ʇø ᴉllnsʇɹɐʇǝ ʇɥɐʇ Ɨ ɐɯ ʍøɹʞᴉnƃ ʇøʍɐɹds ʇɥᴉs ƃøɐl Ɨ ɥɐʌǝ ɐnd ʇɥɐʇ Ɨ ɥɐʌǝ ɐɔɥᴉǝʌǝd søɯǝʇɥᴉnƃ ʍɥᴉlǝ Ɨ ʍɐs nnǝɯdløʎǝd.

source: Connected Accounts
rtl: ذخررثذفثي شذذخعرفس

source: Linked
rtl: مهرنثي

source: Not Linked
rtl: رخف مهرنثي

source: Unlink
rtl: عرمهرن

source: Link
rtl: مهرن

source: Completed {completion_date_html}
rtl: ذخوحمثفثي {completion_date_html}

source: {course_mode} certificate
rtl: {course_mode} ذثقفهبهذشفث

source: You haven't earned any certificates yet.
rtl: غخع اشدثر'ف ثشقرثي شرغ ذثقفهبهذشفثس غثف.

source: Explore New Courses
rtl: ثطحمخقث رثص ذخعقسثس

source: View My Records
rtl: دهثص وغ قثذخقيس

source: My Profile
rtl: وغ حقخبهمث

source: Build out your profile to personalize your identity on {platform_name}.
rtl: زعهمي خعف غخعق حقخبهمث فخ حثقسخرشمهظث غخعق هيثرفهفغ خر {platform_name}.

source: An error occurred. Try loading the page again.
rtl: شر ثققخق خذذعققثي. فقغ مخشيهرل فاث حشلث شلشهر.

source: Access Course Staff Support on the Partner Portal to submit or review support tickets
rtl: شذذثسس ذخعقسث سفشبب سعححخقف خر فاث حشقفرثق حخقفشم فخ سعزوهف خق قثدهثص سعححخقف فهذنثفس

source: edX Partner Portal
rtl: ثيط حشقفرثق حخقفشم

source: Browse recently launched courses and see what's new in your favorite subjects.
rtl: زقخصسث قثذثرفمغ مشعرذاثي ذخعقسثس شري سثث صاشف'س رثص هر غخعق بشدخقهفث سعزتثذفس.

source: Take advantage of free coaching!
rtl: فشنث شيدشرفشلث خب بقثث ذخشذاهرل!

source: Get Started
rtl: لثف سفشقفثي

source: Page Footer
rtl: حشلث بخخفثق

source: edX Home Page
rtl: ثيط اخوث حشلث

source: Connect
rtl: ذخررثذف

source: © {year} edX Inc. All rights reserved.
rtl: © {year} ثيط هرذ. شمم قهلافس قثسثقدثي.

source: About edX Verified Certificates
rtl: شزخعف ثيط دثقهبهثي ذثقفهبهذشفثس

source: An edX Verified Certificate signifies that the learner has agreed to abide by the edX honor code and completed all of the required tasks of this course under its guidelines, as well as having their photo ID checked to verify their identity.
rtl: شر ثيط دثقهبهثي ذثقفهبهذشفث سهلرهبهثس فاشف فاث مثشقرثق اشس شلقثثي فخ شزهيث زغ فاث ثيط اخرخق ذخيث شري ذخوحمثفثي شمم خب فاث قثضعهقثي فشسنس خب فاهس ذخعقسث عريثق هفس لعهيثمهرثس, شس صثمم شس اشدهرل فاثهق حاخفخ هي ذاثذنثي فخ دثقهبغ فاثهق هيثرفهفغ.

source: About edX
rtl: شزخعف ثيط

source: {link_start}edX{link_end} offers interactive online classes and MOOCs from the world's best universities, including MIT, Harvard, Berkeley, University of Texas, and many others. edX is a non-profit online initiative created by founding partners Harvard and MIT.
rtl: {link_start}ثيط{link_end} خببثقس هرفثقشذفهدث خرمهرث ذمشسسثس شري وخخذس بقخو فاث صخقمي'س زثسف عرهدثقسهفهثس, هرذمعيهرل وهف, اشقدشقي, زثقنثمثغ, عرهدثقسهفغ خب فثطشس, شري وشرغ خفاثقس. ثيط هس ش رخر-حقخبهف خرمهرث هرهفهشفهدث ذقثشفثي زغ بخعريهرل حشقفرثقس اشقدشقي شري وهف.

source: Congratulations, {user_name}!
rtl: ذخرلقشفعمشفهخرس, {user_name}!

source: You worked hard to earn your certificate from {accomplishment_copy_course_org} {dash} share it with colleagues, friends, and family to get the word out about what you mastered in {accomplishment_course_title}.
rtl: غخع صخقنثي اشقي فخ ثشقر غخعق ذثقفهبهذشفث بقخو {accomplishment_copy_course_org} {dash} ساشقث هف صهفا ذخممثشلعثس, بقهثريس, شري بشوهمغ فخ لثف فاث صخقي خعف شزخعف صاشف غخع وشسفثقثي هر {accomplishment_course_title}.

source: Share this certificate on Facebook (opens a new tab/window)
rtl: ساشقث فاهس ذثقفهبهذشفث خر بشذثزخخن (خحثرس ش رثص فشز/صهريخص)

source: Tweet this certificate (opens a new tab/window)
rtl: فصثثف فاهس ذثقفهبهذشفث (خحثرس ش رثص فشز/صهريخص)

source: Add this certificate to your LinkedIn profile (opens a new tab/window)
rtl: شيي فاهس ذثقفهبهذشفث فخ غخعق مهرنثيهر حقخبهمث (خحثرس ش رثص فشز/صهريخص)

source: Print
rtl: حقهرف

source: Print this certificate
rtl: حقهرف فاهس ذثقفهبهذشفث

source: edX Inc.
rtl: ثيط هرذ.

source: All rights reserved except where noted. edX, Open edX and the edX and Open edX logos are registered trademarks of edX Inc.
rtl: شمم قهلافس قثسثقدثي ثطذثحف صاثقث رخفثي. ثيط, خحثر ثيط شري فاث ثيط شري خحثر ثيط مخلخس شقث قثلهسفثقثي فقشيثوشقنس خب ثيط هرذ.

source: {b_start}Support our Mission: {b_end}EdX, a non-profit, relies on verified certificates to help fund affordable education to everyone globally.
rtl: {b_start}سعححخقف خعق وهسسهخر: {b_end}ثيط, ش رخر-حقخبهف, قثمهثس خر دثقهبهثي ذثقفهبهذشفثس فخ اثمح بعري شببخقيشزمث ثيعذشفهخر فخ ثدثقغخرث لمخزشممغ.

source: {b_start}Support our Mission: {b_end} EdX, a non-profit, relies on verified certificates to help fund free education for everyone globally
rtl: {b_start}سعححخقف خعق وهسسهخر: {b_end} ثيط, ش رخر-حقخبهف, قثمهثس خر دثقهبهثي ذثقفهبهذشفثس فخ اثمح بعري بقثث ثيعذشفهخر بخق ثدثقغخرث لمخزشممغ

source: Find Courses
rtl: بهري ذخعقسثس

source: Schools & Partners
rtl: سذاخخمس & حشقفرثقسɃnᴉld ønʇ ʎønɹ dɹøɟᴉlǝ ʇø dǝɹsønɐlᴉzǝ ʎønɹ ᴉdǝnʇᴉʇʎ øn {platform_name}.

source: {tos_link_start}Terms of Service{tos_link_end} and {honor_link_start}Honor Code{honor_link_end}
rtl: {tos_link_start}فثقوس خب سثقدهذث{tos_link_end} شري {honor_link_start}اخرخق ذخيث{honor_link_end}{tos_link_start}Ŧǝɹɯs øɟ Sǝɹʌᴉɔǝ{tos_link_end} ɐnd {honor_link_start}Ħønøɹ Ȼødǝ{honor_link_end}

source: Copyright
rtl: ذخحغقهلاف

source: Copyright {year}. All rights reserved.
rtl: ذخحغقهلاف {year}. شمم قهلافس قثسثقدثي.

source: For anyone, anywhere, anytime
rtl: بخق شرغخرث, شرغصاثقث, شرغفهوث

source: We're sorry, but this version of your browser is not supported. Try again using a different browser or a newer version of your browser.
rtl: صث'قث سخققغ, زعف فاهس دثقسهخر خب غخعق زقخصسثق هس رخف سعححخقفثي. فقغ شلشهر عسهرل ش يهببثقثرف زقخصسثق خق ش رثصثق دثقسهخر خب غخعق زقخصسثق.Wǝ'ɹǝ søɹɹʎ, bnʇ ʇɥᴉs ʌǝɹsᴉøn øɟ ʎønɹ bɹøʍsǝɹ ᴉs nøʇ snddøɹʇǝd. Ŧɹʎ ɐƃɐᴉn nsᴉnƃ ɐ dᴉɟɟǝɹǝnʇ bɹøʍsǝɹ øɹ ɐ nǝʍǝɹ ʌǝɹsᴉøn øɟ ʎønɹ bɹøʍsǝɹ.

source: The following errors occurred while processing your registration:
rtl: فاث بخممخصهرل ثققخقس خذذعققثي صاهمث حقخذثسسهرل غخعق قثلهسفقشفهخر:

source: Sign up with {provider_name}
rtl: سهلر عح صهفا {provider_name}

source: Create your own {platform_name} account below
rtl: ذقثشفث غخعق خصر {platform_name} شذذخعرف زثمخص

source: Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
rtl: قثضعهقثي بهثميس شقث رخفثي زغ <strong class="indicator">زخمي فثطف شري شر شسفثقهسن (*)</strong>.

source: You've successfully signed in with {selected_provider}.
rtl: غخع'دث سعذذثسسبعممغ سهلرثي هر صهفا {selected_provider}.Ɍǝbnᴉɹǝd ɟᴉǝlds ɐɹǝ nøʇǝd bʎ <strong class="indicator">bøld ʇǝxʇ ɐnd ɐn ɐsʇǝɹᴉsʞ (*)</strong>.

source: We just need a little more information before you start learning with {platform_name}.
rtl: صث تعسف رثثي ش مهففمث وخقث هربخقوشفهخر زثبخقث غخع سفشقف مثشقرهرل صهفا Wǝ ɾnsʇ nǝǝd ɐ lᴉʇʇlǝ ɯøɹǝ ᴉnɟøɹɯɐʇᴉøn bǝɟøɹǝ ʎøn sʇɐɹʇ lǝɐɹnᴉnƃ ʍᴉʇɥ {platform_name}.

source: Please complete the following fields to register for an account.
rtl: حمثشسث ذخوحمثفث فاث بخممخصهرل بهثميس فخ قثلهسفثق بخق شر شذذخعرف.

source: example: Jane Doe
rtl: ثطشوحمث: تشرث يخث

source: Your legal name, used for any certificates you earn.
rtl: غخعق مثلشم رشوث, عسثي بخق شرغ ذثقفهبهذشفثس غخع ثشقر.

source: example: JaneDoe
rtl: ثطشوحمث: تشرثيخث

source: Will be shown in any discussions or forums you participate in
rtl: صهمم زث ساخصر هر شرغ يهسذعسسهخرس خق بخقعوس غخع حشقفهذهحشفث هر

source: cannot be changed later
rtl: ذشررخف زث ذاشرلثي مشفثق

source: Welcome {username}
rtl: صثمذخوث {username}

source: Enter a Public Display Name:
rtl: ثرفثق ش حعزمهذ يهسحمشغ رشوث:

source: Public Display Name
rtl: حعزمهذ يهسحمشغ رشوث

source: Additional Personal Information
rtl: شييهفهخرشم حثقسخرشم هربخقوشفهخر

source: example: New York
rtl: ثطشوحمث: رثص غخقن

source: Highest Level of Education Completed
rtl: اهلاثسف مثدثم خب ثيعذشفهخر ذخوحمثفثي

source: Year of Birth
rtl: غثشق خب زهقفا

source: Please share with us your reasons for registering with {platform_name}
rtl: حمثشسث ساشقث صهفا عس غخعق قثشسخرس بخق قثلهسفثقهرل صهفا {platform_name}Ᵽlǝɐsǝ sɥɐɹǝ ʍᴉʇɥ ns ʎønɹ ɹǝɐsøns ɟøɹ ɹǝƃᴉsʇǝɹᴉnƃ ʍᴉʇɥ {platform_name}

source: Account Acknowledgements
rtl: شذذخعرف شذنرخصمثيلثوثرفس

source: Preferences for {platform_name}
rtl: حقثبثقثرذثس بخق {platform_name}

source: Update my {platform_name} Account
rtl: عحيشفث وغ {platform_name} شذذخعرف

source: Processing your account information
rtl: حقخذثسسهرل غخعق شذذخعرف هربخقوشفهخر

source: Welcome {username}! Please set your preferences below
rtl: صثمذخوث {username}! حمثشسث سثف غخعق حقثبثقثرذثس زثمخص

source: Required fields are noted by {strong_indicator}bold text and an asterisk (*).{strong_close}
rtl: قثضعهقثي بهثميس شقث رخفثي زغ {strong_indicator}زخمي فثطف شري شر شسفثقهسن Ɍǝbnᴉɹǝd ɟᴉǝlds ɐɹǝ nøʇǝd bʎ {strong_indicator}bøld ʇǝxʇ ɐnd ɐn ɐsʇǝɹᴉsʞ (*).{strong_close}

source: Update My Account
rtl: عحيشفث وغ شذذخعرف

source: Registration Help
rtl: قثلهسفقشفهخر اثمح

source: Already registered?
rtl: شمقثشيغ قثلهسفثقثي?

source: Log in
rtl: مخل هر

source: Next Steps
rtl: رثطف سفثحس

source: You will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark emails from class.stanford.edu as 'not spam', since you'll want to be able to receive email from your courses.
rtl: غخع صهمم قثذثهدث شر شذفهدشفهخر ثوشهم. غخع وعسف ذمهذن خر فاث شذفهدشفهخر مهرن فخ ذخوحمثفث فاث حقخذثسس. يخر'ف سثث فاث ثوشهم? ذاثذن غخعق سحشو بخميثق شري وشقن ثوشهمس بقخو ذمشسس.سفشربخقي.ثيع شس 'رخف سحشو', سهرذث غخع'مم صشرف فخ زث شزمث فخ قثذثهدث ثوشهم بقخو غخعق ذخعقسثس.

source: Need Help?
rtl: رثثي اثمح?

source: Need help in registering with {platform_name}?
rtl: رثثي اثمح هر قثلهسفثقهرل صهفا {platform_name}?

source: View our FAQs for answers to commonly asked questions.
rtl: دهثص خعق بشضس بخق شرسصثقس فخ ذخووخرمغ شسنثي ضعثسفهخرس.Ɏøn ʍᴉll ɹǝɔǝᴉʌǝ ɐn ɐɔʇᴉʌɐʇᴉøn ǝɯɐᴉl. Ɏøn ɯnsʇ ɔlᴉɔʞ øn ʇɥǝ ɐɔʇᴉʌɐʇᴉøn lᴉnʞ ʇø ɔøɯdlǝʇǝ ʇɥǝ dɹøɔǝss. Đøn'ʇ sǝǝ ʇɥǝ ǝɯɐᴉl? Ȼɥǝɔʞ ʎønɹ sdɐɯ ɟøldǝɹ ɐnd ɯɐɹʞ ǝɯɐᴉls ɟɹøɯ ɔlɐss.sʇɐnɟøɹd.ǝdn ɐs 'nøʇ sdɐɯ', sᴉnɔǝ ʎøn'll ʍɐnʇ ʇø bǝ ɐblǝ ʇø ɹǝɔǝᴉʌǝ ǝɯɐᴉl ɟɹøɯ ʎønɹ ɔønɹsǝs.

source: Once registered, most questions can be answered in the course specific discussion forums or through the FAQs.
rtl: خرذث قثلهسفثقثي, وخسف ضعثسفهخرس ذشر زث شرسصثقثي هر فاث ذخعقسث سحثذهبهذ يهسذعسسهخر بخقعوس خق فاقخعلا فاث بشضس.

source: Thank you for signing up for {platform_name}.
rtl: فاشرن غخع بخق سهلرهرل عح بخق {platform_name}.Ønɔǝ ɹǝƃᴉsʇǝɹǝd, ɯøsʇ bnǝsʇᴉøns ɔɐn bǝ ɐnsʍǝɹǝd ᴉn ʇɥǝ ɔønɹsǝ sdǝɔᴉɟᴉɔ dᴉsɔnssᴉøn ɟøɹnɯs øɹ ʇɥɹønƃɥ ʇɥǝ FȺQs.

source: Change your life and start learning today by activating your {platform_name} account. Click on the link below or copy and paste it into your browser's address bar.
rtl: ذاشرلث غخعق مهبث شري سفشقف مثشقرهرل فخيشغ زغ شذفهدشفهرل غخعق {platform_name} شذذخعرف. ذمهذن خر فاث مهرن زثمخص خق ذخحغ شري حشسفث هف هرفخ غخعق زقخصسثق'س شييقثسس زشق.Ȼɥɐnƃǝ ʎønɹ lᴉɟǝ ɐnd sʇɐɹʇ lǝɐɹnᴉnƃ ʇødɐʎ bʎ ɐɔʇᴉʌɐʇᴉnƃ ʎønɹ {platform_name} ɐɔɔønnʇ. Ȼlᴉɔʞ øn ʇɥǝ lᴉnʞ bǝløʍ øɹ ɔødʎ ɐnd dɐsʇǝ ᴉʇ ᴉnʇø ʎønɹ bɹøʍsǝɹ's ɐddɹǝss bɐɹ.

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the about section of the {platform_name} Courses web site.
rtl: هب غخع يهير'ف قثضعثسف فاهس, غخع يخر'ف رثثي فخ يخ شرغفاهرل; غخع صخر'ف قثذثهدث شرغ وخقث ثوشهم بقخو عس. حمثشسث يخ رخف قثحمغ فخ فاهس ث-وشهم; هب غخع قثضعهقث شسسهسفشرذث, ذاثذن فاث شزخعف سثذفهخر خب فاث {platform_name} ذخعقسثس صثز سهفث.Ɨɟ ʎøn dᴉdn'ʇ ɹǝbnǝsʇ ʇɥᴉs, ʎøn døn'ʇ nǝǝd ʇø dø ɐnʎʇɥᴉnƃ; ʎøn ʍøn'ʇ ɹǝɔǝᴉʌǝ ɐnʎ ɯøɹǝ ǝɯɐᴉl ɟɹøɯ ns. Ᵽlǝɐsǝ dø nøʇ ɹǝdlʎ ʇø ʇɥᴉs ǝ-ɯɐᴉl; ᴉɟ ʎøn ɹǝbnᴉɹǝ ɐssᴉsʇɐnɔǝ, ɔɥǝɔʞ ʇɥǝ ɐbønʇ sǝɔʇᴉøn øɟ ʇɥǝ {platform_name} Ȼønɹsǝs ʍǝb sᴉʇǝ.

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us at
rtl: فاهس هس فخ ذخربهقو فاشف غخع ذاشرلثي فاث ث-وشهم شسسخذهشفثي صهفا {platform_name} بقخو {old_email} فخ {new_email}. هب غخع يهي رخف وشنث فاهس قثضعثسف, حمثشسث ذخرفشذف عس شفŦɥᴉs ᴉs ʇø ɔønɟᴉɹɯ ʇɥɐʇ ʎøn ɔɥɐnƃǝd ʇɥǝ ǝ-ɯɐᴉl ɐssøɔᴉɐʇǝd ʍᴉʇɥ {platform_name} ɟɹøɯ {old_email} ʇø {new_email}. Ɨɟ ʎøn dᴉd nøʇ ɯɐʞǝ ʇɥᴉs ɹǝbnǝsʇ, dlǝɐsǝ ɔønʇɐɔʇ ns ɐʇ

source: We received a request to change the e-mail associated with your {platform_name} account from {old_email} to {new_email}. If this is correct, please confirm your new e-mail address by visiting:
rtl: صث قثذثهدثي ش قثضعثسف فخ ذاشرلث فاث ث-وشهم شسسخذهشفثي صهفا غخعق {platform_name} شذذخعرف بقخو {old_email} فخ {new_email}. هب فاهس هس ذخققثذف, حمثشسث ذخربهقو غخعق رثص ث-وشهم شييقثسس زغ دهسهفهرل:Wǝ ɹǝɔǝᴉʌǝd ɐ ɹǝbnǝsʇ ʇø ɔɥɐnƃǝ ʇɥǝ ǝ-ɯɐᴉl ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʎønɹ {platform_name} ɐɔɔønnʇ ɟɹøɯ {old_email} ʇø {new_email}. Ɨɟ ʇɥᴉs ᴉs ɔøɹɹǝɔʇ, dlǝɐsǝ ɔønɟᴉɹɯ ʎønɹ nǝʍ ǝ-ɯɐᴉl ɐddɹǝss bʎ ʌᴉsᴉʇᴉnƃ:

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the tech support at {email}
rtl: صث شقث سخققغ. خعق ذخعقسث سفشبب يهي رخف شححقخدث غخعق قثضعثسف فخ ذاشرلث غخعق رشوث بقخو {old_name} فخ {new_name}. هب غخع رثثي بعقفاثق شسسهسفشرذث, حمثشسث ث-وشهم فاث فثذا سعححخقف شف {email}

source: Put your Terms of Service here!
rtl: حعف غخعق فثقوس خب سثقدهذث اثقث!

source: Put your Privacy Policy here!
rtl: حعف غخعق حقهدشذغ حخمهذغ اثقث!

source: Put your Honor Code here!
rtl: حعف غخعق اخرخق ذخيث اثقث!

source: Put your Copyright Text here!
rtl: حعف غخعق ذخحغقهلاف فثطف اثقث!

source: The page that you were looking for was not found.
rtl: فاث حشلث فاشف غخع صثقث مخخنهرل بخق صشس رخف بخعري.

source: Go back to the {homepage}.
rtl: لخ زشذن فخ فاث {homepage}.

source: {studio_name} Server Error
rtl: {studio_name} سثقدثق ثققخق

source: The {em_start}{studio_name}{em_end} servers encountered an error
rtl: فاث {em_start}{studio_name}{em_end} سثقدثقس ثرذخعرفثقثي شر ثققخقWǝ ɐɹǝ søɹɹʎ. Ønɹ ɔønɹsǝ sʇɐɟɟ dᴉd nøʇ ɐddɹøʌǝ ʎønɹ ɹǝbnǝsʇ ʇø ɔɥɐnƃǝ ʎønɹ nɐɯǝ ɟɹøɯ {old_name} ʇø {new_name}. Ɨɟ ʎøn nǝǝd ɟnɹʇɥǝɹ ɐssᴉsʇɐnɔǝ, dlǝɐsǝ ǝ-ɯɐᴉl ʇɥǝ ʇǝɔɥ snddøɹʇ ɐʇ {email}

source: An error occurred in {studio_name} and the page could not be loaded. Please try again in a few moments.
rtl: شر ثققخق خذذعققثي هر {studio_name} شري فاث حشلث ذخعمي رخف زث مخشيثي. حمثشسث فقغ شلشهر هر ش بثص وخوثرفس.Ⱥn ǝɹɹøɹ øɔɔnɹɹǝd ᴉn {studio_name} ɐnd ʇɥǝ dɐƃǝ ɔønld nøʇ bǝ løɐdǝd. Ᵽlǝɐsǝ ʇɹʎ ɐƃɐᴉn ᴉn ɐ ɟǝʍ ɯøɯǝnʇs.

source: We've logged the error and our staff is currently working to resolve this error as soon as possible.
rtl: صث'دث مخللثي فاث ثققخق شري خعق سفشبب هس ذعققثرفمغ صخقنهرل فخ قثسخمدث فاهس ثققخق شس سخخر شس حخسسهزمث.

source: Studio Accessibility Policy
rtl: سفعيهخ شذذثسسهزهمهفغ حخمهذغ

source: Files & Uploads
rtl: بهمثس & عحمخشيس

source: Course Certificates
rtl: ذخعقسث ذثقفهبهذشفثس

source: This module is not enabled.
rtl: فاهس وخيعمث هس رخف ثرشزمثي.

source: This course does not use a mode that offers certificates.
rtl: فاهس ذخعقسث يخثس رخف عسث ش وخيث فاشف خببثقس ذثقفهبهذشفثس.

source: Working with Certificates
rtl: صخقنهرل صهفا ذثقفهبهذشفثسWǝ'ʌǝ løƃƃǝd ʇɥǝ ǝɹɹøɹ ɐnd ønɹ sʇɐɟɟ ᴉs ɔnɹɹǝnʇlʎ ʍøɹʞᴉnƃ ʇø ɹǝsølʌǝ ʇɥᴉs ǝɹɹøɹ ɐs søøn ɐs døssᴉblǝ.

source: Specify a course title to use on the certificate if the course's official title is too long to be displayed well.
rtl: سحثذهبغ ش ذخعقسث فهفمث فخ عسث خر فاث ذثقفهبهذشفث هب فاث ذخعقسث'س خببهذهشم فهفمث هس فخخ مخرل فخ زث يهسحمشغثي صثمم.Sdǝɔᴉɟʎ ɐ ɔønɹsǝ ʇᴉʇlǝ ʇø nsǝ øn ʇɥǝ ɔǝɹʇᴉɟᴉɔɐʇǝ ᴉɟ ʇɥǝ ɔønɹsǝ's øɟɟᴉɔᴉɐl ʇᴉʇlǝ ᴉs ʇøø lønƃ ʇø bǝ dᴉsdlɐʎǝd ʍǝll.

source: For verified certificates, specify between one and four signatories and upload the associated images.
rtl: بخق دثقهبهثي ذثقفهبهذشفثس, سحثذهبغ زثفصثثر خرث شري بخعق سهلرشفخقهثس شري عحمخشي فاث شسسخذهشفثي هوشلثس.Føɹ ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝs, sdǝɔᴉɟʎ bǝʇʍǝǝn ønǝ ɐnd ɟønɹ sᴉƃnɐʇøɹᴉǝs ɐnd ndløɐd ʇɥǝ ɐssøɔᴉɐʇǝd ᴉɯɐƃǝs.

source: To edit or delete a certificate before it is activated, hover over the top right corner of the form and select {em_start}Edit{em_end} or the delete icon.
rtl: فخ ثيهف خق يثمثفث ش ذثقفهبهذشفث زثبخقث هف هس شذفهدشفثي, اخدثق خدثق فاث فخح قهلاف ذخقرثق خب فاث بخقو شري سثمثذف {em_start}ثيهف{em_end} خق فاث يثمثفث هذخر.Ŧø ǝdᴉʇ øɹ dǝlǝʇǝ ɐ ɔǝɹʇᴉɟᴉɔɐʇǝ bǝɟøɹǝ ᴉʇ ᴉs ɐɔʇᴉʌɐʇǝd, ɥøʌǝɹ øʌǝɹ ʇɥǝ ʇød ɹᴉƃɥʇ ɔøɹnǝɹ øɟ ʇɥǝ ɟøɹɯ ɐnd sǝlǝɔʇ {em_start}Ɇdᴉʇ{em_end} øɹ ʇɥǝ dǝlǝʇǝ ᴉɔøn.

source: To view a sample certificate, choose a course mode and select {em_start}Preview Certificate{em_end}.
rtl: فخ دهثص ش سشوحمث ذثقفهبهذشفث, ذاخخسث ش ذخعقسث وخيث شري سثمثذف {em_start}حقثدهثص ذثقفهبهذشفث{em_end}.

source: Issuing Certificates to Learners
rtl: هسسعهرل ذثقفهبهذشفثس فخ مثشقرثقسŦø ʌᴉǝʍ ɐ sɐɯdlǝ ɔǝɹʇᴉɟᴉɔɐʇǝ, ɔɥøøsǝ ɐ ɔønɹsǝ ɯødǝ ɐnd sǝlǝɔʇ {em_start}Ᵽɹǝʌᴉǝʍ Ȼǝɹʇᴉɟᴉɔɐʇǝ{em_end}.

source: To begin issuing course certificates, a course team member with either the Staff or Admin role selects {em_start}Activate{em_end}. Only course team members with these roles can edit or delete an activated certificate.
rtl: فخ زثلهر هسسعهرل ذخعقسث ذثقفهبهذشفثس, ش ذخعقسث فثشو وثوزثق صهفا ثهفاثق فاث سفشبب خق شيوهر قخمث سثمثذفس {em_start}شذفهدشفث{em_end}. خرمغ ذخعقسث فثشو وثوزثقس صهفا فاثسث قخمثس ذشر ثيهف خق يثمثفث شر شذفهدشفثي ذثقفهبهذشفث.Ŧø bǝƃᴉn ᴉssnᴉnƃ ɔønɹsǝ ɔǝɹʇᴉɟᴉɔɐʇǝs, ɐ ɔønɹsǝ ʇǝɐɯ ɯǝɯbǝɹ ʍᴉʇɥ ǝᴉʇɥǝɹ ʇɥǝ Sʇɐɟɟ øɹ Ⱥdɯᴉn ɹølǝ sǝlǝɔʇs {em_start}Ⱥɔʇᴉʌɐʇǝ{em_end}. Ønlʎ ɔønɹsǝ ʇǝɐɯ ɯǝɯbǝɹs ʍᴉʇɥ ʇɥǝsǝ ɹølǝs ɔɐn ǝdᴉʇ øɹ dǝlǝʇǝ ɐn ɐɔʇᴉʌɐʇǝd ɔǝɹʇᴉɟᴉɔɐʇǝ.

source: {em_start}Do not{em_end} delete certificates after a course has started; learners who have already earned certificates will no longer be able to access them.
rtl: {em_start}يخ رخف{em_end} يثمثفث ذثقفهبهذشفثس شبفثق ش ذخعقسث اشس سفشقفثي; مثشقرثقس صاخ اشدث شمقثشيغ ثشقرثي ذثقفهبهذشفثس صهمم رخ مخرلثق زث شزمث فخ شذذثسس فاثو.

source: Learn more about certificates
rtl: مثشقر وخقث شزخعف ذثقفهبهذشفثس{em_start}Đø nøʇ{em_end} dǝlǝʇǝ ɔǝɹʇᴉɟᴉɔɐʇǝs ɐɟʇǝɹ ɐ ɔønɹsǝ ɥɐs sʇɐɹʇǝd; lǝɐɹnǝɹs ʍɥø ɥɐʌǝ ɐlɹǝɐdʎ ǝɐɹnǝd ɔǝɹʇᴉɟᴉɔɐʇǝs ʍᴉll nø lønƃǝɹ bǝ ɐblǝ ʇø ɐɔɔǝss ʇɥǝɯ.

source: Details & Schedule
rtl: يثفشهمس & سذاثيعمث

source: Grading
rtl: لقشيهرل

source: Course Team
rtl: ذخعقسث فثشو

source: Advanced Settings
rtl: شيدشرذثي سثففهرلس

source: Proctored Exam Settings
rtl: حقخذفخقثي ثطشو سثففهرلس

source: Checklists
rtl: ذاثذنمهسفس

source: Tools
rtl: فخخمس

source: Duplicate
rtl: يعحمهذشفث

source: Duplicate this component
rtl: يعحمهذشفث فاهس ذخوحخرثرف

source: Move
rtl: وخدث

source: Delete this component
rtl: يثمثفث فاهس ذخوحخرثرف

source: Drag to reorder
rtl: يقشل فخ قثخقيثق

source: Page Actions
rtl: حشلث شذفهخرس

source: Open the courseware in the LMS
rtl: خحثر فاث ذخعقسثصشقث هر فاث موس

source: View Live Version
rtl: دهثص مهدث دثقسهخر

source: Preview the courseware in the LMS
rtl: حقثدهثص فاث ذخعقسثصشقث هر فاث موس

source: Adding components
rtl: شييهرل ذخوحخرثرفس

source: Select a component type under {strong_start}Add New Component{strong_end}. Then select a template.
rtl: سثمثذف ش ذخوحخرثرف فغحث عريثق {strong_start}شيي رثص ذخوحخرثرف{strong_end}. فاثر سثمثذف ش فثوحمشفث.Sǝlǝɔʇ ɐ ɔøɯdønǝnʇ ʇʎdǝ nndǝɹ {strong_start}Ⱥdd Nǝʍ Ȼøɯdønǝnʇ{strong_end}. Ŧɥǝn sǝlǝɔʇ ɐ ʇǝɯdlɐʇǝ.

source: The new component is added at the bottom of the page or group. You can then edit and move the component.
rtl: فاث رثص ذخوحخرثرف هس شييثي شف فاث زخففخو خب فاث حشلث خق لقخعح. غخع ذشر فاثر ثيهف شري وخدث فاث ذخوحخرثرف.

source: Editing components
rtl: ثيهفهرل ذخوحخرثرفسŦɥǝ nǝʍ ɔøɯdønǝnʇ ᴉs ɐddǝd ɐʇ ʇɥǝ bøʇʇøɯ øɟ ʇɥǝ dɐƃǝ øɹ ƃɹønd. Ɏøn ɔɐn ʇɥǝn ǝdᴉʇ ɐnd ɯøʌǝ ʇɥǝ ɔøɯdønǝnʇ.

source: Click the {strong_start}Edit{strong_end} icon in a component to edit its content.
rtl: ذمهذن فاث {strong_start}ثيهف{strong_end} هذخر هر ش ذخوحخرثرف فخ ثيهف هفس ذخرفثرف.

source: Reorganizing components
rtl: قثخقلشرهظهرل ذخوحخرثرفس

source: Drag components to new locations within this component.
rtl: يقشل ذخوحخرثرفس فخ رثص مخذشفهخرس صهفاهر فاهس ذخوحخرثرف.

source: For content experiments, you can drag components to other groups.
rtl: بخق ذخرفثرف ثطحثقهوثرفس, غخع ذشر يقشل ذخوحخرثرفس فخ خفاثق لقخعحس.

source: Working with content experiments
rtl: صخقنهرل صهفا ذخرفثرف ثطحثقهوثرفسȻlᴉɔʞ ʇɥǝ {strong_start}Ɇdᴉʇ{strong_end} ᴉɔøn ᴉn ɐ ɔøɯdønǝnʇ ʇø ǝdᴉʇ ᴉʇs ɔønʇǝnʇ.

source: Confirm that you have properly configured content in each of your experiment groups.
rtl: ذخربهقو فاشف غخع اشدث حقخحثقمغ ذخربهلعقثي ذخرفثرف هر ثشذا خب غخعق ثطحثقهوثرف لقخعحس.

source: Learn more about component containers
rtl: مثشقر وخقث شزخعف ذخوحخرثرف ذخرفشهرثقس

source: Unit Location
rtl: عرهف مخذشفهخر

source: Location ID
rtl: مخذشفهخر هيȻønɟᴉɹɯ ʇɥɐʇ ʎøn ɥɐʌǝ dɹødǝɹlʎ ɔønɟᴉƃnɹǝd ɔønʇǝnʇ ᴉn ǝɐɔɥ øɟ ʎønɹ ǝxdǝɹᴉɯǝnʇ ƃɹønds.

source: To create a link to this unit from an HTML component in this course, enter "/jump_to_id/<location ID>" as the URL value.
rtl: فخ ذقثشفث ش مهرن فخ فاهس عرهف بقخو شر افوم ذخوحخرثرف هر فاهس ذخعقسث, ثرفثق "/تعوح_فخ_هي/<location ID>" شس فاث عقم دشمعث.

source: Create a Course Rerun of:
rtl: ذقثشفث ش ذخعقسث قثقعر خب:

source: Create a re-run of a course
rtl: ذقثشفث ش قث-قعر خب ش ذخعقسث

source: You are creating a re-run from:
rtl: غخع شقث ذقثشفهرل ش قث-قعر بقخو:Ŧø ɔɹǝɐʇǝ ɐ lᴉnʞ ʇø ʇɥᴉs nnᴉʇ ɟɹøɯ ɐn ĦŦMŁ ɔøɯdønǝnʇ ᴉn ʇɥᴉs ɔønɹsǝ, ǝnʇǝɹ "/ɾnɯd_ʇø_ᴉd/<location ID>" ɐs ʇɥǝ ɄɌŁ ʌɐlnǝ.

source: Provide identifying information for this re-run of the course. The original course is not affected in any way by a re-run.
rtl: حقخدهيث هيثرفهبغهرل هربخقوشفهخر بخق فاهس قث-قعر خب فاث ذخعقسث. فاث خقهلهرشم ذخعقسث هس رخف شببثذفثي هر شرغ صشغ زغ ش قث-قعر.Ᵽɹøʌᴉdǝ ᴉdǝnʇᴉɟʎᴉnƃ ᴉnɟøɹɯɐʇᴉøn ɟøɹ ʇɥᴉs ɹǝ-ɹnn øɟ ʇɥǝ ɔønɹsǝ. Ŧɥǝ øɹᴉƃᴉnɐl ɔønɹsǝ ᴉs nøʇ ɐɟɟǝɔʇǝd ᴉn ɐnʎ ʍɐʎ bʎ ɐ ɹǝ-ɹnn.

source: Note: Together, the organization, course number, and course run must uniquely identify this new course instance.
rtl: رخفث: فخلثفاثق, فاث خقلشرهظشفهخر, ذخعقسث رعوزثق, شري ذخعقسث قعر وعسف عرهضعثمغ هيثرفهبغ فاهس رثص ذخعقسث هرسفشرذث.

source: Required Information to Create a re-run of a course
rtl: قثضعهقثي هربخقوشفهخر فخ ذقثشفث ش قث-قعر خب ش ذخعقسثNøʇǝ: Ŧøƃǝʇɥǝɹ, ʇɥǝ øɹƃɐnᴉzɐʇᴉøn, ɔønɹsǝ nnɯbǝɹ, ɐnd ɔønɹsǝ ɹnn ɯnsʇ nnᴉbnǝlʎ ᴉdǝnʇᴉɟʎ ʇɥᴉs nǝʍ ɔønɹsǝ ᴉnsʇɐnɔǝ.

source: e.g. Introduction to Computer Science
rtl: ث.ل. هرفقخيعذفهخر فخ ذخوحعفثق سذهثرذث

source: The public display name for the new course. (This name is often the same as the original course name.)
rtl: فاث حعزمهذ يهسحمشغ رشوث بخق فاث رثص ذخعقسث. (فاهس رشوث هس خبفثر فاث سشوث شس فاث خقهلهرشم ذخعقسث رشوث.)Ŧɥǝ dnblᴉɔ dᴉsdlɐʎ nɐɯǝ ɟøɹ ʇɥǝ nǝʍ ɔønɹsǝ. (Ŧɥᴉs nɐɯǝ ᴉs øɟʇǝn ʇɥǝ sɐɯǝ ɐs ʇɥǝ øɹᴉƃᴉnɐl ɔønɹsǝ nɐɯǝ.)

source: Organization
rtl: خقلشرهظشفهخر

source: e.g. UniversityX or OrganizationX
rtl: ث.ل. عرهدثقسهفغط خق خقلشرهظشفهخرط

source: The name of the organization sponsoring the new course. (This name is often the same as the original organization name.)
rtl: فاث رشوث خب فاث خقلشرهظشفهخر سحخرسخقهرل فاث رثص ذخعقسث. (فاهس رشوث هس خبفثر فاث سشوث شس فاث خقهلهرشم خقلشرهظشفهخر رشوث.)

source: Note: No spaces or special characters are allowed.
rtl: رخفث: رخ سحشذثس خق سحثذهشم ذاشقشذفثقس شقث شممخصثي.Ŧɥǝ nɐɯǝ øɟ ʇɥǝ øɹƃɐnᴉzɐʇᴉøn sdønsøɹᴉnƃ ʇɥǝ nǝʍ ɔønɹsǝ. (Ŧɥᴉs nɐɯǝ ᴉs øɟʇǝn ʇɥǝ sɐɯǝ ɐs ʇɥǝ øɹᴉƃᴉnɐl øɹƃɐnᴉzɐʇᴉøn nɐɯǝ.)

source: e.g. CS101
rtl: ث.ل. ذس101

source: The unique number that identifies the new course within the organization. (This number will be the same as the original course number and cannot be changed.)
rtl: فاث عرهضعث رعوزثق فاشف هيثرفهبهثس فاث رثص ذخعقسث صهفاهر فاث خقلشرهظشفهخر. (فاهس رعوزثق صهمم زث فاث سشوث شس فاث خقهلهرشم ذخعقسث رعوزثق شري ذشررخف زث ذاشرلثي.)Ŧɥǝ nnᴉbnǝ nnɯbǝɹ ʇɥɐʇ ᴉdǝnʇᴉɟᴉǝs ʇɥǝ nǝʍ ɔønɹsǝ ʍᴉʇɥᴉn ʇɥǝ øɹƃɐnᴉzɐʇᴉøn. (Ŧɥᴉs nnɯbǝɹ ʍᴉll bǝ ʇɥǝ sɐɯǝ ɐs ʇɥǝ øɹᴉƃᴉnɐl ɔønɹsǝ nnɯbǝɹ ɐnd ɔɐnnøʇ bǝ ɔɥɐnƃǝd.)

source: e.g. 2014_T1
rtl: ث.ل. 2014_ف1
