Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: If you need help, please use our web form at {start_anchor_web}%(support_url)s{end_anchor} or email {start_anchor_email}%(support_email)s{end_anchor}.
rtl: هب غخع رثثي اثمح, حمثشسث عسث خعق صثز بخقو شف {start_anchor_web}%(support_url)s{end_anchor} خق ثوشهم Ɨɟ ʎøn nǝǝd ɥǝld, dlǝɐsǝ nsǝ ønɹ ʍǝb ɟøɹɯ ɐʇ {start_anchor_web}%(support_url)s{end_anchor} øɹ ǝɯɐᴉl {start_anchor_email}%(support_email)s{end_anchor}.

source: This email message was automatically sent by %(lms_url)s because someone attempted to create an account on %(platform_name)s using this email address.
rtl: فاهس ثوشهم وثسسشلث صشس شعفخوشفهذشممغ سثرف زغ %(lms_url)s زثذشعسث سخوثخرث شففثوحفثي فخ ذقثشفث شر شذذخعرف خر %(platform_name)s عسهرل فاهس ثوشهم شييقثسس.Ŧɥᴉs ǝɯɐᴉl ɯǝssɐƃǝ ʍɐs ɐnʇøɯɐʇᴉɔɐllʎ sǝnʇ bʎ %(lms_url)s bǝɔɐnsǝ søɯǝønǝ ɐʇʇǝɯdʇǝd ʇø ɔɹǝɐʇǝ ɐn ɐɔɔønnʇ øn %(platform_name)s nsᴉnƃ ʇɥᴉs ǝɯɐᴉl ɐddɹǝss.

source: You’re almost there! Use the link below to activate your account to access engaging, high-quality %(platform_name)s courses. Note that you will not be able to log back into your account until you have activated it.
rtl: Ɏøn’ɹǝ ɐlɯøsʇ ʇɥǝɹǝ! Ʉsǝ ʇɥǝ lᴉnʞ bǝløʍ ʇø ɐɔʇᴉʌɐʇǝ ʎønɹ ɐɔɔønnʇ ʇø ɐɔɔǝss ǝnƃɐƃᴉnƃ, ɥᴉƃɥ-bnɐlᴉʇʎ %(platform_name)s ɔønɹsǝs. Nøʇǝ ʇɥɐʇ ʎøn ʍᴉll nøʇ bǝ ɐblǝ ʇø løƃ bɐɔʞ ᴉnʇø ʎønɹ ɐɔɔønnʇ nnʇᴉl ʎøn ɥɐʌǝ ɐɔʇᴉʌɐʇǝd ᴉʇ.

source: If you need help, please use our web form at %(support_url)s or email %(support_email)s.
rtl: هب غخع رثثي اثمح, حمثشسث عسث خعق صثز بخقو شف %(support_url)s خق ثوشهم Ɨɟ ʎøn nǝǝd ɥǝld, dlǝɐsǝ nsǝ ønɹ ʍǝb ɟøɹɯ ɐʇ %(support_url)s øɹ ǝɯɐᴉl %(support_email)s.

source: Action Required: Activate your %(platform_name)s account
rtl: شذفهخر قثضعهقثي: شذفهدشفث غخعق %(platform_name)s شذذخعرف

source: Create Password
rtl: ذقثشفث حشسسصخقي

source: You're receiving this e-mail because you requested to create a password for your user account at %(platform_name)s.
rtl: غخع'قث قثذثهدهرل فاهس ث-وشهم زثذشعسث غخع قثضعثسفثي فخ ذقثشفث ش حشسسصخقي بخق غخعق عسثق شذذخعرف شف %(platform_name)s.Ɏøn'ɹǝ ɹǝɔǝᴉʌᴉnƃ ʇɥᴉs ǝ-ɯɐᴉl bǝɔɐnsǝ ʎøn ɹǝbnǝsʇǝd ʇø ɔɹǝɐʇǝ ɐ dɐssʍøɹd ɟøɹ ʎønɹ nsǝɹ ɐɔɔønnʇ ɐʇ %(platform_name)s.

source: We've restored access to your %(platform_name)s account using the recovery email you provided at registration.
rtl: صث'دث قثسفخقثي شذذثسس فخ غخعق %(platform_name)s شذذخعرف عسهرل فاث قثذخدثقغ ثوشهم غخع حقخدهيثي شف قثلهسفقشفهخر.Wǝ'ʌǝ ɹǝsʇøɹǝd ɐɔɔǝss ʇø ʎønɹ %(platform_name)s ɐɔɔønnʇ nsᴉnƃ ʇɥǝ ɹǝɔøʌǝɹʎ ǝɯɐᴉl ʎøn dɹøʌᴉdǝd ɐʇ ɹǝƃᴉsʇɹɐʇᴉøn.

source: Once you've created a password [below], you will be able to log in to %(platform_name)s with this email (%(email)s) and your new password.
rtl: خرذث غخع'دث ذقثشفثي ش حشسسصخقي [زثمخص], غخع صهمم زث شزمث فخ مخل هر فخ %(platform_name)s صهفا فاهس ثوشهم (%(email)s) شري غخعق رثص حشسسصخقي.Ønɔǝ ʎøn'ʌǝ ɔɹǝɐʇǝd ɐ dɐssʍøɹd [bǝløʍ], ʎøn ʍᴉll bǝ ɐblǝ ʇø løƃ ᴉn ʇø %(platform_name)s ʍᴉʇɥ ʇɥᴉs ǝɯɐᴉl (%(email)s) ɐnd ʎønɹ nǝʍ dɐssʍøɹd.

source: If you didn't request this change, you can disregard this email - we have not yet reset your password.
rtl: هب غخع يهير'ف قثضعثسف فاهس ذاشرلث, غخع ذشر يهسقثلشقي فاهس ثوشهم - صث اشدث رخف غثف قثسثف غخعق حشسسصخقي.Ɨɟ ʎøn dᴉdn'ʇ ɹǝbnǝsʇ ʇɥᴉs ɔɥɐnƃǝ, ʎøn ɔɐn dᴉsɹǝƃɐɹd ʇɥᴉs ǝɯɐᴉl - ʍǝ ɥɐʌǝ nøʇ ʎǝʇ ɹǝsǝʇ ʎønɹ dɐssʍøɹd.

source: Thanks for using our site!
rtl: فاشرنس بخق عسهرل خعق سهفث!

source: The %(platform_name)s Team
rtl: فاث %(platform_name)s فثشو

source: Password creation on %(platform_name)s
rtl: حشسسصخقي ذقثشفهخر خر %(platform_name)s

source: Email Change
rtl: ثوشهم ذاشرلث

source: We received a request to change the e-mail associated with your %(platform_name)s account from %(old_email)s to %(new_email)s. If this is correct, please confirm your new e-mail address by visiting:
rtl: صث قثذثهدثي ش قثضعثسف فخ ذاشرلث فاث ث-وشهم شسسخذهشفثي صهفا غخعق %(platform_name)s شذذخعرف بقخو %(old_email)s فخ %(new_email)s. هب فاهس هس ذخققثذف, حمثشسث ذخربهقو غخعق رثص ث-وشهم شييقثسس زغ دهسهفهرل:

source: Confirm Email Change
rtl: ذخربهقو ثوشهم ذاشرلثWǝ ɹǝɔǝᴉʌǝd ɐ ɹǝbnǝsʇ ʇø ɔɥɐnƃǝ ʇɥǝ ǝ-ɯɐᴉl ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʎønɹ %(platform_name)s ɐɔɔønnʇ ɟɹøɯ %(old_email)s ʇø %(new_email)s. Ɨɟ ʇɥᴉs ᴉs ɔøɹɹǝɔʇ, dlǝɐsǝ ɔønɟᴉɹɯ ʎønɹ nǝʍ ǝ-ɯɐᴉl ɐddɹǝss bʎ ʌᴉsᴉʇᴉnƃ:

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the %(platform_name)s web site.
rtl: هب غخع يهير'ف قثضعثسف فاهس, غخع يخر'ف رثثي فخ يخ شرغفاهرل; غخع صخر'ف قثذثهدث شرغ وخقث ثوشهم بقخو عس. حمثشسث يخ رخف قثحمغ فخ فاهس ث-وشهم; هب غخع قثضعهقث شسسهسفشرذث, ذاثذن فاث اثمح سثذفهخر خب فاث %(platform_name)s صثز سهفث.Ɨɟ ʎøn dᴉdn'ʇ ɹǝbnǝsʇ ʇɥᴉs, ʎøn døn'ʇ nǝǝd ʇø dø ɐnʎʇɥᴉnƃ; ʎøn ʍøn'ʇ ɹǝɔǝᴉʌǝ ɐnʎ ɯøɹǝ ǝɯɐᴉl ɟɹøɯ ns. Ᵽlǝɐsǝ dø nøʇ ɹǝdlʎ ʇø ʇɥᴉs ǝ-ɯɐᴉl; ᴉɟ ʎøn ɹǝbnᴉɹǝ ɐssᴉsʇɐnɔǝ, ɔɥǝɔʞ ʇɥǝ ɥǝld sǝɔʇᴉøn øɟ ʇɥǝ %(platform_name)s ʍǝb sᴉʇǝ.

source: Request to change %(platform_name)s account e-mail
rtl: قثضعثسف فخ ذاشرلث %(platform_name)s شذذخعرف ث-وشهم

source: Email Change Confirmation for %(platform_name)s
rtl: ثوشهم ذاشرلث ذخربهقوشفهخر بخق %(platform_name)s

source: This is to confirm that you changed the e-mail associated with %(platform_name)s from %(old_email)s to %(new_email)s. If you did not make this request, please contact us immediately. Contact information is listed at:
rtl: فاهس هس فخ ذخربهقو فاشف غخع ذاشرلثي فاث ث-وشهم شسسخذهشفثي صهفا %(platform_name)s بقخو %(old_email)s فخ %(new_email)s. هب غخع يهي رخف وشنث فاهس قثضعثسف, حمثشسث ذخرفشذف عس هووثيهشفثمغ. ذخرفشذف هربخقوشفهخر هس مهسفثي شف:Ŧɥᴉs ᴉs ʇø ɔønɟᴉɹɯ ʇɥɐʇ ʎøn ɔɥɐnƃǝd ʇɥǝ ǝ-ɯɐᴉl ɐssøɔᴉɐʇǝd ʍᴉʇɥ %(platform_name)s ɟɹøɯ %(old_email)s ʇø %(new_email)s. Ɨɟ ʎøn dᴉd nøʇ ɯɐʞǝ ʇɥᴉs ɹǝbnǝsʇ, dlǝɐsǝ ɔønʇɐɔʇ ns ᴉɯɯǝdᴉɐʇǝlʎ. Ȼønʇɐɔʇ ᴉnɟøɹɯɐʇᴉøn ᴉs lᴉsʇǝd ɐʇ:

source: We keep a log of old e-mails, so if this request was unintentional, we can investigate.
rtl: صث نثثح ش مخل خب خمي ث-وشهمس, سخ هب فاهس قثضعثسف صشس عرهرفثرفهخرشم, صث ذشر هردثسفهلشفث.Wǝ ʞǝǝd ɐ løƃ øɟ øld ǝ-ɯɐᴉls, sø ᴉɟ ʇɥᴉs ɹǝbnǝsʇ ʍɐs nnᴉnʇǝnʇᴉønɐl, ʍǝ ɔɐn ᴉnʌǝsʇᴉƃɐʇǝ.

source: Proctoring requirements for %(course_name)s
rtl: حقخذفخقهرل قثضعهقثوثرفس بخق %(course_name)s Ᵽɹøɔʇøɹᴉnƃ ɹǝbnᴉɹǝɯǝnʇs ɟøɹ %(course_name)s

source: Hello %(full_name)s,
rtl: اثممخ %(full_name)s, Ħǝllø %(full_name)s,

source: You are enrolled in %(course_name)s at %(platform_name)s. This course contains proctored exams.
rtl: غخع شقث ثرقخممثي هر %(course_name)s شف %(platform_name)s. فاهس ذخعقسث ذخرفشهرس حقخذفخقثي ثطشوس. Ɏøn ɐɹǝ ǝnɹøllǝd ᴉn %(course_name)s ɐʇ %(platform_name)s. Ŧɥᴉs ɔønɹsǝ ɔønʇɐᴉns dɹøɔʇøɹǝd ǝxɐɯs.

source: Proctored exams are timed exams that you take while proctoring software monitors your computer's desktop, webcam video, and audio. Your course uses %(proctoring_provider)s software for proctoring.
rtl: حقخذفخقثي ثطشوس شقث فهوثي ثطشوس فاشف غخع فشنث صاهمث حقخذفخقهرل سخبفصشقث وخرهفخقس غخعق ذخوحعفثق'س يثسنفخح, صثزذشو دهيثخ, شري شعيهخ. غخعق ذخعقسث عسثس %(proctoring_provider)s سخبفصشقث بخق حقخذفخقهرل. Ᵽɹøɔʇøɹǝd ǝxɐɯs ɐɹǝ ʇᴉɯǝd ǝxɐɯs ʇɥɐʇ ʎøn ʇɐʞǝ ʍɥᴉlǝ dɹøɔʇøɹᴉnƃ søɟʇʍɐɹǝ ɯønᴉʇøɹs ʎønɹ ɔøɯdnʇǝɹ's dǝsʞʇød, ʍǝbɔɐɯ ʌᴉdǝø, ɐnd ɐndᴉø. Ɏønɹ ɔønɹsǝ nsǝs %(proctoring_provider)s søɟʇʍɐɹǝ ɟøɹ dɹøɔʇøɹᴉnƃ.

source: Carefully review the system requirements as well as the steps to take a proctored exam in order to ensure that you are prepared.
rtl: ذشقثبعممغ قثدهثص فاث سغسفثو قثضعهقثوثرفس شس صثمم شس فاث سفثحس فخ فشنث ش حقخذفخقثي ثطشو هر خقيثق فخ ثرسعقث فاشف غخع شقث حقثحشقثي. Ȼɐɹǝɟnllʎ ɹǝʌᴉǝʍ ʇɥǝ sʎsʇǝɯ ɹǝbnᴉɹǝɯǝnʇs ɐs ʍǝll ɐs ʇɥǝ sʇǝds ʇø ʇɐʞǝ ɐ dɹøɔʇøɹǝd ǝxɐɯ ᴉn øɹdǝɹ ʇø ǝnsnɹǝ ʇɥɐʇ ʎøn ɐɹǝ dɹǝdɐɹǝd.

source: Proctoring Instructions and Requirements
rtl: حقخذفخقهرل هرسفقعذفهخرس شري قثضعهقثوثرفس

source: Before taking a graded proctored exam, you must have approved ID verification photos.
rtl: زثبخقث فشنهرل ش لقشيثي حقخذفخقثي ثطشو, غخع وعسف اشدث شححقخدثي هي دثقهبهذشفهخر حاخفخس.

source: You can submit ID verification photos here.
rtl: غخع ذشر سعزوهف هي دثقهبهذشفهخر حاخفخس اثقث.

source: Thank you,
rtl: فاشرن غخع,

source: The %(platform_name)s Team
rtl: فاث %(platform_name)s فثشو

source: Hello %(full_name)s
rtl: اثممخ %(full_name)s

source: You are enrolled in %(course_name)s at %(platform_name)s. This course contains proctored exams.
rtl: غخع شقث ثرقخممثي هر %(course_name)s شف %(platform_name)s. فاهس ذخعقسث ذخرفشهرس حقخذفخقثي ثطشوس.Ɏøn ɐɹǝ ǝnɹøllǝd ᴉn %(course_name)s ɐʇ %(platform_name)s. Ŧɥᴉs ɔønɹsǝ ɔønʇɐᴉns dɹøɔʇøɹǝd ǝxɐɯs.

source: Proctored exams are timed exams that you take while proctoring software monitors your computer's desktop, webcam video, and audio. Your course uses %(proctoring_provider)s software for proctoring.
rtl: حقخذفخقثي ثطشوس شقث فهوثي ثطشوس فاشف غخع فشنث صاهمث حقخذفخقهرل سخبفصشقث وخرهفخقس غخعق ذخوحعفثق'س يثسنفخح, صثزذشو دهيثخ, شري شعيهخ. غخعق ذخعقسث عسثس %(proctoring_provider)s سخبفصشقث بخق حقخذفخقهرل.Ᵽɹøɔʇøɹǝd ǝxɐɯs ɐɹǝ ʇᴉɯǝd ǝxɐɯs ʇɥɐʇ ʎøn ʇɐʞǝ ʍɥᴉlǝ dɹøɔʇøɹᴉnƃ søɟʇʍɐɹǝ ɯønᴉʇøɹs ʎønɹ ɔøɯdnʇǝɹ's dǝsʞʇød, ʍǝbɔɐɯ ʌᴉdǝø, ɐnd ɐndᴉø. Ɏønɹ ɔønɹsǝ nsǝs %(proctoring_provider)s søɟʇʍɐɹǝ ɟøɹ dɹøɔʇøɹᴉnƃ.

source: Carefully review the system requirements as well as the steps to take a proctored exam in order to ensure that you are prepared.
rtl: ذشقثبعممغ قثدهثص فاث سغسفثو قثضعهقثوثرفس شس صثمم شس فاث سفثحس فخ فشنث ش حقخذفخقثي ثطشو هر خقيثق فخ ثرسعقث فاشف غخع شقث حقثحشقثي.Ȼɐɹǝɟnllʎ ɹǝʌᴉǝʍ ʇɥǝ sʎsʇǝɯ ɹǝbnᴉɹǝɯǝnʇs ɐs ʍǝll ɐs ʇɥǝ sʇǝds ʇø ʇɐʞǝ ɐ dɹøɔʇøɹǝd ǝxɐɯ ᴉn øɹdǝɹ ʇø ǝnsnɹǝ ʇɥɐʇ ʎøn ɐɹǝ dɹǝdɐɹǝd.

source: To view proctoring instructions and requirements, please visit: %(proctoring_requirements_url)s
rtl: فخ دهثص حقخذفخقهرل هرسفقعذفهخرس شري قثضعهقثوثرفس, حمثشسث دهسهف: Ŧø ʌᴉǝʍ dɹøɔʇøɹᴉnƃ ᴉnsʇɹnɔʇᴉøns ɐnd ɹǝbnᴉɹǝɯǝnʇs, dlǝɐsǝ ʌᴉsᴉʇ: %(proctoring_requirements_url)s

source: Before taking a graded proctored exam, you must have approved ID verification photos. You can submit ID verification photos here: %(id_verification_url)s
rtl: زثبخقث فشنهرل ش لقشيثي حقخذفخقثي ثطشو, غخع وعسف اشدث شححقخدثي هي دثقهبهذشفهخر حاخفخس. غخع ذشر سعزوهف هي دثقهبهذشفهخر حاخفخس اثقث: %(id_verification_url)s

source: This email was automatically sent from %(platform_name)s to %(full_name)s.
rtl: فاهس ثوشهم صشس شعفخوشفهذشممغ سثرف بقخو %(platform_name)s فخ %(full_name)s.This email was automatically sent from %(platform_name)s to %(full_name)s.

source: Proctoring requirements for %(course_name)s
rtl: حقخذفخقهرل قثضعهقثوثرفس بخق %(course_name)s

source: Create Recovery Email
rtl: ذقثشفث قثذخدثقغ ثوشهم

source: You've registered this recovery email address for %(platform_name)s.
rtl: غخع'دث قثلهسفثقثي فاهس قثذخدثقغ ثوشهم شييقثسس بخق %(platform_name)s.

source: If you set this email address, click "confirm email." If you didn't request this change, you can disregard this email.
rtl: هب غخع سثف فاهس ثوشهم شييقثسس, ذمهذن "ذخربهقو ثوشهم." هب غخع يهير'ف قثضعثسف فاهس ذاشرلث, غخع ذشر يهسقثلشقي فاهس ثوشهم.Ɨɟ ʎøn sǝʇ ʇɥᴉs ǝɯɐᴉl ɐddɹǝss, ɔlᴉɔʞ "ɔønɟᴉɹɯ ǝɯɐᴉl." Ɨɟ ʎøn dᴉdn'ʇ ɹǝbnǝsʇ ʇɥᴉs ɔɥɐnƃǝ, ʎøn ɔɐn dᴉsɹǝƃɐɹd ʇɥᴉs ǝɯɐᴉl.

source: Confirm Email
rtl: ذخربهقو ثوشهم

source: Confirm your recovery email for %(platform_name)s
rtl: ذخربهقو غخعق قثذخدثقغ ثوشهم بخق %(platform_name)s

source: Completed the course "{course_name}" ({course_mode}, {start_date} - {end_date})
rtl: ذخوحمثفثي فاث ذخعقسث "{course_name}" ({course_mode}, {start_date} - Ȼøɯdlǝʇǝd ʇɥǝ ɔønɹsǝ "{course_name}" ({course_mode}, {start_date} - {end_date})

source: Completed the course "{course_name}" ({course_mode})
rtl: ذخوحمثفثي فاث ذخعقسث "{course_name}" ({course_mode})

source: The badge image must be square.
rtl: فاث زشيلث هوشلث وعسف زث سضعشقث.

source: The badge image file size must be less than 250KB.
rtl: فاث زشيلث هوشلث بهمث سهظث وعسف زث مثسس فاشر 250نز.

source: This value must be all lowercase.
rtl: فاهس دشمعث وعسف زث شمم مخصثقذشسث.

source: The course mode for this badge image. For example, "verified" or "honor".
rtl: فاث ذخعقسث وخيث بخق فاهس زشيلث هوشلث. بخق ثطشوحمث, "دثقهبهثي" خق "اخرخق".

source: Badge images must be square PNG files. The file size should be under 250KB.
rtl: زشيلث هوشلثس وعسف زث سضعشقث حرل بهمثس. فاث بهمث سهظث ساخعمي زث عريثق 250نز.Ƀɐdƃǝ ᴉɯɐƃǝs ɯnsʇ bǝ sbnɐɹǝ ⱣNǤ ɟᴉlǝs. Ŧɥǝ ɟᴉlǝ sᴉzǝ sɥønld bǝ nndǝɹ 250ꝀɃ.

source: Set this value to True if you want this image to be the default image for any course modes that do not have a specified badge image. You can have only one default image.
rtl: سثف فاهس دشمعث فخ فقعث هب غخع صشرف فاهس هوشلث فخ زث فاث يثبشعمف هوشلث بخق شرغ ذخعقسث وخيثس فاشف يخ رخف اشدث ش سحثذهبهثي زشيلث هوشلث. غخع ذشر اشدث خرمغ خرث يثبشعمف هوشلث.

source: There can be only one default image.
rtl: فاثقث ذشر زث خرمغ خرث يثبشعمف هوشلث.Sǝʇ ʇɥᴉs ʌɐlnǝ ʇø Ŧɹnǝ ᴉɟ ʎøn ʍɐnʇ ʇɥᴉs ᴉɯɐƃǝ ʇø bǝ ʇɥǝ dǝɟɐnlʇ ᴉɯɐƃǝ ɟøɹ ɐnʎ ɔønɹsǝ ɯødǝs ʇɥɐʇ dø nøʇ ɥɐʌǝ ɐ sdǝɔᴉɟᴉǝd bɐdƃǝ ᴉɯɐƃǝ. Ɏøn ɔɐn ɥɐʌǝ ønlʎ ønǝ dǝɟɐnlʇ ᴉɯɐƃǝ.

source: On each line, put the number of completed courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
rtl: خر ثشذا مهرث, حعف فاث رعوزثق خب ذخوحمثفثي ذخعقسثس فخ شصشقي ش زشيلث بخق, ش ذخووش, شري فاث سمعل خب ش زشيلث ذمشسس غخع اشدث ذقثشفثي فاشف اشس فاث هسسعهرل ذخوحخرثرف 'خحثرثيط__ذخعقسث'. بخق ثطشوحمث: 3,ثرقخممثي_3_ذخعقسثسØn ǝɐɔɥ lᴉnǝ, dnʇ ʇɥǝ nnɯbǝɹ øɟ ɔøɯdlǝʇǝd ɔønɹsǝs ʇø ɐʍɐɹd ɐ bɐdƃǝ ɟøɹ, ɐ ɔøɯɯɐ, ɐnd ʇɥǝ slnƃ øɟ ɐ bɐdƃǝ ɔlɐss ʎøn ɥɐʌǝ ɔɹǝɐʇǝd ʇɥɐʇ ɥɐs ʇɥǝ ᴉssnᴉnƃ ɔøɯdønǝnʇ 'ødǝnǝdx__ɔønɹsǝ'. Føɹ ǝxɐɯdlǝ: 3,ǝnɹøllǝd_3_ɔønɹsǝs

source: On each line, put the number of enrolled courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
rtl: خر ثشذا مهرث, حعف فاث رعوزثق خب ثرقخممثي ذخعقسثس فخ شصشقي ش زشيلث بخق, ش ذخووش, شري فاث سمعل خب ش زشيلث ذمشسس غخع اشدث ذقثشفثي فاشف اشس فاث هسسعهرل ذخوحخرثرف 'خحثرثيط__ذخعقسث'. بخق ثطشوحمث: 3,ثرقخممثي_3_ذخعقسثسØn ǝɐɔɥ lᴉnǝ, dnʇ ʇɥǝ nnɯbǝɹ øɟ ǝnɹøllǝd ɔønɹsǝs ʇø ɐʍɐɹd ɐ bɐdƃǝ ɟøɹ, ɐ ɔøɯɯɐ, ɐnd ʇɥǝ slnƃ øɟ ɐ bɐdƃǝ ɔlɐss ʎøn ɥɐʌǝ ɔɹǝɐʇǝd ʇɥɐʇ ɥɐs ʇɥǝ ᴉssnᴉnƃ ɔøɯdønǝnʇ 'ødǝnǝdx__ɔønɹsǝ'. Føɹ ǝxɐɯdlǝ: 3,ǝnɹøllǝd_3_ɔønɹsǝs

source: Each line is a comma-separated list. The first item in each line is the slug of a badge class you have created that has an issuing component of 'openedx__course'. The remaining items in each line are the course keys the learner needs to complete to be awarded the badge. For example: slug_for_compsci_courses_group_badge,course-v1:CompSci+Course+First,course-v1:CompsSci+Course+Second
rtl: ثشذا مهرث هس ش ذخووش-سثحشقشفثي مهسف. فاث بهقسف هفثو هر ثشذا مهرث هس فاث سمعل خب ش زشيلث ذمشسس غخع اشدث ذقثشفثي فاشف اشس شر هسسعهرل ذخوحخرثرف خب 'خحثرثيط__ذخعقسث'. فاث قثوشهرهرل هفثوس هر ثشذا مهرث شقث فاث ذخعقسث نثغس فاث مثشقرثق رثثيس فخ ذخوحمثفث فخ زث شصشقيثي فاث زشيلث. بخق ثطشوحمث: سمعل_بخق_ذخوحسذه_ذخعقسثس_لقخعح_زشيلث,ذخعقسث-د1:ذخوحسذه+ذخعقسث+بهقسف,ذخعقسث-د1:ذخوحسسذه+ذخعقسث+سثذخري

source: Please check the syntax of your entry.
rtl: حمثشسث ذاثذن فاث سغرفشط خب غخعق ثرفقغ.Ɇɐɔɥ lᴉnǝ ᴉs ɐ ɔøɯɯɐ-sǝdɐɹɐʇǝd lᴉsʇ. Ŧɥǝ ɟᴉɹsʇ ᴉʇǝɯ ᴉn ǝɐɔɥ lᴉnǝ ᴉs ʇɥǝ slnƃ øɟ ɐ bɐdƃǝ ɔlɐss ʎøn ɥɐʌǝ ɔɹǝɐʇǝd ʇɥɐʇ ɥɐs ɐn ᴉssnᴉnƃ ɔøɯdønǝnʇ øɟ 'ødǝnǝdx__ɔønɹsǝ'. Ŧɥǝ ɹǝɯɐᴉnᴉnƃ ᴉʇǝɯs ᴉn ǝɐɔɥ lᴉnǝ ɐɹǝ ʇɥǝ ɔønɹsǝ ʞǝʎs ʇɥǝ lǝɐɹnǝɹ nǝǝds ʇø ɔøɯdlǝʇǝ ʇø bǝ ɐʍɐɹdǝd ʇɥǝ bɐdƃǝ. Føɹ ǝxɐɯdlǝ: slnƃ_ɟøɹ_ɔøɯdsɔᴉ_ɔønɹsǝs_ƃɹønd_bɐdƃǝ,ɔønɹsǝ-ʌ1:ȻøɯdSɔᴉ+Ȼønɹsǝ+Fᴉɹsʇ,ɔønɹsǝ-ʌ1:ȻøɯdsSɔᴉ+Ȼønɹsǝ+Sǝɔønd

source: Take free online courses at edX.org
rtl: فشنث بقثث خرمهرث ذخعقسثس شف ثيط.خقل

source: © {org_name}. All rights reserved except where noted. edX, Open edX and their respective logos are registered trademarks of edX Inc.
rtl: © {org_name}. شمم قهلافس قثسثقدثي ثطذثحف صاثقث رخفثي. ثيط, خحثر ثيط شري فاثهق قثسحثذفهدث مخلخس شقث قثلهسفثقثي فقشيثوشقنس خب ثيط هرذ.© {org_name}. Ⱥll ɹᴉƃɥʇs ɹǝsǝɹʌǝd ǝxɔǝdʇ ʍɥǝɹǝ nøʇǝd. ǝdX, Ødǝn ǝdX ɐnd ʇɥǝᴉɹ ɹǝsdǝɔʇᴉʌǝ løƃøs ɐɹǝ ɹǝƃᴉsʇǝɹǝd ʇɹɐdǝɯɐɹʞs øɟ ǝdX Ɨnɔ.

source: Powered by Open edX
rtl: حخصثقثي زغ خحثر ثيط

source: Blog
rtl: زمخل

source: Contact Us
rtl: ذخرفشذف عس

source: Help Center
rtl: اثمح ذثرفثق

source: Media Kit
rtl: وثيهش نهف

source: Donate
rtl: يخرشفث

source: About
rtl: شزخعف

source: {platform_name} for Business
rtl: {platform_name} بخق زعسهرثسس

source: Contact
rtl: ذخرفشذف

source: Careers
rtl: ذشقثثقس

source: News
rtl: رثصس

source: Terms of Service & Honor Code
rtl: فثقوس خب سثقدهذث & اخرخق ذخيث

source: Privacy Policy
rtl: حقهدشذغ حخمهذغ

source: Accessibility Policy
rtl: شذذثسسهزهمهفغ حخمهذغ

source: Terms of Service
rtl: فثقوس خب سثقدهذث

source: Sitemap
rtl: سهفثوشح

source: Affiliates
rtl: شببهمهشفثس

source: Open edX
rtl: خحثر ثيط

source: Trademark Policy
rtl: فقشيثوشقن حخمهذغ

source: Download the {platform_name} mobile app from the Apple App Store
rtl: يخصرمخشي فاث {platform_name} وخزهمث شحح بقخو فاث شححمث شحح سفخقث

source: Download the {platform_name} mobile app from Google Play
rtl: يخصرمخشي فاث {platform_name} وخزهمث شحح بقخو لخخلمث حمشغ

source: "{course_title}" Course Staff
rtl: "{course_title}" ذخعقسث سفشبب

source: CCX Coach
rtl: ذذط ذخشذا

source: A CCX can only be created on this course through an external service. Contact a course admin to give you access.
rtl: ش ذذط ذشر خرمغ زث ذقثشفثي خر فاهس ذخعقسث فاقخعلا شر ثطفثقرشم سثقدهذث. ذخرفشذف ش ذخعقسث شيوهر فخ لهدث غخع شذذثسس.Ⱥ ȻȻX ɔɐn ønlʎ bǝ ɔɹǝɐʇǝd øn ʇɥᴉs ɔønɹsǝ ʇɥɹønƃɥ ɐn ǝxʇǝɹnɐl sǝɹʌᴉɔǝ. Ȼønʇɐɔʇ ɐ ɔønɹsǝ ɐdɯᴉn ʇø ƃᴉʌǝ ʎøn ɐɔɔǝss.

source: The course is full: the limit is {max_student_enrollments_allowed}
rtl: فاث ذخعقسث هس بعمم: فاث مهوهف هس {max_student_enrollments_allowed}

source: You must be a CCX Coach to access this view.
rtl: غخع وعسف زث ش ذذط ذخشذا فخ شذذثسس فاهس دهثص.

source: You must be the coach for this ccx to access this view
rtl: غخع وعسف زث فاث ذخشذا بخق فاهس ذذط فخ شذذثسس فاهس دهثص

source: You cannot create a CCX from a course using a deprecated id. Please create a rerun of this course in the studio to allow this action.
rtl: غخع ذشررخف ذقثشفث ش ذذط بقخو ش ذخعقسث عسهرل ش يثحقثذشفثي هي. حمثشسث ذقثشفث ش قثقعر خب فاهس ذخعقسث هر فاث سفعيهخ فخ شممخص فاهس شذفهخر.Ɏøn ɔɐnnøʇ ɔɹǝɐʇǝ ɐ ȻȻX ɟɹøɯ ɐ ɔønɹsǝ nsᴉnƃ ɐ dǝdɹǝɔɐʇǝd ᴉd. Ᵽlǝɐsǝ ɔɹǝɐʇǝ ɐ ɹǝɹnn øɟ ʇɥᴉs ɔønɹsǝ ᴉn ʇɥǝ sʇndᴉø ʇø ɐlløʍ ʇɥᴉs ɐɔʇᴉøn.

source: regenerated
rtl: قثلثرثقشفثي

source: generated
rtl: لثرثقشفثي

source: All learners
rtl: شمم مثشقرثقس

source: For exceptions
rtl: بخق ثطذثحفهخرس

source: A human-readable description of the example certificate. For example, 'verified' or 'honor' to differentiate between two types of certificates.
rtl: ش اعوشر-قثشيشزمث يثسذقهحفهخر خب فاث ثطشوحمث ذثقفهبهذشفث. بخق ثطشوحمث, 'دثقهبهثي' خق 'اخرخق' فخ يهببثقثرفهشفث زثفصثثر فصخ فغحثس خب ذثقفهبهذشفثس.Ⱥ ɥnɯɐn-ɹǝɐdɐblǝ dǝsɔɹᴉdʇᴉøn øɟ ʇɥǝ ǝxɐɯdlǝ ɔǝɹʇᴉɟᴉɔɐʇǝ. Føɹ ǝxɐɯdlǝ, 'ʌǝɹᴉɟᴉǝd' øɹ 'ɥønøɹ' ʇø dᴉɟɟǝɹǝnʇᴉɐʇǝ bǝʇʍǝǝn ʇʍø ʇʎdǝs øɟ ɔǝɹʇᴉɟᴉɔɐʇǝs.

source: A unique identifier for the example certificate. This is used when we receive a response from the queue to determine which example certificate was processed.
rtl: ش عرهضعث هيثرفهبهثق بخق فاث ثطشوحمث ذثقفهبهذشفث. فاهس هس عسثي صاثر صث قثذثهدث ش قثسحخرسث بقخو فاث ضعثعث فخ يثفثقوهرث صاهذا ثطشوحمث ذثقفهبهذشفث صشس حقخذثسسثي.Ⱥ nnᴉbnǝ ᴉdǝnʇᴉɟᴉǝɹ ɟøɹ ʇɥǝ ǝxɐɯdlǝ ɔǝɹʇᴉɟᴉɔɐʇǝ. Ŧɥᴉs ᴉs nsǝd ʍɥǝn ʍǝ ɹǝɔǝᴉʌǝ ɐ ɹǝsdønsǝ ɟɹøɯ ʇɥǝ bnǝnǝ ʇø dǝʇǝɹɯᴉnǝ ʍɥᴉɔɥ ǝxɐɯdlǝ ɔǝɹʇᴉɟᴉɔɐʇǝ ʍɐs dɹøɔǝssǝd.

source: An access key for the example certificate. This is used when we receive a response from the queue to validate that the sender is the same entity we asked to generate the certificate.
rtl: شر شذذثسس نثغ بخق فاث ثطشوحمث ذثقفهبهذشفث. فاهس هس عسثي صاثر صث قثذثهدث ش قثسحخرسث بقخو فاث ضعثعث فخ دشمهيشفث فاشف فاث سثريثق هس فاث سشوث ثرفهفغ صث شسنثي فخ لثرثقشفث فاث ذثقفهبهذشفث.

source: The full name that will appear on the certificate.
rtl: فاث بعمم رشوث فاشف صهمم شححثشق خر فاث ذثقفهبهذشفث.

source: The template file to use when generating the certificate.
rtl: فاث فثوحمشفث بهمث فخ عسث صاثر لثرثقشفهرل فاث ذثقفهبهذشفث.

source: The status of the example certificate.
rtl: فاث سفشفعس خب فاث ثطشوحمث ذثقفهبهذشفث.

source: The reason an error occurred during certificate generation.
rtl: فاث قثشسخر شر ثققخق خذذعققثي يعقهرل ذثقفهبهذشفث لثرثقشفهخر.

source: The download URL for the generated certificate.
rtl: فاث يخصرمخشي عقم بخق فاث لثرثقشفثي ذثقفهبهذشفث.

source: Name of template.
rtl: رشوث خب فثوحمشفث.

source: Description and/or admin notes.
rtl: يثسذقهحفهخر شري/خق شيوهر رخفثس.

source: Django template HTML.
rtl: يتشرلخ فثوحمشفث افوم.

source: Organization of template.
rtl: خقلشرهظشفهخر خب فثوحمشفث.

source: The course mode for this template.
rtl: فاث ذخعقسث وخيث بخق فاهس فثوحمشفث.

source: On/Off switch.
rtl: خر/خبب سصهفذا.

source: Description of the asset.
rtl: يثسذقهحفهخر خب فاث شسسثف.

source: Asset file. It could be an image or css file.
rtl: شسسثف بهمث. هف ذخعمي زث شر هوشلث خق ذسس بهمث.Ⱥn ɐɔɔǝss ʞǝʎ ɟøɹ ʇɥǝ ǝxɐɯdlǝ ɔǝɹʇᴉɟᴉɔɐʇǝ. Ŧɥᴉs ᴉs nsǝd ʍɥǝn ʍǝ ɹǝɔǝᴉʌǝ ɐ ɹǝsdønsǝ ɟɹøɯ ʇɥǝ bnǝnǝ ʇø ʌɐlᴉdɐʇǝ ʇɥɐʇ ʇɥǝ sǝndǝɹ ᴉs ʇɥǝ sɐɯǝ ǝnʇᴉʇʎ ʍǝ ɐsʞǝd ʇø ƃǝnǝɹɐʇǝ ʇɥǝ ɔǝɹʇᴉɟᴉɔɐʇǝ.

source: Asset's unique slug. We can reference the asset in templates using this value.
rtl: شسسثف'س عرهضعث سمعل. صث ذشر قثبثقثرذث فاث شسسثف هر فثوحمشفثس عسهرل فاهس دشمعث.

source: user is not given.
rtl: عسثق هس رخف لهدثر.Ⱥssǝʇ's nnᴉbnǝ slnƃ. Wǝ ɔɐn ɹǝɟǝɹǝnɔǝ ʇɥǝ ɐssǝʇ ᴉn ʇǝɯdlɐʇǝs nsᴉnƃ ʇɥᴉs ʌɐlnǝ.

source: user '{user}' does not exist
rtl: عسثق '{user}' يخثس رخف ثطهسف

source: Course id '{course_id}' is not valid
rtl: ذخعقسث هي '{course_id}' هس رخف دشمهي

source: The course does not exist against the given key '{course_key}'
rtl: فاث ذخعقسث يخثس رخف ثطهسف شلشهرسف فاث لهدثر نثغ '{course_key}'

source: User {username} does not exist
rtl: عسثق {username} يخثس رخف ثطهسف

source: {course_key} is not a valid course key
rtl: {course_key} هس رخف ش دشمهي ذخعقسث نثغ

source: The course {course_key} does not exist
rtl: فاث ذخعقسث {course_key} يخثس رخف ثطهسف

source: User {user_id} is not enrolled in the course {course_key}
rtl: عسثق {user_id} هس رخف ثرقخممثي هر فاث ذخعقسث {course_key}

source: An unexpected error occurred while regenerating certificates.
rtl: شر عرثطحثذفثي ثققخق خذذعققثي صاهمث قثلثرثقشفهرل ذثقفهبهذشفثس.

source: User {username} is not enrolled in the course {course_key}
rtl: عسثق {username} هس رخف ثرقخممثي هر فاث ذخعقسث {course_key}

source: An {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines.
rtl: شر {cert_type} ذثقفهبهذشفث سهلرهبهثس فاشف ش مثشقرثق اشس شلقثثي فخ شزهيث زغ فاث اخرخق ذخيث ثسفشزمهساثي زغ {platform_name} شري اشس ذخوحمثفثي شمم خب فاث قثضعهقثي فشسنس بخق فاهس ذخعقسث عريثق هفس لعهيثمهرثس.Ⱥn {cert_type} ɔǝɹʇᴉɟᴉɔɐʇǝ sᴉƃnᴉɟᴉǝs ʇɥɐʇ ɐ lǝɐɹnǝɹ ɥɐs ɐƃɹǝǝd ʇø ɐbᴉdǝ bʎ ʇɥǝ ɥønøɹ ɔødǝ ǝsʇɐblᴉsɥǝd bʎ {platform_name} ɐnd ɥɐs ɔøɯdlǝʇǝd ɐll øɟ ʇɥǝ ɹǝbnᴉɹǝd ʇɐsʞs ɟøɹ ʇɥᴉs ɔønɹsǝ nndǝɹ ᴉʇs ƃnᴉdǝlᴉnǝs.

source: A {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines. A {cert_type} certificate also indicates that the identity of the learner has been checked and is valid.
rtl: ش {cert_type} ذثقفهبهذشفث سهلرهبهثس فاشف ش مثشقرثق اشس شلقثثي فخ شزهيث زغ فاث اخرخق ذخيث ثسفشزمهساثي زغ {platform_name} شري اشس ذخوحمثفثي شمم خب فاث قثضعهقثي فشسنس بخق فاهس ذخعقسث عريثق هفس لعهيثمهرثس. ش {cert_type} ذثقفهبهذشفث شمسخ هريهذشفثس فاشف فاث هيثرفهفغ خب فاث مثشقرثق اشس زثثر ذاثذنثي شري هس دشمهي.required tasks for this course under its guidelines.

source: A {cert_type} certificate also indicates that the identity of the learner has been checked and is valid.
rtl: Ⱥ {cert_type} ɔǝɹʇᴉɟᴉɔɐʇǝ ɐlsø ᴉndᴉɔɐʇǝs ʇɥɐʇ ʇɥǝ ᴉdǝnʇᴉʇʎ øɟ ʇɥǝ lǝɐɹnǝɹ ɥɐs bǝǝn ɔɥǝɔʞǝd ɐnd ᴉs ʌɐlᴉd.
