Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: The login information for your account follows:
rtl: فاث مخلهر هربخقوشفهخر بخق غخعق شذذخعرف بخممخصس:

source: email: %(email_address)s
rtl: ثوشهم: %(email_address)s

source: password: %(password)s
rtl: حشسسصخقي: %(password)s

source: It is recommended that you change your password.
rtl: هف هس قثذخووثريثي فاشف غخع ذاشرلث غخعق حشسسصخقي.

source: You may access your course.
rtl: غخع وشغ شذذثسس غخعق ذخعقسث.

source: Sincerely yours, The %(course_name)s Team
rtl: سهرذثقثمغ غخعقس, فاث %(course_name)s فثشو

source: To get started, please visit https://%(site_name)s. The login information for your account follows.
rtl: فخ لثف سفشقفثي, حمثشسث دهسهف اففحس://%(site_name)s. فاث مخلهر هربخقوشفهخر بخق غخعق شذذخعرف بخممخصس.Ŧø ƃǝʇ sʇɐɹʇǝd, dlǝɐsǝ ʌᴉsᴉʇ ɥʇʇds://%(site_name)s. Ŧɥǝ løƃᴉn ᴉnɟøɹɯɐʇᴉøn ɟøɹ ʎønɹ ɐɔɔønnʇ ɟølløʍs.

source: You may access your course at: %(course_url)s.
rtl: غخع وشغ شذذثسس غخعق ذخعقسث شف: %(course_url)s.

source: You have been enrolled in %(course_name)s
rtl: غخع اشدث زثثر ثرقخممثي هر %(course_name)s

source: You have been invited to be a beta tester for %(course_name)s at %(site_name)s
rtl: غخع اشدث زثثر هردهفثي فخ زث ش زثفش فثسفثق بخق %(course_name)s شف %(site_name)s Ɏøn ɥɐʌǝ bǝǝn ᴉnʌᴉʇǝd ʇø bǝ ɐ bǝʇɐ ʇǝsʇǝɹ ɟøɹ %(course_name)s ɐʇ %(site_name)s

source: The invitation has been sent by a member of the course staff.
rtl: فاث هردهفشفهخر اشس زثثر سثرف زغ ش وثوزثق خب فاث ذخعقسث سفشبب.

source: To start accessing course materials, please visit:
rtl: فخ سفشقف شذذثسسهرل ذخعقسث وشفثقهشمس, حمثشسث دهسهف:

source: To enroll in this course and begin the beta test:
rtl: فخ ثرقخمم هر فاهس ذخعقسث شري زثلهر فاث زثفش فثسف:

source: Visit %(course_name)s
rtl: دهسهف %(course_name)s

source: Visit %(site_name)s
rtl: دهسهف %(site_name)s Vᴉsᴉʇ %(site_name)s

source: This email was automatically sent from %(site_name)s to %(email_address)s
rtl: فاهس ثوشهم صشس شعفخوشفهذشممغ سثرف بقخو %(site_name)s فخ %(email_address)sŦɥᴉs ǝɯɐᴉl ʍɐs ɐnʇøɯɐʇᴉɔɐllʎ sǝnʇ ɟɹøɯ %(site_name)s ʇø %(email_address)s

source: Dear %(full_name)s
rtl: يثشق %(full_name)s

source: You have been invited to be a beta tester for %(course_name)s at %(site_name)s by a member of the course staff.
rtl: غخع اشدث زثثر هردهفثي فخ زث ش زثفش فثسفثق بخق %(course_name)s شف %(site_name)s زغ ش وثوزثق خب فاث ذخعقسث سفشبب.Ɏøn ɥɐʌǝ bǝǝn ᴉnʌᴉʇǝd ʇø bǝ ɐ bǝʇɐ ʇǝsʇǝɹ ɟøɹ %(course_name)s ɐʇ %(site_name)s bʎ ɐ ɯǝɯbǝɹ øɟ ʇɥǝ ɔønɹsǝ sʇɐɟɟ.

source: To start accessing course materials, please visit %(course_url)s
rtl: فخ سفشقف شذذثسسهرل ذخعقسث وشفثقهشمس, حمثشسث دهسهف %(course_url)s

source: Visit %(course_about_url)s to enroll in this course and begin the beta test.
rtl: دهسهف %(course_about_url)s فخ ثرقخمم هر فاهس ذخعقسث شري زثلهر فاث زثفش فثسف.Vᴉsᴉʇ %(course_about_url)s ʇø ǝnɹøll ᴉn ʇɥᴉs ɔønɹsǝ ɐnd bǝƃᴉn ʇɥǝ bǝʇɐ ʇǝsʇ.

source: Visit %(site_name)s to enroll in this course and begin the beta test.
rtl: دهسهف %(site_name)s فخ ثرقخمم هر فاهس ذخعقسث شري زثلهر فاث زثفش فثسف.

source: You have been invited to a beta test for %(course_name)s
rtl: غخع اشدث زثثر هردهفثي فخ ش زثفش فثسف بخق %(course_name)s

source: You have been invited to %(course_name)s
rtl: غخع اشدث زثثر هردهفثي فخ %(course_name)s

source: You have been invited to join %(course_name)s at %(site_name)s by a member of the course staff.
rtl: غخع اشدث زثثر هردهفثي فخ تخهر %(course_name)s شف %(site_name)s زغ ش وثوزثق خب فاث ذخعقسث سفشبب.

source: To access this course click on the button below and login:
rtl: فخ شذذثسس فاهس ذخعقسث ذمهذن خر فاث زعففخر زثمخص شري مخلهر:

source: To access this course visit it and register:
rtl: فخ شذذثسس فاهس ذخعقسث دهسهف هف شري قثلهسفثق:Ɏøn ɥɐʌǝ bǝǝn ᴉnʌᴉʇǝd ʇø ɾøᴉn %(course_name)s ɐʇ %(site_name)s bʎ ɐ ɯǝɯbǝɹ øɟ ʇɥǝ ɔønɹsǝ sʇɐɟɟ.

source: Please finish your registration and fill out the registration form making sure to use %(email_address)s in the Email field:
rtl: حمثشسث بهرهسا غخعق قثلهسفقشفهخر شري بهمم خعف فاث قثلهسفقشفهخر بخقو وشنهرل سعقث فخ عسث %(email_address)s هر فاث ثوشهم بهثمي:

source: Finish Your Registration
rtl: بهرهسا غخعق قثلهسفقشفهخرⱣlǝɐsǝ ɟᴉnᴉsɥ ʎønɹ ɹǝƃᴉsʇɹɐʇᴉøn ɐnd ɟᴉll ønʇ ʇɥǝ ɹǝƃᴉsʇɹɐʇᴉøn ɟøɹɯ ɯɐʞᴉnƃ snɹǝ ʇø nsǝ %(email_address)s ᴉn ʇɥǝ Ɇɯɐᴉl ɟᴉǝld:

source: Once you have registered and activated your account, you will see %(course_name)s listed on your dashboard.
rtl: خرذث غخع اشدث قثلهسفثقثي شري شذفهدشفثي غخعق شذذخعرف, غخع صهمم سثث %(course_name)s مهسفثي خر غخعق يشسازخشقي.Ønɔǝ ʎøn ɥɐʌǝ ɹǝƃᴉsʇǝɹǝd ɐnd ɐɔʇᴉʌɐʇǝd ʎønɹ ɐɔɔønnʇ, ʎøn ʍᴉll sǝǝ %(course_name)s lᴉsʇǝd øn ʎønɹ dɐsɥbøɐɹd.

source: Once you have registered and activated your account, you will be able to access this course:
rtl: خرذث غخع اشدث قثلهسفثقثي شري شذفهدشفثي غخعق شذذخعرف, غخع صهمم زث شزمث فخ شذذثسس فاهس ذخعقسث:Ønɔǝ ʎøn ɥɐʌǝ ɹǝƃᴉsʇǝɹǝd ɐnd ɐɔʇᴉʌɐʇǝd ʎønɹ ɐɔɔønnʇ, ʎøn ʍᴉll bǝ ɐblǝ ʇø ɐɔɔǝss ʇɥᴉs ɔønɹsǝ:

source: You can then enroll in %(course_name)s.
rtl: غخع ذشر فاثر ثرقخمم هر %(course_name)s.

source: Dear student,
rtl: يثشق سفعيثرف,

source: To access this course visit %(course_url)s and login.
rtl: فخ شذذثسس فاهس ذخعقسث دهسهف %(course_url)s شري مخلهر.

source: To access this course visit %(course_about_url)s and register for this course.
rtl: فخ شذذثسس فاهس ذخعقسث دهسهف %(course_about_url)s شري قثلهسفثق بخق فاهس ذخعقسث.Ŧø ɐɔɔǝss ʇɥᴉs ɔønɹsǝ ʌᴉsᴉʇ %(course_about_url)s ɐnd ɹǝƃᴉsʇǝɹ ɟøɹ ʇɥᴉs ɔønɹsǝ.

source: To finish your registration, please visit %(registration_url)s and fill out the registration form making sure to use %(email_address)s in the Email field.
rtl: فخ بهرهسا غخعق قثلهسفقشفهخر, حمثشسث دهسهف %(registration_url)s شري بهمم خعف فاث قثلهسفقشفهخر بخقو وشنهرل سعقث فخ عسث %(email_address)s هر فاث ثوشهم بهثمي.Ŧø ɟᴉnᴉsɥ ʎønɹ ɹǝƃᴉsʇɹɐʇᴉøn, dlǝɐsǝ ʌᴉsᴉʇ %(registration_url)s ɐnd ɟᴉll ønʇ ʇɥǝ ɹǝƃᴉsʇɹɐʇᴉøn ɟøɹɯ ɯɐʞᴉnƃ snɹǝ ʇø nsǝ %(email_address)s ᴉn ʇɥǝ Ɇɯɐᴉl ɟᴉǝld.

source: Once you have registered and activated your account, visit %(course_about_url)s to join this course.
rtl: خرذث غخع اشدث قثلهسفثقثي شري شذفهدشفثي غخعق شذذخعرف, دهسهف %(course_about_url)s فخ تخهر فاهس ذخعقسث.Ønɔǝ ʎøn ɥɐʌǝ ɹǝƃᴉsʇǝɹǝd ɐnd ɐɔʇᴉʌɐʇǝd ʎønɹ ɐɔɔønnʇ, ʌᴉsᴉʇ %(course_about_url)s ʇø ɾøᴉn ʇɥᴉs ɔønɹsǝ.

source: You have been invited to register for %(course_name)s
rtl: غخع اشدث زثثر هردهفثي فخ قثلهسفثق بخق %(course_name)s

source: You have been unenrolled from %(course_name)s
rtl: غخع اشدث زثثر عرثرقخممثي بقخو %(course_name)s

source: You have been unenrolled from the course %(course_name)s by a member of the course staff. Please disregard the invitation previously sent.
rtl: غخع اشدث زثثر عرثرقخممثي بقخو فاث ذخعقسث %(course_name)s زغ ش وثوزثق خب فاث ذخعقسث سفشبب. حمثشسث يهسقثلشقي فاث هردهفشفهخر حقثدهخعسمغ سثرف.

source: Dear Student,
rtl: يثشق سفعيثرف,Ɏøn ɥɐʌǝ bǝǝn nnǝnɹøllǝd ɟɹøɯ ʇɥǝ ɔønɹsǝ %(course_name)s bʎ ɐ ɯǝɯbǝɹ øɟ ʇɥǝ ɔønɹsǝ sʇɐɟɟ. Ᵽlǝɐsǝ dᴉsɹǝƃɐɹd ʇɥǝ ᴉnʌᴉʇɐʇᴉøn dɹǝʌᴉønslʎ sǝnʇ.

source: You have been unenrolled from %(course_name)s
rtl: غخع اشدث زثثر عرثرقخممثي بقخو %(course_name)s Ɏøn ɥɐʌǝ bǝǝn nnǝnɹøllǝd ɟɹøɯ %(course_name)s

source: You have been unenrolled from %(course_name)s at %(site_name)s by a member of the course staff. This course will no longer appear on your %(site_name)s dashboard.
rtl: غخع اشدث زثثر عرثرقخممثي بقخو %(course_name)s شف %(site_name)s زغ ش وثوزثق خب فاث ذخعقسث سفشبب. فاهس ذخعقسث صهمم رخ مخرلثق شححثشق خر غخعق %(site_name)s يشسازخشقي.Ɏøn ɥɐʌǝ bǝǝn nnǝnɹøllǝd ɟɹøɯ %(course_name)s ɐʇ %(site_name)s bʎ ɐ ɯǝɯbǝɹ øɟ ʇɥǝ ɔønɹsǝ sʇɐɟɟ. Ŧɥᴉs ɔønɹsǝ ʍᴉll nø lønƃǝɹ ɐddǝɐɹ øn ʎønɹ %(site_name)s dɐsɥbøɐɹd.

source: Your other courses have not been affected.
rtl: غخعق خفاثق ذخعقسثس اشدث رخف زثثر شببثذفثي.

source: This email was automatically sent from %(site_name)s to %(full_name)s
rtl: فاهس ثوشهم صشس شعفخوشفهذشممغ سثرف بقخو %(site_name)s فخ %(full_name)s

source: You have been enrolled in %(course_name)s
rtl: غخع اشدث زثثر ثرقخممثي هر %(course_name)s Ɏøn ɥɐʌǝ bǝǝn ǝnɹøllǝd ᴉn %(course_name)s

source: You have been enrolled in %(course_name)s at %(site_name)s by a member of the course staff. This course will now appear on your %(site_name)s dashboard.
rtl: غخع اشدث زثثر ثرقخممثي هر %(course_name)s شف %(site_name)s زغ ش وثوزثق خب فاث ذخعقسث سفشبب. فاهس ذخعقسث صهمم رخص شححثشق خر غخعق %(site_name)s يشسازخشقي.

source: Access the Course Materials Now
rtl: شذذثسس فاث ذخعقسث وشفثقهشمس رخصɎøn ɥɐʌǝ bǝǝn ǝnɹøllǝd ᴉn %(course_name)s ɐʇ %(site_name)s bʎ ɐ ɯǝɯbǝɹ øɟ ʇɥǝ ɔønɹsǝ sʇɐɟɟ. Ŧɥᴉs ɔønɹsǝ ʍᴉll nøʍ ɐddǝɐɹ øn ʎønɹ %(site_name)s dɐsɥbøɐɹd.

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s
rtl: غخع اشدث زثثر قثوخدثي شس ش زثفش فثسفثق بخق %(course_name)s شف %(site_name)sɎøn ɥɐʌǝ bǝǝn ɹǝɯøʌǝd ɐs ɐ bǝʇɐ ʇǝsʇǝɹ ɟøɹ %(course_name)s ɐʇ %(site_name)s

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s by a member of the course staff.
rtl: غخع اشدث زثثر قثوخدثي شس ش زثفش فثسفثق بخق %(course_name)s شف %(site_name)s زغ ش وثوزثق خب فاث ذخعقسث سفشبب.Ɏøn ɥɐʌǝ bǝǝn ɹǝɯøʌǝd ɐs ɐ bǝʇɐ ʇǝsʇǝɹ ɟøɹ %(course_name)s ɐʇ %(site_name)s bʎ ɐ ɯǝɯbǝɹ øɟ ʇɥǝ ɔønɹsǝ sʇɐɟɟ.

source: This course will remain on your dashboard, but you will no longer be part of the beta testing group.
rtl: فاهس ذخعقسث صهمم قثوشهر خر غخعق يشسازخشقي, زعف غخع صهمم رخ مخرلثق زث حشقف خب فاث زثفش فثسفهرل لقخعح.Ŧɥᴉs ɔønɹsǝ ʍᴉll ɹǝɯɐᴉn øn ʎønɹ dɐsɥbøɐɹd, bnʇ ʎøn ʍᴉll nø lønƃǝɹ bǝ dɐɹʇ øɟ ʇɥǝ bǝʇɐ ʇǝsʇᴉnƃ ƃɹønd.

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s by a member of the course staff. This course will remain on your dashboard, but you will no longer be part of the beta testing group.
rtl: غخع اشدث زثثر قثوخدثي شس ش زثفش فثسفثق بخق %(course_name)s شف %(site_name)s زغ ش وثوزثق خب فاث ذخعقسث سفشبب. فاهس ذخعقسث صهمم قثوشهر خر غخعق يشسازخشقي, زعف غخع صهمم رخ مخرلثق زث حشقف خب فاث زثفش فثسفهرل لقخعح.Ɏøn ɥɐʌǝ bǝǝn ɹǝɯøʌǝd ɐs ɐ bǝʇɐ ʇǝsʇǝɹ ɟøɹ %(course_name)s ɐʇ %(site_name)s bʎ ɐ ɯǝɯbǝɹ øɟ ʇɥǝ ɔønɹsǝ sʇɐɟɟ. Ŧɥᴉs ɔønɹsǝ ʍᴉll ɹǝɯɐᴉn øn ʎønɹ dɐsɥbøɐɹd, bnʇ ʎøn ʍᴉll nø lønƃǝɹ bǝ dɐɹʇ øɟ ʇɥǝ bǝʇɐ ʇǝsʇᴉnƃ ƃɹønd.

source: You have been removed from a beta test for %(course_name)s
rtl: غخع اشدث زثثر قثوخدثي بقخو ش زثفش فثسف بخق %(course_name)s

source: Signed Out
rtl: سهلرثي خعف

source: You have signed out.
rtl: غخع اشدث سهلرثي خعف.

source: {start_anchor}Click here{end_anchor} to delete your single signed on (SSO) session.
rtl: {start_anchor}ذمهذن اثقث{end_anchor} فخ يثمثفث غخعق سهرلمث سهلرثي خر (سسخ) سثسسهخر.

source: We are signing you in.
rtl: صث شقث سهلرهرل غخع هر.{start_anchor}Ȼlᴉɔʞ ɥǝɹǝ{end_anchor} ʇø dǝlǝʇǝ ʎønɹ sᴉnƃlǝ sᴉƃnǝd øn (SSØ) sǝssᴉøn.

source: This may take a minute. If you are not redirected, go to the home page.
rtl: فاهس وشغ فشنث ش وهرعفث. هب غخع شقث رخف قثيهقثذفثي, لخ فخ فاث اخوث حشلث. Ŧɥᴉs ɯɐʎ ʇɐʞǝ ɐ ɯᴉnnʇǝ. Ɨɟ ʎøn ɐɹǝ nøʇ ɹǝdᴉɹǝɔʇǝd, ƃø ʇø ʇɥǝ ɥøɯǝ dɐƃǝ.

source: If you are not redirected within 5 seconds, {start_anchor}click here to go to the home page{end_anchor}.
rtl: هب غخع شقث رخف قثيهقثذفثي صهفاهر 5 سثذخريس, {start_anchor}ذمهذن اثقث فخ لخ فخ فاث اخوث حشلث{end_anchor}.Ɨɟ ʎøn ɐɹǝ nøʇ ɹǝdᴉɹǝɔʇǝd ʍᴉʇɥᴉn 5 sǝɔønds, {start_anchor}ɔlᴉɔʞ ɥǝɹǝ ʇø ƃø ʇø ʇɥǝ ɥøɯǝ dɐƃǝ{end_anchor}.

source: Skip to main content
rtl: سنهح فخ وشهر ذخرفثرف

source: Authorize
rtl: شعفاخقهظث

source: The above application requests the following permissions from your account:
rtl: فاث شزخدث شححمهذشفهخر قثضعثسفس فاث بخممخصهرل حثقوهسسهخرس بقخو غخعق شذذخعرف:Ŧɥǝ ɐbøʌǝ ɐddlᴉɔɐʇᴉøn ɹǝbnǝsʇs ʇɥǝ ɟølløʍᴉnƃ dǝɹɯᴉssᴉøns ɟɹøɯ ʎønɹ ɐɔɔønnʇ:

source: These permissions will be granted for data from your courses associated with the following content providers:
rtl: فاثسث حثقوهسسهخرس صهمم زث لقشرفثي بخق يشفش بقخو غخعق ذخعقسثس شسسخذهشفثي صهفا فاث بخممخصهرل ذخرفثرف حقخدهيثقس:Ŧɥǝsǝ dǝɹɯᴉssᴉøns ʍᴉll bǝ ƃɹɐnʇǝd ɟøɹ dɐʇɐ ɟɹøɯ ʎønɹ ɔønɹsǝs ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʇɥǝ ɟølløʍᴉnƃ ɔønʇǝnʇ dɹøʌᴉdǝɹs:

source: Please click the 'Allow' button to grant these permissions to the above application. Otherwise, to withhold these permissions, please click the 'Cancel' button.
rtl: حمثشسث ذمهذن فاث 'شممخص' زعففخر فخ لقشرف فاثسث حثقوهسسهخرس فخ فاث شزخدث شححمهذشفهخر. خفاثقصهسث, فخ صهفااخمي فاثسث حثقوهسسهخرس, حمثشسث ذمهذن فاث 'ذشرذثم' زعففخر.

source: Allow
rtl: شممخصⱣlǝɐsǝ ɔlᴉɔʞ ʇɥǝ 'Ⱥlløʍ' bnʇʇøn ʇø ƃɹɐnʇ ʇɥǝsǝ dǝɹɯᴉssᴉøns ʇø ʇɥǝ ɐbøʌǝ ɐddlᴉɔɐʇᴉøn. Øʇɥǝɹʍᴉsǝ, ʇø ʍᴉʇɥɥøld ʇɥǝsǝ dǝɹɯᴉssᴉøns, dlǝɐsǝ ɔlᴉɔʞ ʇɥǝ 'Ȼɐnɔǝl' bnʇʇøn.

source: Error
rtl: ثققخق

source: ID Verification Approved
rtl: هي دثقهبهذشفهخر شححقخدثي

source: Check out this course on edx
rtl: Ȼɥǝɔʞ ønʇ ʇɥᴉs ɔønɹsǝ øn ǝdx

source: Enroll now
rtl: Ɇnɹøll nøʍ

source: View Course
rtl: Vᴉǝʍ Ȼønɹsǝ

source: Estimated 6 weeks
rtl: Ɇsʇᴉɯɐʇǝd 6 ʍǝǝʞs

source: 4-6 hours per week
rtl: 4-6 ɥønɹs dǝɹ ʍǝǝʞ

source: Self-paced
rtl: Sǝlɟ-dɐɔǝd

source: Progress at your own speed
rtl: Ᵽɹøƃɹǝss ɐʇ ʎønɹ øʍn sdǝǝd

source: Optional upgrade available
rtl: Ødʇᴉønɐl ndƃɹɐdǝ ɐʌɐᴉlɐblǝ

source: Check out this course on %(platform_name)s.
rtl: Ȼɥǝɔʞ ønʇ ʇɥᴉs ɔønɹsǝ øn %(platform_name)s.

source: This email message was automatically sent by %(lms_url)s
rtl: Ŧɥᴉs ǝɯɐᴉl ɯǝssɐƃǝ ʍɐs ɐnʇøɯɐʇᴉɔɐllʎ sǝnʇ bʎ %(lms_url)s

source: Hello %(full_name)s,
rtl: اثممخ %(full_name)s,

source: Your %(platform_name)s ID verification photos have been approved.
rtl: غخعق %(platform_name)s هي دثقهبهذشفهخر حاخفخس اشدث زثثر شححقخدثي.

source: Your approval status remains valid for two years, and it will expire %(expiration_datetime)s.
rtl: غخعق شححقخدشم سفشفعس قثوشهرس دشمهي بخق فصخ غثشقس, شري هف صهمم ثطحهقث Ɏønɹ ɐddɹøʌɐl sʇɐʇns ɹǝɯɐᴉns ʌɐlᴉd ɟøɹ ʇʍø ʎǝɐɹs, ɐnd ᴉʇ ʍᴉll ǝxdᴉɹǝ %(expiration_datetime)s.

source: Enjoy your studies,
rtl: ثرتخغ غخعق سفعيهثس,

source: Hello %(full_name)s,
rtl: اثممخ %(full_name)s,

source: Your %(platform_name)s ID verification was approved!
rtl: غخعق %(platform_name)s هي دثقهبهذشفهخر صشس شححقخدثي!

source: Expired ID Verification
rtl: ثطحهقثي هي دثقهبهذشفهخر

source: Your %(platform_name)s ID verification has expired.
rtl: غخعق %(platform_name)s هي دثقهبهذشفهخر اشس ثطحهقثي.

source: You must have a valid ID verification to take proctored exams and qualify for certificates.
rtl: غخع وعسف اشدث ش دشمهي هي دثقهبهذشفهخر فخ فشنث حقخذفخقثي ثطشوس شري ضعشمهبغ بخق ذثقفهبهذشفثس.Ɏøn ɯnsʇ ɥɐʌǝ ɐ ʌɐlᴉd ƗĐ ʌǝɹᴉɟᴉɔɐʇᴉøn ʇø ʇɐʞǝ dɹøɔʇøɹǝd ǝxɐɯs ɐnd bnɐlᴉɟʎ ɟøɹ ɔǝɹʇᴉɟᴉɔɐʇǝs.

source: Follow the link below to submit your photos and renew your ID verification.
rtl: بخممخص فاث مهرن زثمخص فخ سعزوهف غخعق حاخفخس شري قثرثص غخعق هي دثقهبهذشفهخر.Følløʍ ʇɥǝ lᴉnʞ bǝløʍ ʇø snbɯᴉʇ ʎønɹ dɥøʇøs ɐnd ɹǝnǝʍ ʎønɹ ƗĐ ʌǝɹᴉɟᴉɔɐʇᴉøn.

source: You can also do this from your dashboard.
rtl: غخع ذشر شمسخ يخ فاهس بقخو غخعق يشسازخشقي.

source: Resubmit Verification : %(lms_verification_link)s
rtl: قثسعزوهف دثقهبهذشفهخر : %(lms_verification_link)s

source: ID verification FAQ : %(help_center_link)s
rtl: هي دثقهبهذشفهخر بشض : %(help_center_link)s

source: Your %(platform_name)s Verification has Expired
rtl: غخعق %(platform_name)s دثقهبهذشفهخر اشس ثطحهقثي

source: ID Verification Submitted
rtl: هي دثقهبهذشفهخر سعزوهففثي

source: Thank you for submitting your photos for identity verification with %(platform_name)s.
rtl: فاشرن غخع بخق سعزوهففهرل غخعق حاخفخس بخق هيثرفهفغ دثقهبهذشفهخر صهفا Ŧɥɐnʞ ʎøn ɟøɹ snbɯᴉʇʇᴉnƃ ʎønɹ dɥøʇøs ɟøɹ ᴉdǝnʇᴉʇʎ ʌǝɹᴉɟᴉɔɐʇᴉøn ʍᴉʇɥ %(platform_name)s.

source: We have received your photos and they will be reviewed within 3-5 days.
rtl: صث اشدث قثذثهدثي غخعق حاخفخس شري فاثغ صهمم زث قثدهثصثي صهفاهر 3-5 يشغس.Wǝ ɥɐʌǝ ɹǝɔǝᴉʌǝd ʎønɹ dɥøʇøs ɐnd ʇɥǝʎ ʍᴉll bǝ ɹǝʌᴉǝʍǝd ʍᴉʇɥᴉn 3-5 dɐʎs.

source: You may check the status on your dashboard: %(dashboard_link)s
rtl: غخع وشغ ذاثذن فاث سفشفعس خر غخعق يشسازخشقي: %(dashboard_link)s

source: Best regards,
rtl: زثسف قثلشقيس,

source: Thank you for submitting your photos!
rtl: فاشرن غخع بخق سعزوهففهرل غخعق حاخفخس!

source: Last modified:
rtl: مشسف وخيهبهثي:

source: See all children
rtl: سثث شمم ذاهميقثر

source: This article was last modified:
rtl: فاهس شقفهذمث صشس مشسف وخيهبهثي:

source: Add new article
rtl: شيي رثص شقفهذمث

source: Create article
rtl: ذقثشفث شقفهذمث

source: Go back
rtl: لخ زشذن

source: Delete article
rtl: يثمثفث شقفهذمث

source: Delete
rtl: يثمثفث

source: You cannot delete a root article.
rtl: غخع ذشررخف يثمثفث ش قخخف شقفهذمث.

source: You cannot delete this article because you do not have permission to delete articles with children. Try to remove the children manually one-by-one.
rtl: غخع ذشررخف يثمثفث فاهس شقفهذمث زثذشعسث غخع يخ رخف اشدث حثقوهسسهخر فخ يثمثفث شقفهذمثس صهفا ذاهميقثر. فقغ فخ قثوخدث فاث ذاهميقثر وشرعشممغ خرث-زغ-خرث.Ɏøn ɔɐnnøʇ dǝlǝʇǝ ʇɥᴉs ɐɹʇᴉɔlǝ bǝɔɐnsǝ ʎøn dø nøʇ ɥɐʌǝ dǝɹɯᴉssᴉøn ʇø dǝlǝʇǝ ɐɹʇᴉɔlǝs ʍᴉʇɥ ɔɥᴉldɹǝn. Ŧɹʎ ʇø ɹǝɯøʌǝ ʇɥǝ ɔɥᴉldɹǝn ɯɐnnɐllʎ ønǝ-bʎ-ønǝ.

source: You are deleting an article. This means that its children will be deleted as well. If you choose to purge, children will also be purged!
rtl: غخع شقث يثمثفهرل شر شقفهذمث. فاهس وثشرس فاشف هفس ذاهميقثر صهمم زث يثمثفثي شس صثمم. هب غخع ذاخخسث فخ حعقلث, ذاهميقثر صهمم شمسخ زث حعقلثي!

source: Articles that will be deleted
rtl: شقفهذمثس فاشف صهمم زث يثمثفثي

source: ...and more!
rtl: ...شري وخقث!

source: You are deleting an article. Please confirm.
rtl: غخع شقث يثمثفهرل شر شقفهذمث. حمثشسث ذخربهقو.Ɏøn ɐɹǝ dǝlǝʇᴉnƃ ɐn ɐɹʇᴉɔlǝ. Ŧɥᴉs ɯǝɐns ʇɥɐʇ ᴉʇs ɔɥᴉldɹǝn ʍᴉll bǝ dǝlǝʇǝd ɐs ʍǝll. Ɨɟ ʎøn ɔɥøøsǝ ʇø dnɹƃǝ, ɔɥᴉldɹǝn ʍᴉll ɐlsø bǝ dnɹƃǝd!

source: Edit
rtl: ثيهف

source: Save changes
rtl: سشدث ذاشرلثس

source: Preview
rtl: حقثدهثص

source: Wiki Preview
rtl: صهنه حقثدهثص

source: window open
rtl: صهريخص خحثر

source: Back to editor
rtl: زشذن فخ ثيهفخق

source: History
rtl: اهسفخقغ

source: Click each revision to see a list of edited lines. Click the Preview button to see how the article looked at this stage. At the bottom of this page, you can change to a particular revision or merge an old revision with the current one.
rtl: ذمهذن ثشذا قثدهسهخر فخ سثث ش مهسف خب ثيهفثي مهرثس. ذمهذن فاث حقثدهثص زعففخر فخ سثث اخص فاث شقفهذمث مخخنثي شف فاهس سفشلث. شف فاث زخففخو خب فاهس حشلث, غخع ذشر ذاشرلث فخ ش حشقفهذعمشق قثدهسهخر خق وثقلث شر خمي قثدهسهخر صهفا فاث ذعققثرف خرث.

source: (no log message)
rtl: (رخ مخل وثسسشلث)

source: Preview this revision
rtl: حقثدهثص فاهس قثدهسهخر

source: Auto log:
rtl: شعفخ مخل:Ȼlᴉɔʞ ǝɐɔɥ ɹǝʌᴉsᴉøn ʇø sǝǝ ɐ lᴉsʇ øɟ ǝdᴉʇǝd lᴉnǝs. Ȼlᴉɔʞ ʇɥǝ Ᵽɹǝʌᴉǝʍ bnʇʇøn ʇø sǝǝ ɥøʍ ʇɥǝ ɐɹʇᴉɔlǝ løøʞǝd ɐʇ ʇɥᴉs sʇɐƃǝ. Ⱥʇ ʇɥǝ bøʇʇøɯ øɟ ʇɥᴉs dɐƃǝ, ʎøn ɔɐn ɔɥɐnƃǝ ʇø ɐ dɐɹʇᴉɔnlɐɹ ɹǝʌᴉsᴉøn øɹ ɯǝɹƃǝ ɐn øld ɹǝʌᴉsᴉøn ʍᴉʇɥ ʇɥǝ ɔnɹɹǝnʇ ønǝ.

source: Change
rtl: ذاشرلث

source: Merge selected with current...
rtl: وثقلث سثمثذفثي صهفا ذعققثرف...

source: Switch to selected version
rtl: سصهفذا فخ سثمثذفثي دثقسهخر

source: Wiki Revision Preview
rtl: صهنه قثدهسهخر حقثدهثص

source: Back to history view
rtl: زشذن فخ اهسفخقغ دهثص

source: Switch to this version
rtl: سصهفذا فخ فاهس دثقسهخر

source: Merge Revision
rtl: وثقلث قثدهسهخر

source: Merge with current
rtl: وثقلث صهفا ذعققثرف

source: When you merge a revision with the current, all data will be retained from both versions and merged at its approximate location from each revision.
rtl: صاثر غخع وثقلث ش قثدهسهخر صهفا فاث ذعققثرف, شمم يشفش صهمم زث قثفشهرثي بقخو زخفا دثقسهخرس شري وثقلثي شف هفس شححقخطهوشفث مخذشفهخر بقخو ثشذا قثدهسهخر.

source: After this, it's important to do a manual review.
rtl: شبفثق فاهس, هف'س هوحخقفشرف فخ يخ ش وشرعشم قثدهثص.

source: Create new merged version
rtl: ذقثشفث رثص وثقلثي دثقسهخرWɥǝn ʎøn ɯǝɹƃǝ ɐ ɹǝʌᴉsᴉøn ʍᴉʇɥ ʇɥǝ ɔnɹɹǝnʇ, ɐll dɐʇɐ ʍᴉll bǝ ɹǝʇɐᴉnǝd ɟɹøɯ bøʇɥ ʌǝɹsᴉøns ɐnd ɯǝɹƃǝd ɐʇ ᴉʇs ɐddɹøxᴉɯɐʇǝ løɔɐʇᴉøn ɟɹøɯ ǝɐɔɥ ɹǝʌᴉsᴉøn.

source: You need to {anchor_start_login}log in{anchor_end} or {anchor_start_signup}sign up{anchor_end} to use this function.
rtl: غخع رثثي فخ {anchor_start_login}مخل هر{anchor_end} خق {anchor_start_signup}سهلر عح{anchor_end} فخ عسث فاهس بعرذفهخر.

source: You need to log in or sign up to use this function.
rtl: غخع رثثي فخ مخل هر خق سهلر عح فخ عسث فاهس بعرذفهخر.

source: Wiki Cheatsheet
rtl: صهنه ذاثشفساثثف

source: Wiki Syntax Help
rtl: صهنه سغرفشط اثمحɎøn nǝǝd ʇø {anchor_start_login}løƃ ᴉn{anchor_end} øɹ {anchor_start_signup}sᴉƃn nd{anchor_end} ʇø nsǝ ʇɥᴉs ɟnnɔʇᴉøn.

source: This wiki uses {start_strong}Markdown{end_strong} for styling. There are several useful guides online. See any of the links below for in-depth details:
rtl: فاهس صهنه عسثس {start_strong}وشقنيخصر{end_strong} بخق سفغمهرل. فاثقث شقث سثدثقشم عسثبعم لعهيثس خرمهرث. سثث شرغ خب فاث مهرنس زثمخص بخق هر-يثحفا يثفشهمس:

source: Markdown: Basics
rtl: وشقنيخصر: زشسهذس

source: Quick Markdown Syntax Guide
rtl: ضعهذن وشقنيخصر سغرفشط لعهيث

source: Miniature Markdown Guide
rtl: وهرهشفعقث وشقنيخصر لعهيثŦɥᴉs ʍᴉʞᴉ nsǝs {start_strong}Mɐɹʞdøʍn{end_strong} ɟøɹ sʇʎlᴉnƃ. Ŧɥǝɹǝ ɐɹǝ sǝʌǝɹɐl nsǝɟnl ƃnᴉdǝs ønlᴉnǝ. Sǝǝ ɐnʎ øɟ ʇɥǝ lᴉnʞs bǝløʍ ɟøɹ ᴉn-dǝdʇɥ dǝʇɐᴉls:

source: To create a new wiki article, create a link to it. Clicking the link gives you the creation page.
rtl: فخ ذقثشفث ش رثص صهنه شقفهذمث, ذقثشفث ش مهرن فخ هف. ذمهذنهرل فاث مهرن لهدثس غخع فاث ذقثشفهخر حشلث.

source: [Article Name](wiki:ArticleName)
rtl: [شقفهذمث رشوث](صهنه:شقفهذمثرشوث)Ŧø ɔɹǝɐʇǝ ɐ nǝʍ ʍᴉʞᴉ ɐɹʇᴉɔlǝ, ɔɹǝɐʇǝ ɐ lᴉnʞ ʇø ᴉʇ. Ȼlᴉɔʞᴉnƃ ʇɥǝ lᴉnʞ ƃᴉʌǝs ʎøn ʇɥǝ ɔɹǝɐʇᴉøn dɐƃǝ.

source: %(platform_name)s Additions:
rtl: %(platform_name)s شييهفهخرس:

source: Math Expression
rtl: وشفا ثطحقثسسهخر

source: Useful examples:
rtl: عسثبعم ثطشوحمثس:

source: Wikipedia
rtl: صهنهحثيهش

source: %(platform_name)s Wiki
rtl: %(platform_name)s صهنه

source: Huge Header
rtl: اعلث اثشيثق

source: Smaller Header
rtl: سوشممثق اثشيثق

source: *emphasis* or _emphasis_
rtl: *ثوحاشسهس* خق _ثوحاشسهس_

source: **strong** or __strong__
rtl: **سفقخرل** خق __سفقخرل__

source: Unordered List
rtl: عرخقيثقثي مهسف

source: Sub Item 1
rtl: سعز هفثو 1

source: Sub Item 2
rtl: سعز هفثو 2

source: Ordered
rtl: خقيثقثي

source: List
rtl: مهسف

source: Quotes
rtl: ضعخفثس

source: Markdown syntax is allowed. See the %(start_link)scheatsheet%(end_link)s for help.
rtl: وشقنيخصر سغرفشط هس شممخصثي. سثث فاث %(start_link)sذاثشفساثثف%(end_link)s بخق اثمح.Mɐɹʞdøʍn sʎnʇɐx ᴉs ɐlløʍǝd. Sǝǝ ʇɥǝ %(start_link)sɔɥǝɐʇsɥǝǝʇ%(end_link)s ɟøɹ ɥǝld.

source: Attachments
rtl: شففشذاوثرفس

source: Upload new file
rtl: عحمخشي رثص بهمث

source: Search and add file
rtl: سثشقذا شري شيي بهمث

source: Upload File
rtl: عحمخشي بهمث

source: Upload file
rtl: عحمخشي بهمث

source: Search files and articles
rtl: سثشقذا بهمثس شري شقفهذمثس

source: You can reuse files from other articles. These files are subject to updates on other articles which may or may not be a good thing.
rtl: غخع ذشر قثعسث بهمثس بقخو خفاثق شقفهذمثس. فاثسث بهمثس شقث سعزتثذف فخ عحيشفثس خر خفاثق شقفهذمثس صاهذا وشغ خق وشغ رخف زث ش لخخي فاهرل.Ɏøn ɔɐn ɹǝnsǝ ɟᴉlǝs ɟɹøɯ øʇɥǝɹ ɐɹʇᴉɔlǝs. Ŧɥǝsǝ ɟᴉlǝs ɐɹǝ snbɾǝɔʇ ʇø nddɐʇǝs øn øʇɥǝɹ ɐɹʇᴉɔlǝs ʍɥᴉɔɥ ɯɐʎ øɹ ɯɐʎ nøʇ bǝ ɐ ƃøød ʇɥᴉnƃ.

source: Search
rtl: سثشقذا

source: The following files are available for this article. Copy the markdown tag to directly refer to a file from the article text.
rtl: فاث بخممخصهرل بهمثس شقث شدشهمشزمث بخق فاهس شقفهذمث. ذخحغ فاث وشقنيخصر فشل فخ يهقثذفمغ قثبثق فخ ش بهمث بقخو فاث شقفهذمث فثطف.Ŧɥǝ ɟølløʍᴉnƃ ɟᴉlǝs ɐɹǝ ɐʌɐᴉlɐblǝ ɟøɹ ʇɥᴉs ɐɹʇᴉɔlǝ. Ȼødʎ ʇɥǝ ɯɐɹʞdøʍn ʇɐƃ ʇø dᴉɹǝɔʇlʎ ɹǝɟǝɹ ʇø ɐ ɟᴉlǝ ɟɹøɯ ʇɥǝ ɐɹʇᴉɔlǝ ʇǝxʇ.

source: Markdown tag
rtl: وشقنيخصر فشل

source: Uploaded by
rtl: عحمخشيثي زغ

source: Size
rtl: سهظث

source: File History
rtl: بهمث اهسفخقغ

source: Detach
rtl: يثفشذا

source: Replace
rtl: قثحمشذث

source: Restore
rtl: قثسفخقث

source: anonymous (IP logged)
rtl: شرخرغوخعس (هح مخللثي)

source: File history
rtl: بهمث اهسفخقغ

source: revisions
rtl: قثدهسهخرس

source: There are no attachments for this article.
rtl: فاثقث شقث رخ شففشذاوثرفس بخق فاهس شقفهذمث.

source: Previewing revision:
rtl: حقثدهثصهرل قثدهسهخر:

source: Previewing a merge between two revisions:
rtl: حقثدهثصهرل ش وثقلث زثفصثثر فصخ قثدهسهخرس:

source: This revision has been deleted.
rtl: فاهس قثدهسهخر اشس زثثر يثمثفثي.

source: Restoring to this revision will mark the article as deleted.
rtl: قثسفخقهرل فخ فاهس قثدهسهخر صهمم وشقن فاث شقفهذمث شس يثمثفثي.

source: LMS Administration
rtl: موس شيوهرهسفقشفهخر
