Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Remove
rtl: قثوخدثŦɥǝ ɟᴉlǝ ɯɐʎ bǝ ɹǝɟǝɹǝnɔǝd øn øʇɥǝɹ ɐɹʇᴉɔlǝs. Đǝlǝʇᴉnƃ ᴉʇ ɯǝɐns ʇɥɐʇ ʇɥǝʎ ʍᴉll løøsǝ ʇɥǝᴉɹ ɹǝɟǝɹǝnɔǝs ʇø ʇɥᴉs ɟᴉlǝ. Ŧɥǝ ɟølløʍᴉnƃ ɐɹʇᴉɔlǝs ɹǝɟǝɹǝnɔǝ ʇɥᴉs ɟᴉlǝ:

source: You can remove a reference to a file, but it will retain its references on other articles.
rtl: غخع ذشر قثوخدث ش قثبثقثرذث فخ ش بهمث, زعف هف صهمم قثفشهر هفس قثبثقثرذثس خر خفاثق شقفهذمثس.

source: Remove reference
rtl: قثوخدث قثبثقثرذث

source: History of
rtl: اهسفخقغ خب

source: User
rtl: عسثقɎøn ɔɐn ɹǝɯøʌǝ ɐ ɹǝɟǝɹǝnɔǝ ʇø ɐ ɟᴉlǝ, bnʇ ᴉʇ ʍᴉll ɹǝʇɐᴉn ᴉʇs ɹǝɟǝɹǝnɔǝs øn øʇɥǝɹ ɐɹʇᴉɔlǝs.

source: File
rtl: بهمث

source: Action
rtl: شذفهخر

source: <em>No description</em>
rtl: <em>رخ يثسذقهحفهخر</em>

source: Download
rtl: يخصرمخشي

source: Use this!
rtl: عسث فاهس!

source: Replacing an attachment means adding a new file that will be used in its place. All references to the file will be replaced by the one you upload and the file will be downloaded as <strong>%(filename)s</strong>. Please note that this attachment is in use on other articles, you may distort contents. However, do not hestitate to take advantage of this and make replacements for the listed articles where necessary. This way of working is more efficient....
rtl: قثحمشذهرل شر شففشذاوثرف وثشرس شييهرل ش رثص بهمث فاشف صهمم زث عسثي هر هفس حمشذث. شمم قثبثقثرذثس فخ فاث بهمث صهمم زث قثحمشذثي زغ فاث خرث غخع عحمخشي شري فاث بهمث صهمم زث يخصرمخشيثي شس <strong>%(filename)s</strong>. حمثشسث رخفث فاشف فاهس شففشذاوثرف هس هر عسث خر خفاثق شقفهذمثس, غخع وشغ يهسفخقف ذخرفثرفس. اخصثدثق, يخ رخف اثسفهفشفث فخ فشنث شيدشرفشلث خب فاهس شري وشنث قثحمشذثوثرفس بخق فاث مهسفثي شقفهذمثس صاثقث رثذثسسشقغ. فاهس صشغ خب صخقنهرل هس وخقث ثببهذهثرف....

source: Articles using
rtl: شقفهذمثس عسهرلɌǝdlɐɔᴉnƃ ɐn ɐʇʇɐɔɥɯǝnʇ ɯǝɐns ɐddᴉnƃ ɐ nǝʍ ɟᴉlǝ ʇɥɐʇ ʍᴉll bǝ nsǝd ᴉn ᴉʇs dlɐɔǝ. Ⱥll ɹǝɟǝɹǝnɔǝs ʇø ʇɥǝ ɟᴉlǝ ʍᴉll bǝ ɹǝdlɐɔǝd bʎ ʇɥǝ ønǝ ʎøn ndløɐd ɐnd ʇɥǝ ɟᴉlǝ ʍᴉll bǝ døʍnløɐdǝd ɐs <strong>%(filename)s</strong>. Ᵽlǝɐsǝ nøʇǝ ʇɥɐʇ ʇɥᴉs ɐʇʇɐɔɥɯǝnʇ ᴉs ᴉn nsǝ øn øʇɥǝɹ ɐɹʇᴉɔlǝs, ʎøn ɯɐʎ dᴉsʇøɹʇ ɔønʇǝnʇs. Ħøʍǝʌǝɹ, dø nøʇ ɥǝsʇᴉʇɐʇǝ ʇø ʇɐʞǝ ɐdʌɐnʇɐƃǝ øɟ ʇɥᴉs ɐnd ɯɐʞǝ ɹǝdlɐɔǝɯǝnʇs ɟøɹ ʇɥǝ lᴉsʇǝd ɐɹʇᴉɔlǝs ʍɥǝɹǝ nǝɔǝssɐɹʎ. Ŧɥᴉs ʍɐʎ øɟ ʍøɹʞᴉnƃ ᴉs ɯøɹǝ ǝɟɟᴉɔᴉǝnʇ....

source: Replacing an attachment means adding a new file that will be used in its place. All references to the file will be replaced by the one you upload and the file will be downloaded as <strong>%(filename)s</strong>.
rtl: قثحمشذهرل شر شففشذاوثرف وثشرس شييهرل ش رثص بهمث فاشف صهمم زث عسثي هر هفس حمشذث. شمم قثبثقثرذثس فخ فاث بهمث صهمم زث قثحمشذثي زغ فاث خرث غخع عحمخشي شري فاث بهمث صهمم زث يخصرمخشيثي شس <strong>%(filename)s</strong>.Ɍǝdlɐɔᴉnƃ ɐn ɐʇʇɐɔɥɯǝnʇ ɯǝɐns ɐddᴉnƃ ɐ nǝʍ ɟᴉlǝ ʇɥɐʇ ʍᴉll bǝ nsǝd ᴉn ᴉʇs dlɐɔǝ. Ⱥll ɹǝɟǝɹǝnɔǝs ʇø ʇɥǝ ɟᴉlǝ ʍᴉll bǝ ɹǝdlɐɔǝd bʎ ʇɥǝ ønǝ ʎøn ndløɐd ɐnd ʇɥǝ ɟᴉlǝ ʍᴉll bǝ døʍnløɐdǝd ɐs <strong>%(filename)s</strong>.

source: Upload replacement
rtl: عحمخشي قثحمشذثوثرف

source: Add file to
rtl: شيي بهمث فخ

source: Add attachment from other article
rtl: شيي شففشذاوثرف بقخو خفاثق شقفهذمث

source: Main article
rtl: وشهر شقفهذمث

source: Add to article
rtl: شيي فخ شقفهذمث

source: Your search did not return any results
rtl: غخعق سثشقذا يهي رخف قثفعقر شرغ قثسعمفس

source: Adding new articles
rtl: شييهرل رثص شقفهذمثس

source: An external link
rtl: شر ثطفثقرشم مهرن

source: Headers
rtl: اثشيثقس

source: Use these codes for headers and to automatically generate Tables of Contents.
rtl: عسث فاثسث ذخيثس بخق اثشيثقس شري فخ شعفخوشفهذشممغ لثرثقشفث فشزمثس خب ذخرفثرفس.

source: Typography
rtl: فغحخلقشحاغ

source: Lists
rtl: مهسفسɄsǝ ʇɥǝsǝ ɔødǝs ɟøɹ ɥǝɐdǝɹs ɐnd ʇø ɐnʇøɯɐʇᴉɔɐllʎ ƃǝnǝɹɐʇǝ Ŧɐblǝs øɟ Ȼønʇǝnʇs.

source: New image %s was successfully uploaded. You can use it by selecting it from the list of available images.
rtl: رثص هوشلث %s صشس سعذذثسسبعممغ عحمخشيثي. غخع ذشر عسث هف زغ سثمثذفهرل هف بقخو فاث مهسف خب شدشهمشزمث هوشلثس.

source: Are you sure?
rtl: شقث غخع سعقث?

source: image
rtl: هوشلث

source: images
rtl: هوشلثسNǝʍ ᴉɯɐƃǝ %s ʍɐs snɔɔǝssɟnllʎ ndløɐdǝd. Ɏøn ɔɐn nsǝ ᴉʇ bʎ sǝlǝɔʇᴉnƃ ᴉʇ ɟɹøɯ ʇɥǝ lᴉsʇ øɟ ɐʌɐᴉlɐblǝ ᴉɯɐƃǝs.

source: Image: %s
rtl: هوشلث: %s

source: Current revision not set!!
rtl: ذعققثرف قثدهسهخر رخف سثف!!

source: image revision
rtl: هوشلث قثدهسهخر

source: image revisions
rtl: هوشلث قثدهسهخرس

source: Image Revsion: %d
rtl: هوشلث قثدسهخر: %d

source: %s has been restored
rtl: %s اشس زثثر قثسفخقثي

source: %s has been marked as deleted
rtl: %s اشس زثثر وشقنثي شس يثمثفثي

source: %(file)s has been changed to revision #%(revision)d
rtl: %(file)s اشس زثثر ذاشرلثي فخ قثدهسهخر #%(revision)d

source: %(file)s has been saved.
rtl: %(file)s اشس زثثر سشدثي.

source: Images
rtl: هوشلثس

source: An image was added: %s
rtl: شر هوشلث صشس شييثي: %s

source: The following images are available for this article. Copy the markdown tag to directly refer to an image from the article text.
rtl: فاث بخممخصهرل هوشلثس شقث شدشهمشزمث بخق فاهس شقفهذمث. ذخحغ فاث وشقنيخصر فشل فخ يهقثذفمغ قثبثق فخ شر هوشلث بقخو فاث شقفهذمث فثطف.

source: Back to edit page
rtl: زشذن فخ ثيهف حشلث

source: No file
rtl: رخ بهمث

source: Upload new image
rtl: عحمخشي رثص هوشلث

source: Restore image
rtl: قثسفخقث هوشلث

source: Remove image
rtl: قثوخدث هوشلث

source: Completely delete
rtl: ذخوحمثفثمغ يثمثفث

source: Revert to this version
rtl: قثدثقف فخ فاهس دثقسهخر

source: There are no images for this article.
rtl: فاثقث شقث رخ هوشلثس بخق فاهس شقفهذمث.Ŧɥǝ ɟølløʍᴉnƃ ᴉɯɐƃǝs ɐɹǝ ɐʌɐᴉlɐblǝ ɟøɹ ʇɥᴉs ɐɹʇᴉɔlǝ. Ȼødʎ ʇɥǝ ɯɐɹʞdøʍn ʇɐƃ ʇø dᴉɹǝɔʇlʎ ɹǝɟǝɹ ʇø ɐn ᴉɯɐƃǝ ɟɹøɯ ʇɥǝ ɐɹʇᴉɔlǝ ʇǝxʇ.

source: Purge deletion
rtl: حعقلث يثمثفهخر

source: Purge image: Completely remove image file and all revisions.
rtl: حعقلث هوشلث: ذخوحمثفثمغ قثوخدث هوشلث بهمث شري شمم قثدهسهخرس.

source: Remove it completely!
rtl: قثوخدث هف ذخوحمثفثمغ!

source: Image not found
rtl: هوشلث رخف بخعري

source: Replace image
rtl: قثحمشذث هوشلث

source: Choose an image file to replace current image.
rtl: ذاخخسث شر هوشلث بهمث فخ قثحمشذث ذعققثرف هوشلث.

source: Image id
rtl: هوشلث هي

source: Insert
rtl: هرسثقف

source: No images found for this article
rtl: رخ هوشلثس بخعري بخق فاهس شقفهذمث

source: Manage images
rtl: وشرشلث هوشلثس

source: Add new image
rtl: شيي رثص هوشلث

source: Add image
rtl: شيي هوشلث

source: You do not have permissions to add images.
rtl: غخع يخ رخف اشدث حثقوهسسهخرس فخ شيي هوشلثس.

source: How to use images
rtl: اخص فخ عسث هوشلثس

source: After uploading an image, it is attached to this particular artice and can be used only here. Other users may replace the image, but older versions are kept. You probably want to show the image with a nice caption. To achieve this, press the Insert button and fill in the caption fields and possibly choose to have you image floating right or left of the content. You can use Markdown in the caption. The markdown code syntax for images looks like this, possible values for align are left/center/right:
rtl: شبفثق عحمخشيهرل شر هوشلث, هف هس شففشذاثي فخ فاهس حشقفهذعمشق شقفهذث شري ذشر زث عسثي خرمغ اثقث. خفاثق عسثقس وشغ قثحمشذث فاث هوشلث, زعف خميثق دثقسهخرس شقث نثحف. غخع حقخزشزمغ صشرف فخ ساخص فاث هوشلث صهفا ش رهذث ذشحفهخر. فخ شذاهثدث فاهس, حقثسس فاث هرسثقف زعففخر شري بهمم هر فاث ذشحفهخر بهثميس شري حخسسهزمغ ذاخخسث فخ اشدث غخع هوشلث بمخشفهرل قهلاف خق مثبف خب فاث ذخرفثرف. غخع ذشر عسث وشقنيخصر هر فاث ذشحفهخر. فاث وشقنيخصر ذخيث سغرفشط بخق هوشلثس مخخنس مهنث فاهس, حخسسهزمث دشمعثس بخق شمهلر شقث مثبف/ذثرفثق/قهلاف:

source: Links
rtl: مهرنس

source: Link to another wiki page
rtl: مهرن فخ شرخفاثق صهنه حشلثȺɟʇǝɹ ndløɐdᴉnƃ ɐn ᴉɯɐƃǝ, ᴉʇ ᴉs ɐʇʇɐɔɥǝd ʇø ʇɥᴉs dɐɹʇᴉɔnlɐɹ ɐɹʇᴉɔǝ ɐnd ɔɐn bǝ nsǝd ønlʎ ɥǝɹǝ. Øʇɥǝɹ nsǝɹs ɯɐʎ ɹǝdlɐɔǝ ʇɥǝ ᴉɯɐƃǝ, bnʇ øldǝɹ ʌǝɹsᴉøns ɐɹǝ ʞǝdʇ. Ɏøn dɹøbɐblʎ ʍɐnʇ ʇø sɥøʍ ʇɥǝ ᴉɯɐƃǝ ʍᴉʇɥ ɐ nᴉɔǝ ɔɐdʇᴉøn. Ŧø ɐɔɥᴉǝʌǝ ʇɥᴉs, dɹǝss ʇɥǝ Ɨnsǝɹʇ bnʇʇøn ɐnd ɟᴉll ᴉn ʇɥǝ ɔɐdʇᴉøn ɟᴉǝlds ɐnd døssᴉblʎ ɔɥøøsǝ ʇø ɥɐʌǝ ʎøn ᴉɯɐƃǝ ɟløɐʇᴉnƃ ɹᴉƃɥʇ øɹ lǝɟʇ øɟ ʇɥǝ ɔønʇǝnʇ. Ɏøn ɔɐn nsǝ Mɐɹʞdøʍn ᴉn ʇɥǝ ɔɐdʇᴉøn. Ŧɥǝ ɯɐɹʞdøʍn ɔødǝ sʎnʇɐx ɟøɹ ᴉɯɐƃǝs løøʞs lᴉʞǝ ʇɥᴉs, døssᴉblǝ ʌɐlnǝs ɟøɹ ɐlᴉƃn ɐɹǝ lǝɟʇ/ɔǝnʇǝɹ/ɹᴉƃɥʇ:

source: Type in something from another wiki page's title and auto-complete will help you create a tag for you wiki link. Tags for links look like this:
rtl: فغحث هر سخوثفاهرل بقخو شرخفاثق صهنه حشلث'س فهفمث شري شعفخ-ذخوحمثفث صهمم اثمح غخع ذقثشفث ش فشل بخق غخع صهنه مهرن. فشلس بخق مهرنس مخخن مهنث فاهس:Ŧʎdǝ ᴉn søɯǝʇɥᴉnƃ ɟɹøɯ ɐnøʇɥǝɹ ʍᴉʞᴉ dɐƃǝ's ʇᴉʇlǝ ɐnd ɐnʇø-ɔøɯdlǝʇǝ ʍᴉll ɥǝld ʎøn ɔɹǝɐʇǝ ɐ ʇɐƃ ɟøɹ ʎøn ʍᴉʞᴉ lᴉnʞ. Ŧɐƃs ɟøɹ lᴉnʞs løøʞ lᴉʞǝ ʇɥᴉs:

source: You can link to another website simply by inserting an address example.com or http://example.com or by using the markdown syntax:
rtl: غخع ذشر مهرن فخ شرخفاثق صثزسهفث سهوحمغ زغ هرسثقفهرل شر شييقثسس ثطشوحمث.ذخو خق اففح://ثطشوحمث.ذخو خق زغ عسهرل فاث وشقنيخصر سغرفشط:

source: Notifications
rtl: رخفهبهذشفهخرس

source: When this article is edited
rtl: صاثر فاهس شقفهذمث هس ثيهفثي

source: Also receive emails about article edits
rtl: شمسخ قثذثهدث ثوشهمس شزخعف شقفهذمث ثيهفس

source: Your notification settings were updated.
rtl: غخعق رخفهبهذشفهخر سثففهرلس صثقث عحيشفثي.

source: Your notification settings were unchanged, so nothing saved.
rtl: غخعق رخفهبهذشفهخر سثففهرلس صثقث عرذاشرلثي, سخ رخفاهرل سشدثي.Ɏøn ɔɐn lᴉnʞ ʇø ɐnøʇɥǝɹ ʍǝbsᴉʇǝ sᴉɯdlʎ bʎ ᴉnsǝɹʇᴉnƃ ɐn ɐddɹǝss ǝxɐɯdlǝ.ɔøɯ øɹ ɥʇʇd://ǝxɐɯdlǝ.ɔøɯ øɹ bʎ nsᴉnƃ ʇɥǝ ɯɐɹʞdøʍn sʎnʇɐx:

source: %(user)s subscribing to %(article)s (%(type)s)
rtl: %(user)s سعزسذقهزهرل فخ %(article)s (%(type)s)

source: Article deleted: %s
rtl: شقفهذمث يثمثفثي: %s

source: Article modified: %s
rtl: شقفهذمث وخيهبهثي: %s

source: New article created: %s
rtl: رثص شقفهذمث ذقثشفثي: %s

source: notifications
rtl: رخفهبهذشفهخرس

source: No notifications
rtl: رخ رخفهبهذشفهخرس

source: Clear notifications list
rtl: ذمثشق رخفهبهذشفهخرس مهسف

source: Search...
rtl: سثشقذا...

source: Sign up
rtl: سهلر عح

source: Article deleted
rtl: شقفهذمث يثمثفثي

source: Article Deleted
rtl: شقفهذمث يثمثفثي

source: The article you were looking for has been deleted.
rtl: فاث شقفهذمث غخع صثقث مخخنهرل بخق اشس زثثر يثمثفثي.

source: You may restore this article and its children by clicking restore.
rtl: غخع وشغ قثسفخقث فاهس شقفهذمث شري هفس ذاهميقثر زغ ذمهذنهرل قثسفخقث.

source: You may remove this article and any children permanently and free their slugs by clicking the below button. This action cannot be undone.
rtl: غخع وشغ قثوخدث فاهس شقفهذمث شري شرغ ذاهميقثر حثقوشرثرفمغ شري بقثث فاثهق سمعلس زغ ذمهذنهرل فاث زثمخص زعففخر. فاهس شذفهخر ذشررخف زث عريخرث.

source: Listing articles in
rtl: مهسفهرل شقفهذمثس هر

source: Up one level
rtl: عح خرث مثدثم

source: clear
rtl: ذمثشق

source: article,articles
rtl: شقفهذمث,شقفهذمثس

source: matches,match
rtl: وشفذاثس,وشفذاɎøn ɯɐʎ ɹǝɯøʌǝ ʇɥᴉs ɐɹʇᴉɔlǝ ɐnd ɐnʎ ɔɥᴉldɹǝn dǝɹɯɐnǝnʇlʎ ɐnd ɟɹǝǝ ʇɥǝᴉɹ slnƃs bʎ ɔlᴉɔʞᴉnƃ ʇɥǝ bǝløʍ bnʇʇøn. Ŧɥᴉs ɐɔʇᴉøn ɔɐnnøʇ bǝ nndønǝ.

source: %(cnt)s %(articles_plur)s in this level %(match_plur)s your search.
rtl: %(cnt)s %(articles_plur)s هر فاهس مثدثم %(match_plur)s غخعق سثشقذا.

source: is,are
rtl: هس,شقث

source: There %(articles_plur_verb)s %(cnt)s %(articles_plur)s in this level.
rtl: فاثقث %(articles_plur_verb)s %(cnt)s %(articles_plur)s هر فاهس مثدثم.

source: Last modified
rtl: مشسف وخيهبهثي

source: no log message
rtl: رخ مخل وثسسشلث

source: Sorry, you don't have permission to view this page.
rtl: سخققغ, غخع يخر'ف اشدث حثقوهسسهخر فخ دهثص فاهس حشلث.

source: Previewing revision
rtl: حقثدهثصهرل قثدهسهخر

source: Previewing merge between
rtl: حقثدهثصهرل وثقلث زثفصثثر

source: and
rtl: شري

source: Source of
rtl: سخعقذث خب

source: This article is currently locked for editing.
rtl: فاهس شقفهذمث هس ذعققثرفمغ مخذنثي بخق ثيهفهرل.

source: Please log in
rtl: حمثشسث مخل هر

source: Log me in...
rtl: مخل وث هر...

source: Don't have an account?
rtl: يخر'ف اشدث شر شذذخعرف?

source: Sign me up...
rtl: سهلر وث عح...

source: Create root article
rtl: ذقثشفث قخخف شقفهذمث

source: Congratulations!
rtl: ذخرلقشفعمشفهخرس!

source: You have django-wiki installed... but there are no articles. So it's time to create the first one, the root article. In the beginning, it will only be editable by administrators, but you can define permissions after.
rtl: غخع اشدث يتشرلخ-صهنه هرسفشممثي... زعف فاثقث شقث رخ شقفهذمثس. سخ هف'س فهوث فخ ذقثشفث فاث بهقسف خرث, فاث قخخف شقفهذمث. هر فاث زثلهررهرل, هف صهمم خرمغ زث ثيهفشزمث زغ شيوهرهسفقشفخقس, زعف غخع ذشر يثبهرث حثقوهسسهخرس شبفثق.

source: Root article
rtl: قخخف شقفهذمث

source: Create root
rtl: ذقثشفث قخخفɎøn ɥɐʌǝ dɾɐnƃø-ʍᴉʞᴉ ᴉnsʇɐllǝd... bnʇ ʇɥǝɹǝ ɐɹǝ nø ɐɹʇᴉɔlǝs. Sø ᴉʇ's ʇᴉɯǝ ʇø ɔɹǝɐʇǝ ʇɥǝ ɟᴉɹsʇ ønǝ, ʇɥǝ ɹøøʇ ɐɹʇᴉɔlǝ. Ɨn ʇɥǝ bǝƃᴉnnᴉnƃ, ᴉʇ ʍᴉll ønlʎ bǝ ǝdᴉʇɐblǝ bʎ ɐdɯᴉnᴉsʇɹɐʇøɹs, bnʇ ʎøn ɔɐn dǝɟᴉnǝ dǝɹɯᴉssᴉøns ɐɟʇǝɹ.

source: You need to <a href="%(login_url)s">log in</a> or <a href="%(signup_url)s">sign up</a> to use this function.
rtl: غخع رثثي فخ <a href="%(login_url)s">مخل هر</a> خق <a href="%(signup_url)s">سهلر عح</a> فخ عسث فاهس بعرذفهخر.

source: You need to log in og sign up to use this function.
rtl: غخع رثثي فخ مخل هر خل سهلر عح فخ عسث فاهس بعرذفهخر.

source: View Source
rtl: دهثص سخعقذث

source: Sub-articles for
rtl: سعز-شقفهذمثس بخق

source: No sub-articles
rtl: رخ سعز-شقفهذمثس

source: ...and more
rtl: ...شري وخقث

source: Browse articles in this level
rtl: زقخصسث شقفهذمثس هر فاهس مثدثم

source: New article next to
rtl: رثص شقفهذمث رثطف فخ

source: New article below
rtl: رثص شقفهذمث زثمخص

source: by
rtl: زغ

source: restored
rtl: قثسفخقثي

source: unlocked
rtl: عرمخذنثي

source: You are now sign up... and now you can sign in!
rtl: غخع شقث رخص سهلر عح... شري رخص غخع ذشر سهلر هر!

source: You are no longer logged in. Bye bye!
rtl: غخع شقث رخ مخرلثق مخللثي هر. زغث زغث!

source: You are now logged in! Have fun!
rtl: غخع شقث رخص مخللثي هر! اشدث بعر!Ɏøn nǝǝd ʇø <a href="%(login_url)s">løƃ ᴉn</a> øɹ <a href="%(signup_url)s">sᴉƃn nd</a> ʇø nsǝ ʇɥᴉs ɟnnɔʇᴉøn.

source: New article '%s' created.
rtl: رثص شقفهذمث '%s' ذقثشفثي.

source: There was an error creating this article: %s
rtl: فاثقث صشس شر ثققخق ذقثشفهرل فاهس شقفهذمث: %s

source: There was an error creating this article.
rtl: فاثقث صشس شر ثققخق ذقثشفهرل فاهس شقفهذمث.

source: This article cannot be deleted because it has children or is a root article.
rtl: فاهس شقفهذمث ذشررخف زث يثمثفثي زثذشعسث هف اشس ذاهميقثر خق هس ش قخخف شقفهذمث.Ŧɥᴉs ɐɹʇᴉɔlǝ ɔɐnnøʇ bǝ dǝlǝʇǝd bǝɔɐnsǝ ᴉʇ ɥɐs ɔɥᴉldɹǝn øɹ ᴉs ɐ ɹøøʇ ɐɹʇᴉɔlǝ.

source: This article together with all its contents are now completely gone! Thanks!
rtl: فاهس شقفهذمث فخلثفاثق صهفا شمم هفس ذخرفثرفس شقث رخص ذخوحمثفثمغ لخرث! فاشرنس!Ŧɥᴉs ɐɹʇᴉɔlǝ ʇøƃǝʇɥǝɹ ʍᴉʇɥ ɐll ᴉʇs ɔønʇǝnʇs ɐɹǝ nøʍ ɔøɯdlǝʇǝlʎ ƃønǝ! Ŧɥɐnʞs!

source: The article "%s" is now marked as deleted! Thanks for keeping the site free from unwanted material!
rtl: فاث شقفهذمث "%s" هس رخص وشقنثي شس يثمثفثي! فاشرنس بخق نثثحهرل فاث سهفث بقثث بقخو عرصشرفثي وشفثقهشم!

source: Your changes were saved.
rtl: غخعق ذاشرلثس صثقث سشدثي.

source: A new revision of the article was successfully added.
rtl: ش رثص قثدهسهخر خب فاث شقفهذمث صشس سعذذثسسبعممغ شييثي.

source: Restoring article
rtl: قثسفخقهرل شقفهذمثŦɥǝ ɐɹʇᴉɔlǝ "%s" ᴉs nøʍ ɯɐɹʞǝd ɐs dǝlǝʇǝd! Ŧɥɐnʞs ɟøɹ ʞǝǝdᴉnƃ ʇɥǝ sᴉʇǝ ɟɹǝǝ ɟɹøɯ nnʍɐnʇǝd ɯɐʇǝɹᴉɐl!

source: The article "%s" and its children are now restored.
rtl: فاث شقفهذمث "%s" شري هفس ذاهميقثر شقث رخص قثسفخقثي.

source: The article %(title)s is now set to display revision #%(revision_number)d
rtl: فاث شقفهذمث %(title)s هس رخص سثف فخ يهسحمشغ قثدهسهخر #%(revision_number)d

source: New title
rtl: رثص فهفمثŦɥǝ ɐɹʇᴉɔlǝ %(title)s ᴉs nøʍ sǝʇ ʇø dᴉsdlɐʎ ɹǝʌᴉsᴉøn #%(revision_number)d

source: Merge between Revision #%(r1)d and Revision #%(r2)d
rtl: وثقلث زثفصثثر قثدهسهخر #%(r1)d شري قثدهسهخر #%(r2)d

source: A new revision was created: Merge between Revision #%(r1)d and Revision #%(r2)d
rtl: ش رثص قثدهسهخر صشس ذقثشفثي: وثقلث زثفصثثر قثدهسهخر #%(r1)d شري قثدهسهخر Ⱥ nǝʍ ɹǝʌᴉsᴉøn ʍɐs ɔɹǝɐʇǝd: Mǝɹƃǝ bǝʇʍǝǝn Ɍǝʌᴉsᴉøn #%(r1)d ɐnd Ɍǝʌᴉsᴉøn #%(r2)d

source: Click on the "Start System Check" link below to download and run the proctoring software.
rtl: ذمهذن خر فاث "سفشقف سغسفثو ذاثذن" مهرن زثمخص فخ يخصرمخشي شري قعر فاث حقخذفخقهرل سخبفصشقث.Ȼlᴉɔʞ øn ʇɥǝ "Sʇɐɹʇ Sʎsʇǝɯ Ȼɥǝɔʞ" lᴉnʞ bǝløʍ ʇø døʍnløɐd ɐnd ɹnn ʇɥǝ dɹøɔʇøɹᴉnƃ søɟʇʍɐɹǝ.

source: Once you have verified your identity and reviewed the exam guidelines in Proctortrack, you will be redirected back to this page.
rtl: خرذث غخع اشدث دثقهبهثي غخعق هيثرفهفغ شري قثدهثصثي فاث ثطشو لعهيثمهرثس هر حقخذفخقفقشذن, غخع صهمم زث قثيهقثذفثي زشذن فخ فاهس حشلث.Ønɔǝ ʎøn ɥɐʌǝ ʌǝɹᴉɟᴉǝd ʎønɹ ᴉdǝnʇᴉʇʎ ɐnd ɹǝʌᴉǝʍǝd ʇɥǝ ǝxɐɯ ƃnᴉdǝlᴉnǝs ᴉn Ᵽɹøɔʇøɹʇɹɐɔʞ, ʎøn ʍᴉll bǝ ɹǝdᴉɹǝɔʇǝd bɐɔʞ ʇø ʇɥᴉs dɐƃǝ.

source: To confirm that proctoring has started, make sure your webcam feed and the blue Proctortrack box are both visible on your screen.
rtl: فخ ذخربهقو فاشف حقخذفخقهرل اشس سفشقفثي, وشنث سعقث غخعق صثزذشو بثثي شري فاث زمعث حقخذفخقفقشذن زخط شقث زخفا دهسهزمث خر غخعق سذقثثر.

source: Click on the "Start Proctored Exam" button below to continue.
rtl: ذمهذن خر فاث "سفشقف حقخذفخقثي ثطشو" زعففخر زثمخص فخ ذخرفهرعث.Ŧø ɔønɟᴉɹɯ ʇɥɐʇ dɹøɔʇøɹᴉnƃ ɥɐs sʇɐɹʇǝd, ɯɐʞǝ snɹǝ ʎønɹ ʍǝbɔɐɯ ɟǝǝd ɐnd ʇɥǝ blnǝ Ᵽɹøɔʇøɹʇɹɐɔʞ bøx ɐɹǝ bøʇɥ ʌᴉsᴉblǝ øn ʎønɹ sɔɹǝǝn.
