Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use by this course for the specified duration. Please do not share the API key with other courses and notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
rtl: ثرفثق فاث شحه نثغ حقخدهيثي زغ وشفاصخقنس بخق شذذثسسهرل فاث وشفمشز اخسفثي سثقدهذث. فاهس نثغ هس لقشرفثي بخق ثطذمعسهدث عسث زغ فاهس ذخعقسث بخق فاث سحثذهبهثي يعقشفهخر. حمثشسث يخ رخف ساشقث فاث شحه نثغ صهفا خفاثق ذخعقسثس شري رخفهبغ وشفاصخقنس هووثيهشفثمغ هب غخع زثمهثدث فاث نثغ هس ثطحخسثي خق ذخوحقخوهسثي. فخ خزفشهر ش نثغ بخق غخعق ذخعقسث, خق فخ قثحخقف شر هسسعث, حمثشسث ذخرفشذف وخخذسعححخقف@وشفاصخقنس.ذخوɆnʇǝɹ ʇɥǝ ȺⱣƗ ʞǝʎ dɹøʌᴉdǝd bʎ MɐʇɥWøɹʞs ɟøɹ ɐɔɔǝssᴉnƃ ʇɥǝ MȺŦŁȺɃ Ħøsʇǝd Sǝɹʌᴉɔǝ. Ŧɥᴉs ʞǝʎ ᴉs ƃɹɐnʇǝd ɟøɹ ǝxɔlnsᴉʌǝ nsǝ bʎ ʇɥᴉs ɔønɹsǝ ɟøɹ ʇɥǝ sdǝɔᴉɟᴉǝd dnɹɐʇᴉøn. Ᵽlǝɐsǝ dø nøʇ sɥɐɹǝ ʇɥǝ ȺⱣƗ ʞǝʎ ʍᴉʇɥ øʇɥǝɹ ɔønɹsǝs ɐnd nøʇᴉɟʎ MɐʇɥWøɹʞs ᴉɯɯǝdᴉɐʇǝlʎ ᴉɟ ʎøn bǝlᴉǝʌǝ ʇɥǝ ʞǝʎ ᴉs ǝxdøsǝd øɹ ɔøɯdɹøɯᴉsǝd. Ŧø øbʇɐᴉn ɐ ʞǝʎ ɟøɹ ʎønɹ ɔønɹsǝ, øɹ ʇø ɹǝdøɹʇ ɐn ᴉssnǝ, dlǝɐsǝ ɔønʇɐɔʇ ɯøøɔsnddøɹʇ@ɯɐʇɥʍøɹʞs.ɔøɯ

source: We're sorry, there was an error with processing your request. Please try reloading your page and trying again.
rtl: صث'قث سخققغ, فاثقث صشس شر ثققخق صهفا حقخذثسسهرل غخعق قثضعثسف. حمثشسث فقغ قثمخشيهرل غخعق حشلث شري فقغهرل شلشهر.Wǝ'ɹǝ søɹɹʎ, ʇɥǝɹǝ ʍɐs ɐn ǝɹɹøɹ ʍᴉʇɥ dɹøɔǝssᴉnƃ ʎønɹ ɹǝbnǝsʇ. Ᵽlǝɐsǝ ʇɹʎ ɹǝløɐdᴉnƃ ʎønɹ dɐƃǝ ɐnd ʇɹʎᴉnƃ ɐƃɐᴉn.

source: The state of this problem has changed since you loaded this page. Please refresh your page.
rtl: فاث سفشفث خب فاهس حقخزمثو اشس ذاشرلثي سهرذث غخع مخشيثي فاهس حشلث. حمثشسث قثبقثسا غخعق حشلث.

source: Answer ID
rtl: شرسصثق هي

source: Question
rtl: ضعثسفهخر

source: Correct Answer
rtl: ذخققثذف شرسصثقŦɥǝ sʇɐʇǝ øɟ ʇɥᴉs dɹøblǝɯ ɥɐs ɔɥɐnƃǝd sᴉnɔǝ ʎøn løɐdǝd ʇɥᴉs dɐƃǝ. Ᵽlǝɐsǝ ɹǝɟɹǝsɥ ʎønɹ dɐƃǝ.

source: Submit
rtl: سعزوهف

source: Submitting
rtl: سعزوهففهرل

source: Warning: The problem has been reset to its initial state!
rtl: صشقرهرل: فاث حقخزمثو اشس زثثر قثسثف فخ هفس هرهفهشم سفشفث!

source: The problem's state was corrupted by an invalid submission. The submission consisted of:
rtl: فاث حقخزمثو'س سفشفث صشس ذخققعحفثي زغ شر هردشمهي سعزوهسسهخر. فاث سعزوهسسهخر ذخرسهسفثي خب:

source: If this error persists, please contact the course staff.
rtl: هب فاهس ثققخق حثقسهسفس, حمثشسث ذخرفشذف فاث ذخعقسث سفشبب.Ŧɥǝ dɹøblǝɯ's sʇɐʇǝ ʍɐs ɔøɹɹndʇǝd bʎ ɐn ᴉnʌɐlᴉd snbɯᴉssᴉøn. Ŧɥǝ snbɯᴉssᴉøn ɔønsᴉsʇǝd øɟ:

source: Hint ({hint_num} of {hints_count}):
rtl: اهرف ({hint_num} خب {hints_count}):

source: Your answers were previously saved. Click '{button_name}' to grade them.
rtl: غخعق شرسصثقس صثقث حقثدهخعسمغ سشدثي. ذمهذن '{button_name}' فخ لقشيث فاثو.Ɏønɹ ɐnsʍǝɹs ʍǝɹǝ dɹǝʌᴉønslʎ sɐʌǝd. Ȼlᴉɔʞ '{button_name}' ʇø ƃɹɐdǝ ʇɥǝɯ.

source: Incorrect ({progress} point)
rtl: هرذخققثذف ({progress} حخهرف)

source: Correct ({progress} point)
rtl: ذخققثذف ({progress} حخهرف)

source: Partially correct ({progress} point)
rtl: حشقفهشممغ ذخققثذف ({progress} حخهرف)

source: Partially Correct
rtl: حشقفهشممغ ذخققثذف

source: Answer submitted.
rtl: شرسصثق سعزوهففثي.

source: Problem is closed.
rtl: حقخزمثو هس ذمخسثي.

source: Problem must be reset before it can be submitted again.
rtl: حقخزمثو وعسف زث قثسثف زثبخقث هف ذشر زث سعزوهففثي شلشهر.

source: You must wait at least {wait} seconds between submissions.
rtl: غخع وعسف صشهف شف مثشسف {wait} سثذخريس زثفصثثر سعزوهسسهخرس.

source: You must wait at least {wait_secs} between submissions. {remaining_secs} remaining.
rtl: غخع وعسف صشهف شف مثشسف {wait_secs} زثفصثثر سعزوهسسهخرس. {remaining_secs} قثوشهرهرل.Ɏøn ɯnsʇ ʍɐᴉʇ ɐʇ lǝɐsʇ {wait_secs} bǝʇʍǝǝn snbɯᴉssᴉøns. {remaining_secs} ɹǝɯɐᴉnᴉnƃ.

source: {num_hour} hour
rtl: {num_hour} اخعق

source: {num_minute} minute
rtl: {num_minute} وهرعفث

source: {num_second} second
rtl: {num_second} سثذخري

source: Problem needs to be reset prior to save.
rtl: حقخزمثو رثثيس فخ زث قثسثف حقهخق فخ سشدث.

source: Your answers have been saved.
rtl: غخعق شرسصثقس اشدث زثثر سشدثي.

source: Your answers have been saved but not graded. Click '{button_name}' to grade them.
rtl: غخعق شرسصثقس اشدث زثثر سشدثي زعف رخف لقشيثي. ذمهذن '{button_name}' فخ لقشيث فاثو.Ɏønɹ ɐnsʍǝɹs ɥɐʌǝ bǝǝn sɐʌǝd bnʇ nøʇ ƃɹɐdǝd. Ȼlᴉɔʞ '{button_name}' ʇø ƃɹɐdǝ ʇɥǝɯ.

source: You cannot select Reset for a problem that is closed.
rtl: غخع ذشررخف سثمثذف قثسثف بخق ش حقخزمثو فاشف هس ذمخسثي.

source: You must submit an answer before you can select Reset.
rtl: غخع وعسف سعزوهف شر شرسصثق زثبخقث غخع ذشر سثمثذف قثسثف.

source: Problem's definition does not support rescoring.
rtl: حقخزمثو'س يثبهرهفهخر يخثس رخف سعححخقف قثسذخقهرل.

source: Problem must be answered before it can be graded again.
rtl: حقخزمثو وعسف زث شرسصثقثي زثبخقث هف ذشر زث لقشيثي شلشهر.

source: Conditional
rtl: ذخريهفهخرشم

source: List of urls of children that are references to external modules
rtl: مهسف خب عقمس خب ذاهميقثر فاشف شقث قثبثقثرذثس فخ ثطفثقرشم وخيعمثس

source: Source Components
rtl: سخعقذث ذخوحخرثرفس

source: The component location IDs of all source components that are used to determine whether a learner is shown the content of this conditional module. Copy the component location ID of a component from its Settings dialog in Studio.
rtl: فاث ذخوحخرثرف مخذشفهخر هيس خب شمم سخعقذث ذخوحخرثرفس فاشف شقث عسثي فخ يثفثقوهرث صاثفاثق ش مثشقرثق هس ساخصر فاث ذخرفثرف خب فاهس ذخريهفهخرشم وخيعمث. ذخحغ فاث ذخوحخرثرف مخذشفهخر هي خب ش ذخوحخرثرف بقخو هفس سثففهرلس يهشمخل هر سفعيهخ.

source: Conditional Attribute
rtl: ذخريهفهخرشم شففقهزعفثŦɥǝ ɔøɯdønǝnʇ løɔɐʇᴉøn ƗĐs øɟ ɐll sønɹɔǝ ɔøɯdønǝnʇs ʇɥɐʇ ɐɹǝ nsǝd ʇø dǝʇǝɹɯᴉnǝ ʍɥǝʇɥǝɹ ɐ lǝɐɹnǝɹ ᴉs sɥøʍn ʇɥǝ ɔønʇǝnʇ øɟ ʇɥᴉs ɔøndᴉʇᴉønɐl ɯødnlǝ. Ȼødʎ ʇɥǝ ɔøɯdønǝnʇ løɔɐʇᴉøn ƗĐ øɟ ɐ ɔøɯdønǝnʇ ɟɹøɯ ᴉʇs Sǝʇʇᴉnƃs dᴉɐløƃ ᴉn Sʇndᴉø.

source: The attribute of the source components that determines whether a learner is shown the content of this conditional module.
rtl: فاث شففقهزعفث خب فاث سخعقذث ذخوحخرثرفس فاشف يثفثقوهرثس صاثفاثق ش مثشقرثق هس ساخصر فاث ذخرفثرف خب فاهس ذخريهفهخرشم وخيعمث.

source: Conditional Value
rtl: ذخريهفهخرشم دشمعثŦɥǝ ɐʇʇɹᴉbnʇǝ øɟ ʇɥǝ sønɹɔǝ ɔøɯdønǝnʇs ʇɥɐʇ dǝʇǝɹɯᴉnǝs ʍɥǝʇɥǝɹ ɐ lǝɐɹnǝɹ ᴉs sɥøʍn ʇɥǝ ɔønʇǝnʇ øɟ ʇɥᴉs ɔøndᴉʇᴉønɐl ɯødnlǝ.

source: The value that the conditional attribute of the source components must match before a learner is shown the content of this conditional module.
rtl: فاث دشمعث فاشف فاث ذخريهفهخرشم شففقهزعفث خب فاث سخعقذث ذخوحخرثرفس وعسف وشفذا زثبخقث ش مثشقرثق هس ساخصر فاث ذخرفثرف خب فاهس ذخريهفهخرشم وخيعمث.

source: Blocked Content Message
rtl: زمخذنثي ذخرفثرف وثسسشلثŦɥǝ ʌɐlnǝ ʇɥɐʇ ʇɥǝ ɔøndᴉʇᴉønɐl ɐʇʇɹᴉbnʇǝ øɟ ʇɥǝ sønɹɔǝ ɔøɯdønǝnʇs ɯnsʇ ɯɐʇɔɥ bǝɟøɹǝ ɐ lǝɐɹnǝɹ ᴉs sɥøʍn ʇɥǝ ɔønʇǝnʇ øɟ ʇɥᴉs ɔøndᴉʇᴉønɐl ɯødnlǝ.

source: The message that is shown to learners when not all conditions are met to show the content of this conditional module. Include {link} in the text of your message to give learners a direct link to required units. For example, 'You must complete {link} before you can access this unit'.
rtl: فاث وثسسشلث فاشف هس ساخصر فخ مثشقرثقس صاثر رخف شمم ذخريهفهخرس شقث وثف فخ ساخص فاث ذخرفثرف خب فاهس ذخريهفهخرشم وخيعمث. هرذمعيث {link} هر فاث فثطف خب غخعق وثسسشلث فخ لهدث مثشقرثقس ش يهقثذف مهرن فخ قثضعهقثي عرهفس. بخق ثطشوحمث, 'غخع وعسف ذخوحمثفث {link} زثبخقث غخع ذشر شذذثسس فاهس عرهف'.Ŧɥǝ ɯǝssɐƃǝ ʇɥɐʇ ᴉs sɥøʍn ʇø lǝɐɹnǝɹs ʍɥǝn nøʇ ɐll ɔøndᴉʇᴉøns ɐɹǝ ɯǝʇ ʇø sɥøʍ ʇɥǝ ɔønʇǝnʇ øɟ ʇɥᴉs ɔøndᴉʇᴉønɐl ɯødnlǝ. Ɨnɔlndǝ {link} ᴉn ʇɥǝ ʇǝxʇ øɟ ʎønɹ ɯǝssɐƃǝ ʇø ƃᴉʌǝ lǝɐɹnǝɹs ɐ dᴉɹǝɔʇ lᴉnʞ ʇø ɹǝbnᴉɹǝd nnᴉʇs. Føɹ ǝxɐɯdlǝ, 'Ɏøn ɯnsʇ ɔøɯdlǝʇǝ {link} bǝɟøɹǝ ʎøn ɔɐn ɐɔɔǝss ʇɥᴉs nnᴉʇ'.

source: You must complete {link} before you can access this unit.
rtl: غخع وعسف ذخوحمثفث {link} زثبخقث غخع ذشر شذذثسس فاهس عرهف.

source: This component has no source components configured yet.
rtl: فاهس ذخوحخرثرف اشس رخ سخعقذث ذخوحخرثرفس ذخربهلعقثي غثف.

source: Configure list of sources
rtl: ذخربهلعقث مهسف خب سخعقذثس

source: LTI Passports
rtl: مفه حشسسحخقفس

source: Enter the passports for course LTI tools in the following format: "id:client_key:client_secret".
rtl: ثرفثق فاث حشسسحخقفس بخق ذخعقسث مفه فخخمس هر فاث بخممخصهرل بخقوشف: "هي:ذمهثرف_نثغ:ذمهثرف_سثذقثف".Ɇnʇǝɹ ʇɥǝ dɐssdøɹʇs ɟøɹ ɔønɹsǝ ŁŦƗ ʇøøls ᴉn ʇɥǝ ɟølløʍᴉnƃ ɟøɹɯɐʇ: "ᴉd:ɔlᴉǝnʇ_ʞǝʎ:ɔlᴉǝnʇ_sǝɔɹǝʇ".

source: List of Textbook objects with (title, url) for textbooks used in this course
rtl: مهسف خب فثطفزخخن خزتثذفس صهفا (فهفمث, عقم) بخق فثطفزخخنس عسثي هر فاهس ذخعقسث

source: Slug that points to the wiki for this course
rtl: سمعل فاشف حخهرفس فخ فاث صهنه بخق فاهس ذخعقسث

source: Date that enrollment for this class is opened
rtl: يشفث فاشف ثرقخمموثرف بخق فاهس ذمشسس هس خحثرثي

source: Date that enrollment for this class is closed
rtl: يشفث فاشف ثرقخمموثرف بخق فاهس ذمشسس هس ذمخسثي

source: Start time when this module is visible
rtl: سفشقف فهوث صاثر فاهس وخيعمث هس دهسهزمث

source: Date that this class ends
rtl: يشفث فاشف فاهس ذمشسس ثريس

source: Date that certificates become available to learners
rtl: يشفث فاشف ذثقفهبهذشفثس زثذخوث شدشهمشزمث فخ مثشقرثقس

source: Cosmetic Course Display Price
rtl: ذخسوثفهذ ذخعقسث يهسحمشغ حقهذثŁᴉsʇ øɟ Ŧǝxʇbøøʞ øbɾǝɔʇs ʍᴉʇɥ (ʇᴉʇlǝ, nɹl) ɟøɹ ʇǝxʇbøøʞs nsǝd ᴉn ʇɥᴉs ɔønɹsǝ

source: The cost displayed to students for enrolling in the course. If a paid course registration price is set by an administrator in the database, that price will be displayed instead of this one.
rtl: فاث ذخسف يهسحمشغثي فخ سفعيثرفس بخق ثرقخممهرل هر فاث ذخعقسث. هب ش حشهي ذخعقسث قثلهسفقشفهخر حقهذث هس سثف زغ شر شيوهرهسفقشفخق هر فاث يشفشزشسث, فاشف حقهذث صهمم زث يهسحمشغثي هرسفثشي خب فاهس خرث.

source: Course Advertised Start
rtl: ذخعقسث شيدثقفهسثي سفشقفŦɥǝ ɔøsʇ dᴉsdlɐʎǝd ʇø sʇndǝnʇs ɟøɹ ǝnɹøllᴉnƃ ᴉn ʇɥǝ ɔønɹsǝ. Ɨɟ ɐ dɐᴉd ɔønɹsǝ ɹǝƃᴉsʇɹɐʇᴉøn dɹᴉɔǝ ᴉs sǝʇ bʎ ɐn ɐdɯᴉnᴉsʇɹɐʇøɹ ᴉn ʇɥǝ dɐʇɐbɐsǝ, ʇɥɐʇ dɹᴉɔǝ ʍᴉll bǝ dᴉsdlɐʎǝd ᴉnsʇǝɐd øɟ ʇɥᴉs ønǝ.

source: Enter the text that you want to use as the advertised starting time frame for the course, such as "Winter 2018". If you enter null for this value, the start date that you have set for this course is used.
rtl: ثرفثق فاث فثطف فاشف غخع صشرف فخ عسث شس فاث شيدثقفهسثي سفشقفهرل فهوث بقشوث بخق فاث ذخعقسث, سعذا شس "صهرفثق 2018". هب غخع ثرفثق رعمم بخق فاهس دشمعث, فاث سفشقف يشفث فاشف غخع اشدث سثف بخق فاهس ذخعقسث هس عسثي.

source: Pre-Requisite Courses
rtl: حقث-قثضعهسهفث ذخعقسثس

source: Pre-Requisite Course key if this course has a pre-requisite course
rtl: حقث-قثضعهسهفث ذخعقسث نثغ هب فاهس ذخعقسث اشس ش حقث-قثضعهسهفث ذخعقسث

source: Grading policy definition for this class
rtl: لقشيهرل حخمهذغ يثبهرهفهخر بخق فاهس ذمشسس

source: Show Calculator
rtl: ساخص ذشمذعمشفخقɆnʇǝɹ ʇɥǝ ʇǝxʇ ʇɥɐʇ ʎøn ʍɐnʇ ʇø nsǝ ɐs ʇɥǝ ɐdʌǝɹʇᴉsǝd sʇɐɹʇᴉnƃ ʇᴉɯǝ ɟɹɐɯǝ ɟøɹ ʇɥǝ ɔønɹsǝ, snɔɥ ɐs "Wᴉnʇǝɹ 2018". Ɨɟ ʎøn ǝnʇǝɹ nnll ɟøɹ ʇɥᴉs ʌɐlnǝ, ʇɥǝ sʇɐɹʇ dɐʇǝ ʇɥɐʇ ʎøn ɥɐʌǝ sǝʇ ɟøɹ ʇɥᴉs ɔønɹsǝ ᴉs nsǝd.

source: Enter true or false. When true, students can see the calculator in the course.
rtl: ثرفثق فقعث خق بشمسث. صاثر فقعث, سفعيثرفس ذشر سثث فاث ذشمذعمشفخق هر فاث ذخعقسث.

source: Enter the name of the course as it should appear in the course list.
rtl: ثرفثق فاث رشوث خب فاث ذخعقسث شس هف ساخعمي شححثشق هر فاث ذخعقسث مهسف.

source: Course Display Name
rtl: ذخعقسث يهسحمشغ رشوثɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Wɥǝn ʇɹnǝ, sʇndǝnʇs ɔɐn sǝǝ ʇɥǝ ɔɐlɔnlɐʇøɹ ᴉn ʇɥǝ ɔønɹsǝ.

source: Course Editor
rtl: ذخعقسث ثيهفخق

source: Enter the method by which this course is edited ("XML" or "Studio").
rtl: ثرفثق فاث وثفاخي زغ صاهذا فاهس ذخعقسث هس ثيهفثي ("طوم" خق "سفعيهخ").

source: Course Survey URL
rtl: ذخعقسث سعقدثغ عقم

source: Enter the URL for the end-of-course survey. If your course does not have a survey, enter null.
rtl: ثرفثق فاث عقم بخق فاث ثري-خب-ذخعقسث سعقدثغ. هب غخعق ذخعقسث يخثس رخف اشدث ش سعقدثغ, ثرفثق رعمم.

source: Discussion Blackout Dates
rtl: يهسذعسسهخر زمشذنخعف يشفثسɆnʇǝɹ ʇɥǝ ɄɌŁ ɟøɹ ʇɥǝ ǝnd-øɟ-ɔønɹsǝ snɹʌǝʎ. Ɨɟ ʎønɹ ɔønɹsǝ døǝs nøʇ ɥɐʌǝ ɐ snɹʌǝʎ, ǝnʇǝɹ nnll.

source: Enter pairs of dates between which students cannot post to discussion forums. Inside the provided brackets, enter an additional set of square brackets surrounding each pair of dates you add. Format each pair of dates as ["YYYY-MM-DD", "YYYY-MM-DD"]. To specify times as well as dates, format each pair as ["YYYY-MM-DDTHH:MM", "YYYY-MM-DDTHH:MM"]. Be sure to include the "T" between the date and time. For example, an entry defining two blackout periods looks like this, including the outer pair of square brackets: [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]
rtl: ثرفثق حشهقس خب يشفثس زثفصثثر صاهذا سفعيثرفس ذشررخف حخسف فخ يهسذعسسهخر بخقعوس. هرسهيث فاث حقخدهيثي زقشذنثفس, ثرفثق شر شييهفهخرشم سثف خب سضعشقث زقشذنثفس سعققخعريهرل ثشذا حشهق خب يشفثس غخع شيي. بخقوشف ثشذا حشهق خب يشفثس شس ["غغغغ-وو-يي", "غغغغ-وو-يي"]. فخ سحثذهبغ فهوثس شس صثمم شس يشفثس, بخقوشف ثشذا حشهق شس ["غغغغ-وو-ييفاا:وو", "غغغغ-وو-ييفاا:وو"]. زث سعقث فخ هرذمعيث فاث "ف" زثفصثثر فاث يشفث شري فهوث. بخق ثطشوحمث, شر ثرفقغ يثبهرهرل فصخ زمشذنخعف حثقهخيس مخخنس مهنث فاهس, هرذمعيهرل فاث خعفثق حشهق خب سضعشقث زقشذنثفس: [["2015-09-15", "2015-09-21"], ["2015-10-01", Ɇnʇǝɹ dɐᴉɹs øɟ dɐʇǝs bǝʇʍǝǝn ʍɥᴉɔɥ sʇndǝnʇs ɔɐnnøʇ døsʇ ʇø dᴉsɔnssᴉøn ɟøɹnɯs. Ɨnsᴉdǝ ʇɥǝ dɹøʌᴉdǝd bɹɐɔʞǝʇs, ǝnʇǝɹ ɐn ɐddᴉʇᴉønɐl sǝʇ øɟ sbnɐɹǝ bɹɐɔʞǝʇs snɹɹønndᴉnƃ ǝɐɔɥ dɐᴉɹ øɟ dɐʇǝs ʎøn ɐdd. Føɹɯɐʇ ǝɐɔɥ dɐᴉɹ øɟ dɐʇǝs ɐs ["ɎɎɎɎ-MM-ĐĐ", "ɎɎɎɎ-MM-ĐĐ"]. Ŧø sdǝɔᴉɟʎ ʇᴉɯǝs ɐs ʍǝll ɐs dɐʇǝs, ɟøɹɯɐʇ ǝɐɔɥ dɐᴉɹ ɐs ["ɎɎɎɎ-MM-ĐĐŦĦĦ:MM", "ɎɎɎɎ-MM-ĐĐŦĦĦ:MM"]. Ƀǝ snɹǝ ʇø ᴉnɔlndǝ ʇɥǝ "Ŧ" bǝʇʍǝǝn ʇɥǝ dɐʇǝ ɐnd ʇᴉɯǝ. Føɹ ǝxɐɯdlǝ, ɐn ǝnʇɹʎ dǝɟᴉnᴉnƃ ʇʍø blɐɔʞønʇ dǝɹᴉøds løøʞs lᴉʞǝ ʇɥᴉs, ᴉnɔlndᴉnƃ ʇɥǝ ønʇǝɹ dɐᴉɹ øɟ sbnɐɹǝ bɹɐɔʞǝʇs: [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]

source: Discussion Topic Mapping
rtl: يهسذعسسهخر فخحهذ وشححهرل

source: Enter discussion categories in the following format: "CategoryName": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. For example, one discussion category may be "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. The "id" value for each category must be unique. In "id" values, the only special characters that are supported are underscore, hyphen, and period. You can also specify a category as the default for new posts in the Discussion page by setting its "default" attribute to true. For example, "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1", "default": true}.
rtl: ثرفثق يهسذعسسهخر ذشفثلخقهثس هر فاث بخممخصهرل بخقوشف: "ذشفثلخقغرشوث": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. بخق ثطشوحمث, خرث يهسذعسسهخر ذشفثلخقغ وشغ زث "مغيهشر وخيث": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. فاث "هي" دشمعث بخق ثشذا ذشفثلخقغ وعسف زث عرهضعث. هر "هي" دشمعثس, فاث خرمغ سحثذهشم ذاشقشذفثقس فاشف شقث سعححخقفثي شقث عريثقسذخقث, اغحاثر, شري حثقهخي. غخع ذشر شمسخ سحثذهبغ ش ذشفثلخقغ شس فاث يثبشعمف بخق رثص حخسفس هر فاث يهسذعسسهخر حشلث زغ سثففهرل هفس "يثبشعمف" شففقهزعفث فخ فقعث. بخق ثطشوحمث, "مغيهشر وخيث": {"id": Ɇnʇǝɹ dᴉsɔnssᴉøn ɔɐʇǝƃøɹᴉǝs ᴉn ʇɥǝ ɟølløʍᴉnƃ ɟøɹɯɐʇ: "ȻɐʇǝƃøɹʎNɐɯǝ": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. Føɹ ǝxɐɯdlǝ, ønǝ dᴉsɔnssᴉøn ɔɐʇǝƃøɹʎ ɯɐʎ bǝ "Łʎdᴉɐn Mødǝ": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. Ŧɥǝ "ᴉd" ʌɐlnǝ ɟøɹ ǝɐɔɥ ɔɐʇǝƃøɹʎ ɯnsʇ bǝ nnᴉbnǝ. Ɨn "ᴉd" ʌɐlnǝs, ʇɥǝ ønlʎ sdǝɔᴉɐl ɔɥɐɹɐɔʇǝɹs ʇɥɐʇ ɐɹǝ snddøɹʇǝd ɐɹǝ nndǝɹsɔøɹǝ, ɥʎdɥǝn, ɐnd dǝɹᴉød. Ɏøn ɔɐn ɐlsø sdǝɔᴉɟʎ ɐ ɔɐʇǝƃøɹʎ ɐs ʇɥǝ dǝɟɐnlʇ ɟøɹ nǝʍ døsʇs ᴉn ʇɥǝ Đᴉsɔnssᴉøn dɐƃǝ bʎ sǝʇʇᴉnƃ ᴉʇs "dǝɟɐnlʇ" ɐʇʇɹᴉbnʇǝ ʇø ʇɹnǝ. Føɹ ǝxɐɯdlǝ, "Łʎdᴉɐn Mødǝ": {"id": "i4x-UniversityX-MUS101-course-2015_T1", "default": true}.

source: Discussion Sorting Alphabetical
rtl: يهسذعسسهخر سخقفهرل شمحاشزثفهذشم

source: Enter true or false. If true, discussion categories and subcategories are sorted alphabetically. If false, they are sorted chronologically by creation date and time.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, يهسذعسسهخر ذشفثلخقهثس شري سعزذشفثلخقهثس شقث سخقفثي شمحاشزثفهذشممغ. هب بشمسث, فاثغ شقث سخقفثي ذاقخرخمخلهذشممغ زغ ذقثشفهخر يشفث شري فهوث.

source: Course Announcement Date
rtl: ذخعقسث شررخعرذثوثرف يشفث

source: Enter the date to announce your course.
rtl: ثرفثق فاث يشفث فخ شررخعرذث غخعق ذخعقسث.

source: Cohort Configuration
rtl: ذخاخقف ذخربهلعقشفهخرɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, dᴉsɔnssᴉøn ɔɐʇǝƃøɹᴉǝs ɐnd snbɔɐʇǝƃøɹᴉǝs ɐɹǝ søɹʇǝd ɐldɥɐbǝʇᴉɔɐllʎ. Ɨɟ ɟɐlsǝ, ʇɥǝʎ ɐɹǝ søɹʇǝd ɔɥɹønøløƃᴉɔɐllʎ bʎ ɔɹǝɐʇᴉøn dɐʇǝ ɐnd ʇᴉɯǝ.

source: Discussions Plugin Settings
rtl: Đᴉsɔnssᴉøns Ᵽlnƃᴉn Sǝʇʇᴉnƃs

source: Settings for discussions plugins.
rtl: Sǝʇʇᴉnƃs ɟøɹ dᴉsɔnssᴉøns dlnƃᴉns.

source: Enter policy keys and values to enable the cohort feature, define automated student assignment to groups, or identify any course-wide discussion topics as private to cohort members.
rtl: ثرفثق حخمهذغ نثغس شري دشمعثس فخ ثرشزمث فاث ذخاخقف بثشفعقث, يثبهرث شعفخوشفثي سفعيثرف شسسهلروثرف فخ لقخعحس, خق هيثرفهبغ شرغ ذخعقسث-صهيث يهسذعسسهخر فخحهذس شس حقهدشفث فخ ذخاخقف وثوزثقس.

source: Course Is New
rtl: ذخعقسث هس رثصɆnʇǝɹ dølᴉɔʎ ʞǝʎs ɐnd ʌɐlnǝs ʇø ǝnɐblǝ ʇɥǝ ɔøɥøɹʇ ɟǝɐʇnɹǝ, dǝɟᴉnǝ ɐnʇøɯɐʇǝd sʇndǝnʇ ɐssᴉƃnɯǝnʇ ʇø ƃɹønds, øɹ ᴉdǝnʇᴉɟʎ ɐnʎ ɔønɹsǝ-ʍᴉdǝ dᴉsɔnssᴉøn ʇødᴉɔs ɐs dɹᴉʌɐʇǝ ʇø ɔøɥøɹʇ ɯǝɯbǝɹs.

source: Enter true or false. If true, the course appears in the list of new courses, and a New! badge temporarily appears next to the course image.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, فاث ذخعقسث شححثشقس هر فاث مهسف خب رثص ذخعقسثس, شري ش رثص! زشيلث فثوحخقشقهمغ شححثشقس رثطف فخ فاث ذخعقسث هوشلث.

source: Mobile Course Available
rtl: وخزهمث ذخعقسث شدشهمشزمثɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, ʇɥǝ ɔønɹsǝ ɐddǝɐɹs ᴉn ʇɥǝ lᴉsʇ øɟ nǝʍ ɔønɹsǝs, ɐnd ɐ Nǝʍ! bɐdƃǝ ʇǝɯdøɹɐɹᴉlʎ ɐddǝɐɹs nǝxʇ ʇø ʇɥǝ ɔønɹsǝ ᴉɯɐƃǝ.

source: Enter true or false. If true, the course will be available to mobile devices.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, فاث ذخعقسث صهمم زث شدشهمشزمث فخ وخزهمث يثدهذثس.

source: Video Upload Credentials
rtl: دهيثخ عحمخشي ذقثيثرفهشمسɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, ʇɥǝ ɔønɹsǝ ʍᴉll bǝ ɐʌɐᴉlɐblǝ ʇø ɯøbᴉlǝ dǝʌᴉɔǝs.

source: Enter the unique identifier for your course's video files provided by {platform_name}.
rtl: ثرفثق فاث عرهضعث هيثرفهبهثق بخق غخعق ذخعقسث'س دهيثخ بهمثس حقخدهيثي زغ Ɇnʇǝɹ ʇɥǝ nnᴉbnǝ ᴉdǝnʇᴉɟᴉǝɹ ɟøɹ ʎønɹ ɔønɹsǝ's ʌᴉdǝø ɟᴉlǝs dɹøʌᴉdǝd bʎ {platform_name}.

source: Course Not Graded
rtl: ذخعقسث رخف لقشيثي

source: Enter true or false. If true, the course will not be graded.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, فاث ذخعقسث صهمم رخف زث لقشيثي.

source: Disable Progress Graph
rtl: يهسشزمث حقخلقثسس لقشحا

source: Enter true or false. If true, students cannot view the progress graph.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, سفعيثرفس ذشررخف دهثص فاث حقخلقثسس لقشحا.

source: PDF Textbooks
rtl: حيب فثطفزخخنس

source: List of dictionaries containing pdf_textbook configuration
rtl: مهسف خب يهذفهخرشقهثس ذخرفشهرهرل حيب_فثطفزخخن ذخربهلعقشفهخر

source: HTML Textbooks
rtl: افوم فثطفزخخنسɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, sʇndǝnʇs ɔɐnnøʇ ʌᴉǝʍ ʇɥǝ dɹøƃɹǝss ƃɹɐdɥ.

source: For HTML textbooks that appear as separate tabs in the course, enter the name of the tab (usually the title of the book) as well as the URLs and titles of each chapter in the book.
rtl: بخق افوم فثطفزخخنس فاشف شححثشق شس سثحشقشفث فشزس هر فاث ذخعقسث, ثرفثق فاث رشوث خب فاث فشز (عسعشممغ فاث فهفمث خب فاث زخخن) شس صثمم شس فاث عقمس شري فهفمثس خب ثشذا ذاشحفثق هر فاث زخخن.

source: Remote Gradebook
rtl: قثوخفث لقشيثزخخنFøɹ ĦŦMŁ ʇǝxʇbøøʞs ʇɥɐʇ ɐddǝɐɹ ɐs sǝdɐɹɐʇǝ ʇɐbs ᴉn ʇɥǝ ɔønɹsǝ, ǝnʇǝɹ ʇɥǝ nɐɯǝ øɟ ʇɥǝ ʇɐb (nsnɐllʎ ʇɥǝ ʇᴉʇlǝ øɟ ʇɥǝ bøøʞ) ɐs ʍǝll ɐs ʇɥǝ ɄɌŁs ɐnd ʇᴉʇlǝs øɟ ǝɐɔɥ ɔɥɐdʇǝɹ ᴉn ʇɥǝ bøøʞ.

source: Enter the remote gradebook mapping. Only use this setting when REMOTE_GRADEBOOK_URL has been specified.
rtl: ثرفثق فاث قثوخفث لقشيثزخخن وشححهرل. خرمغ عسث فاهس سثففهرل صاثر قثوخفث_لقشيثزخخن_عقم اشس زثثر سحثذهبهثي.Ɇnʇǝɹ ʇɥǝ ɹǝɯøʇǝ ƃɹɐdǝbøøʞ ɯɐddᴉnƃ. Ønlʎ nsǝ ʇɥᴉs sǝʇʇᴉnƃ ʍɥǝn ɌɆMØŦɆ_ǤɌȺĐɆɃØØꝀ_ɄɌŁ ɥɐs bǝǝn sdǝɔᴉɟᴉǝd.

source: Enable CCX
rtl: ثرشزمث ذذط

source: Allow course instructors to assign CCX Coach roles, and allow coaches to manage Custom Courses on {platform_name}. When false, Custom Courses cannot be created, but existing Custom Courses will be preserved.
rtl: شممخص ذخعقسث هرسفقعذفخقس فخ شسسهلر ذذط ذخشذا قخمثس, شري شممخص ذخشذاثس فخ وشرشلث ذعسفخو ذخعقسثس خر {platform_name}. صاثر بشمسث, ذعسفخو ذخعقسثس ذشررخف زث ذقثشفثي, زعف ثطهسفهرل ذعسفخو ذخعقسثس صهمم زث حقثسثقدثي.Ⱥlløʍ ɔønɹsǝ ᴉnsʇɹnɔʇøɹs ʇø ɐssᴉƃn ȻȻX Ȼøɐɔɥ ɹølǝs, ɐnd ɐlløʍ ɔøɐɔɥǝs ʇø ɯɐnɐƃǝ Ȼnsʇøɯ Ȼønɹsǝs øn {platform_name}. Wɥǝn ɟɐlsǝ, Ȼnsʇøɯ Ȼønɹsǝs ɔɐnnøʇ bǝ ɔɹǝɐʇǝd, bnʇ ǝxᴉsʇᴉnƃ Ȼnsʇøɯ Ȼønɹsǝs ʍᴉll bǝ dɹǝsǝɹʌǝd.

source: CCX Connector URL
rtl: ذذط ذخررثذفخق عقم

source: URL for CCX Connector application for managing creation of CCXs. (optional). Ignored unless 'Enable CCX' is set to 'true'.
rtl: عقم بخق ذذط ذخررثذفخق شححمهذشفهخر بخق وشرشلهرل ذقثشفهخر خب ذذطس. (خحفهخرشم). هلرخقثي عرمثسس 'ثرشزمث ذذط' هس سثف فخ 'فقعث'.

source: Allow Anonymous Discussion Posts
rtl: شممخص شرخرغوخعس يهسذعسسهخر حخسفسɄɌŁ ɟøɹ ȻȻX Ȼønnǝɔʇøɹ ɐddlᴉɔɐʇᴉøn ɟøɹ ɯɐnɐƃᴉnƃ ɔɹǝɐʇᴉøn øɟ ȻȻXs. (ødʇᴉønɐl). Ɨƃnøɹǝd nnlǝss 'Ɇnɐblǝ ȻȻX' ᴉs sǝʇ ʇø 'ʇɹnǝ'.

source: Enter true or false. If true, students can create discussion posts that are anonymous to all users.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, سفعيثرفس ذشر ذقثشفث يهسذعسسهخر حخسفس فاشف شقث شرخرغوخعس فخ شمم عسثقس.

source: Allow Anonymous Discussion Posts to Peers
rtl: شممخص شرخرغوخعس يهسذعسسهخر حخسفس فخ حثثقسɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, sʇndǝnʇs ɔɐn ɔɹǝɐʇǝ dᴉsɔnssᴉøn døsʇs ʇɥɐʇ ɐɹǝ ɐnønʎɯøns ʇø ɐll nsǝɹs.

source: Enter true or false. If true, students can create discussion posts that are anonymous to other students. This setting does not make posts anonymous to course staff.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, سفعيثرفس ذشر ذقثشفث يهسذعسسهخر حخسفس فاشف شقث شرخرغوخعس فخ خفاثق سفعيثرفس. فاهس سثففهرل يخثس رخف وشنث حخسفس شرخرغوخعس فخ ذخعقسث سفشبب.Ɇnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, sʇndǝnʇs ɔɐn ɔɹǝɐʇǝ dᴉsɔnssᴉøn døsʇs ʇɥɐʇ ɐɹǝ ɐnønʎɯøns ʇø øʇɥǝɹ sʇndǝnʇs. Ŧɥᴉs sǝʇʇᴉnƃ døǝs nøʇ ɯɐʞǝ døsʇs ɐnønʎɯøns ʇø ɔønɹsǝ sʇɐɟɟ.

source: Advanced Module List
rtl: شيدشرذثي وخيعمث مهسف

source: Enter the names of the advanced modules to use in your course.
rtl: ثرفثق فاث رشوثس خب فاث شيدشرذثي وخيعمثس فخ عسث هر غخعق ذخعقسث.

source: Course Home Sidebar Name
rtl: ذخعقسث اخوث سهيثزشق رشوث

source: Enter the heading that you want students to see above your course handouts on the Course Home page. Your course handouts appear in the right panel of the page.
rtl: ثرفثق فاث اثشيهرل فاشف غخع صشرف سفعيثرفس فخ سثث شزخدث غخعق ذخعقسث اشريخعفس خر فاث ذخعقسث اخوث حشلث. غخعق ذخعقسث اشريخعفس شححثشق هر فاث قهلاف حشرثم خب فاث حشلث.

source: Course Handouts
rtl: ذخعقسث اشريخعفسɆnʇǝɹ ʇɥǝ ɥǝɐdᴉnƃ ʇɥɐʇ ʎøn ʍɐnʇ sʇndǝnʇs ʇø sǝǝ ɐbøʌǝ ʎønɹ ɔønɹsǝ ɥɐndønʇs øn ʇɥǝ Ȼønɹsǝ Ħøɯǝ dɐƃǝ. Ɏønɹ ɔønɹsǝ ɥɐndønʇs ɐddǝɐɹ ᴉn ʇɥǝ ɹᴉƃɥʇ dɐnǝl øɟ ʇɥǝ dɐƃǝ.

source: True if timezones should be shown on dates in the course. Deprecated in favor of due_date_display_format.
rtl: فقعث هب فهوثظخرثس ساخعمي زث ساخصر خر يشفثس هر فاث ذخعقسث. يثحقثذشفثي هر بشدخق خب يعث_يشفث_يهسحمشغ_بخقوشف.

source: Due Date Display Format
rtl: يعث يشفث يهسحمشغ بخقوشفŦɹnǝ ᴉɟ ʇᴉɯǝzønǝs sɥønld bǝ sɥøʍn øn dɐʇǝs ᴉn ʇɥǝ ɔønɹsǝ. Đǝdɹǝɔɐʇǝd ᴉn ɟɐʌøɹ øɟ dnǝ_dɐʇǝ_dᴉsdlɐʎ_ɟøɹɯɐʇ.

source: Enter the format for due dates. The default is Mon DD, YYYY. Enter "%m-%d-%Y" for MM-DD-YYYY, "%d-%m-%Y" for DD-MM-YYYY, "%Y-%m-%d" for YYYY-MM-DD, or "%Y-%d-%m" for YYYY-DD-MM.
rtl: ثرفثق فاث بخقوشف بخق يعث يشفثس. فاث يثبشعمف هس وخر يي, غغغغ. ثرفثق "%و-%d-%غ" بخق وو-يي-غغغغ, "%d-%و-%غ" بخق يي-وو-غغغغ, "%غ-%و-%d" بخق غغغغ-وو-يي, خق "%غ-%d-%و" بخق غغغغ-يي-وو.

source: External Login Domain
rtl: ثطفثقرشم مخلهر يخوشهر

source: Enter the external login method students can use for the course.
rtl: ثرفثق فاث ثطفثقرشم مخلهر وثفاخي سفعيثرفس ذشر عسث بخق فاث ذخعقسث.

source: Certificates Downloadable Before End
rtl: ذثقفهبهذشفثس يخصرمخشيشزمث زثبخقث ثريɆnʇǝɹ ʇɥǝ ɟøɹɯɐʇ ɟøɹ dnǝ dɐʇǝs. Ŧɥǝ dǝɟɐnlʇ ᴉs Møn ĐĐ, ɎɎɎɎ. Ɇnʇǝɹ "%ɯ-%d-%Ɏ" ɟøɹ MM-ĐĐ-ɎɎɎɎ, "%d-%ɯ-%Ɏ" ɟøɹ ĐĐ-MM-ɎɎɎɎ, "%Ɏ-%ɯ-%d" ɟøɹ ɎɎɎɎ-MM-ĐĐ, øɹ "%Ɏ-%d-%ɯ" ɟøɹ ɎɎɎɎ-ĐĐ-MM.
