Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Current ID Verification Status: Pending
rtl: ذعققثرف هي دثقهبهذشفهخر سفشفعس: حثريهرل

source: Your {platform_name} ID verification is pending. Your ID verification information has been submitted and will be reviewed shortly.
rtl: غخعق {platform_name} هي دثقهبهذشفهخر هس حثريهرل. غخعق هي دثقهبهذشفهخر هربخقوشفهخر اشس زثثر سعزوهففثي شري صهمم زث قثدهثصثي ساخقفمغ.

source: Current ID Verification Status: Denied
rtl: ذعققثرف هي دثقهبهذشفهخر سفشفعس: يثرهثي

source: Your ID verification submission was not accepted. To receive a verified certificate, you must submit a new photo of yourself and your government-issued photo ID before the verification deadline for your course.
rtl: غخعق هي دثقهبهذشفهخر سعزوهسسهخر صشس رخف شذذثحفثي. فخ قثذثهدث ش دثقهبهثي ذثقفهبهذشفث, غخع وعسف سعزوهف ش رثص حاخفخ خب غخعقسثمب شري غخعق لخدثقروثرف-هسسعثي حاخفخ هي زثبخقث فاث دثقهبهذشفهخر يثشيمهرث بخق غخعق ذخعقسث.

source: Your ID verification was denied for the following reasons:
rtl: غخعق هي دثقهبهذشفهخر صشس يثرهثي بخق فاث بخممخصهرل قثشسخرس:

source: Current ID Verification Status: Expired
rtl: ذعققثرف هي دثقهبهذشفهخر سفشفعس: ثطحهقثي

source: Your ID verification has expired. To receive a verified certificate, you must submit a new photo of yourself and your government-issued photo ID before the verification deadline for your course.
rtl: غخعق هي دثقهبهذشفهخر اشس ثطحهقثي. فخ قثذثهدث ش دثقهبهثي ذثقفهبهذشفث, غخع وعسف سعزوهف ش رثص حاخفخ خب غخعقسثمب شري غخعق لخدثقروثرف-هسسعثي حاخفخ هي زثبخقث فاث دثقهبهذشفهخر يثشيمهرث بخق غخعق ذخعقسث.

source: Please be aware photo verification can take up to three days once initiated and you will not be able to earn a certificate or take a proctored exam until approved.
rtl: حمثشسث زث شصشقث حاخفخ دثقهبهذشفهخر ذشر فشنث عح فخ فاقثث يشغس خرذث هرهفهشفثي شري غخع صهمم رخف زث شزمث فخ ثشقر ش ذثقفهبهذشفث خق فشنث ش حقخذفخقثي ثطشو عرفهم شححقخدثي.

source: Could Not Link Accounts
rtl: ذخعمي رخف مهرن شذذخعرفسŦø ɐɔɔǝss ʇɥᴉs ɔønɹsǝ, ʎøn ɯnsʇ ɟᴉɹsʇ ɔønsǝnʇ ʇø sɥɐɹǝ ʎønɹ lǝɐɹnᴉnƃ ɐɔɥᴉǝʌǝɯǝnʇs ʍᴉʇɥ {enterprise_customer_name}.

source: The {provider_name} account you selected is already linked to another {platform_name} account.
rtl: فاث {provider_name} شذذخعرف غخع سثمثذفثي هس شمقثشيغ مهرنثي فخ شرخفاثق {platform_name} شذذخعرف.Ŧɥǝ {provider_name} ɐɔɔønnʇ ʎøn sǝlǝɔʇǝd ᴉs ɐlɹǝɐdʎ lᴉnʞǝd ʇø ɐnøʇɥǝɹ {platform_name} ɐɔɔønnʇ.

source: We're sorry to see you go! Read the following statements and rate your level of agreement.
rtl: صث'قث سخققغ فخ سثث غخع لخ! قثشي فاث بخممخصهرل سفشفثوثرفس شري قشفث غخعق مثدثم خب شلقثثوثرف.

source: Price is too high for me
rtl: حقهذث هس فخخ اهلا بخق وث

source: I was not satisfied with my experience taking the courses
rtl: ه صشس رخف سشفهسبهثي صهفا وغ ثطحثقهثرذث فشنهرل فاث ذخعقسثس

source: Content of the courses was too difficult
rtl: ذخرفثرف خب فاث ذخعقسثس صشس فخخ يهببهذعمف

source: I did not have enough time to complete the courses
rtl: ه يهي رخف اشدث ثرخعلا فهوث فخ ذخوحمثفث فاث ذخعقسثس

source: The content was not available when I wanted to start
rtl: فاث ذخرفثرف صشس رخف شدشهمشزمث صاثر ه صشرفثي فخ سفشقف

source: Can we contact you via email for follow up?
rtl: ذشر صث ذخرفشذف غخع دهش ثوشهم بخق بخممخص عح?Wǝ'ɹǝ søɹɹʎ ʇø sǝǝ ʎøn ƃø! Ɍǝɐd ʇɥǝ ɟølløʍᴉnƃ sʇɐʇǝɯǝnʇs ɐnd ɹɐʇǝ ʎønɹ lǝʌǝl øɟ ɐƃɹǝǝɯǝnʇ.

source: Thank you for sharing your reasons for unenrolling.
rtl: فاشرن غخع بخق ساشقهرل غخعق قثشسخرس بخق عرثرقخممهرل.

source: You are unenrolled from
rtl: غخع شقث عرثرقخممثي بقخو

source: Return To Dashboard
rtl: قثفعقر فخ يشسازخشقي

source: Browse Courses
rtl: زقخصسث ذخعقسثس

source: We're sorry to see you go! Please share your main reason for unenrolling.
rtl: صث'قث سخققغ فخ سثث غخع لخ! حمثشسث ساشقث غخعق وشهر قثشسخر بخق عرثرقخممهرل.

source: I just wanted to browse the material
rtl: ه تعسف صشرفثي فخ زقخصسث فاث وشفثقهشم

source: This won't help me reach my goals
rtl: فاهس صخر'ف اثمح وث قثشذا وغ لخشمس

source: I don't have the time
rtl: ه يخر'ف اشدث فاث فهوث

source: I don't have the academic or language prerequisites
rtl: ه يخر'ف اشدث فاث شذشيثوهذ خق مشرلعشلث حقثقثضعهسهفثس

source: I don't have enough support
rtl: ه يخر'ف اشدث ثرخعلا سعححخقف

source: I am not happy with the quality of the content
rtl: ه شو رخف اشححغ صهفا فاث ضعشمهفغ خب فاث ذخرفثرف

source: The course material was too hard
rtl: فاث ذخعقسث وشفثقهشم صشس فخخ اشقي

source: The course material was too easy
rtl: فاث ذخعقسث وشفثقهشم صشس فخخ ثشسغ

source: Something was broken
rtl: سخوثفاهرل صشس زقخنثر

source: Other
rtl: خفاثق

source: Results:
rtl: قثسعمفس:

source: Topic:
rtl: فخحهذ:

source: Show Discussion
rtl: ساخص يهسذعسسهخرWǝ'ɹǝ søɹɹʎ ʇø sǝǝ ʎøn ƃø! Ᵽlǝɐsǝ sɥɐɹǝ ʎønɹ ɯɐᴉn ɹǝɐsøn ɟøɹ nnǝnɹøllᴉnƃ.

source: To view live discussions, click Preview or View Live in Unit Settings.
rtl: فخ دهثص مهدث يهسذعسسهخرس, ذمهذن حقثدهثص خق دهثص مهدث هر عرهف سثففهرلس.

source: Discussion ID: {discussion_id}
rtl: يهسذعسسهخر هي: {discussion_id}

source: Discussion topics list
rtl: يهسذعسسهخر فخحهذس مهسف

source: Filter Topics
rtl: بهمفثق فخحهذس

source: filter topics
rtl: بهمفثق فخحهذس

source: All Discussions
rtl: شمم يهسذعسسهخرس

source: Posts I'm Following
rtl: حخسفس ه'و بخممخصهرلŦø ʌᴉǝʍ lᴉʌǝ dᴉsɔnssᴉøns, ɔlᴉɔʞ Ᵽɹǝʌᴉǝʍ øɹ Vᴉǝʍ Łᴉʌǝ ᴉn Ʉnᴉʇ Sǝʇʇᴉnƃs.

source: You are viewing an educator only preview of the new discussions experience!
rtl: Ɏøn ɐɹǝ ʌᴉǝʍᴉnƃ ɐn ǝdnɔɐʇøɹ ønlʎ dɹǝʌᴉǝʍ øɟ ʇɥǝ nǝʍ dᴉsɔnssᴉøns ǝxdǝɹᴉǝnɔǝ!

source: An educator preview of new discussions experience is available!
rtl: Ⱥn ǝdnɔɐʇøɹ dɹǝʌᴉǝʍ øɟ nǝʍ dᴉsɔnssᴉøns ǝxdǝɹᴉǝnɔǝ ᴉs ɐʌɐᴉlɐblǝ!

source: View legacy experience
rtl: Vᴉǝʍ lǝƃɐɔʎ ǝxdǝɹᴉǝnɔǝ

source: Share feedback
rtl: Sɥɐɹǝ ɟǝǝdbɐɔʞ

source: View the new experience
rtl: Vᴉǝʍ ʇɥǝ nǝʍ ǝxdǝɹᴉǝnɔǝ

source: Filter:
rtl: بهمفثق:

source: Show all posts
rtl: ساخص شمم حخسفس

source: Unread posts
rtl: عرقثشي حخسفس

source: Unanswered posts
rtl: عرشرسصثقثي حخسفس

source: Flagged
rtl: بمشللثي

source: Group:
rtl: لقخعح:

source: in all groups
rtl: هر شمم لقخعحس

source: Sort:
rtl: سخقف:

source: by recent activity
rtl: زغ قثذثرف شذفهدهفغ

source: by most activity
rtl: زغ وخسف شذفهدهفغ

source: by most votes
rtl: زغ وخسف دخفثس

source: Student Notes
rtl: سفعيثرف رخفثس

source: Highlights and notes you've made in course content
rtl: اهلامهلافس شري رخفثس غخع'دث وشيث هر ذخعقسث ذخرفثرف

source: Search notes for:
rtl: سثشقذا رخفثس بخق:

source: Search notes for...
rtl: سثشقذا رخفثس بخق...

source: View notes by:
rtl: دهثص رخفثس زغ:

source: You have not made any notes in this course yet. Other students in this course are using notes to:
rtl: غخع اشدث رخف وشيث شرغ رخفثس هر فاهس ذخعقسث غثف. خفاثق سفعيثرفس هر فاهس ذخعقسث شقث عسهرل رخفثس فخ:

source: Mark a passage or concept so that it's easy to find later.
rtl: وشقن ش حشسسشلث خق ذخرذثحف سخ فاشف هف'س ثشسغ فخ بهري مشفثق.

source: Record thoughts about a specific passage or concept.
rtl: قثذخقي فاخعلافس شزخعف ش سحثذهبهذ حشسسشلث خق ذخرذثحف.Ɏøn ɥɐʌǝ nøʇ ɯɐdǝ ɐnʎ nøʇǝs ᴉn ʇɥᴉs ɔønɹsǝ ʎǝʇ. Øʇɥǝɹ sʇndǝnʇs ᴉn ʇɥᴉs ɔønɹsǝ ɐɹǝ nsᴉnƃ nøʇǝs ʇø:

source: Highlight important information to review later in the course or in future courses.
rtl: اهلامهلاف هوحخقفشرف هربخقوشفهخر فخ قثدهثص مشفثق هر فاث ذخعقسث خق هر بعفعقث ذخعقسثس.Ħᴉƃɥlᴉƃɥʇ ᴉɯdøɹʇɐnʇ ᴉnɟøɹɯɐʇᴉøn ʇø ɹǝʌᴉǝʍ lɐʇǝɹ ᴉn ʇɥǝ ɔønɹsǝ øɹ ᴉn ɟnʇnɹǝ ɔønɹsǝs.

source: Get started by making a note in something you just read, like {section_link}.
rtl: لثف سفشقفثي زغ وشنهرل ش رخفث هر سخوثفاهرل غخع تعسف قثشي, مهنث Ǥǝʇ sʇɐɹʇǝd bʎ ɯɐʞᴉnƃ ɐ nøʇǝ ᴉn søɯǝʇɥᴉnƃ ʎøn ɾnsʇ ɹǝɐd, lᴉʞǝ {section_link}.

source: Hide notes
rtl: اهيث رخفثس

source: Show notes
rtl: ساخص رخفثس

source: Thank you for your purchase of
rtl: فاشرن غخع بخق غخعق حعقذاشسث خب

source: Your payment was successful.
rtl: غخعق حشغوثرف صشس سعذذثسسبعم.

source: If you have billing questions, please read the FAQ ({faq_url}) or contact {billing_email}.
rtl: هب غخع اشدث زهممهرل ضعثسفهخرس, حمثشسث قثشي فاث بشض ({faq_url}) خق ذخرفشذف Ɨɟ ʎøn ɥɐʌǝ bᴉllᴉnƃ bnǝsʇᴉøns, dlǝɐsǝ ɹǝɐd ʇɥǝ FȺQ ({faq_url}) øɹ ɔønʇɐɔʇ {billing_email}.

source: If you have billing questions, please contact {billing_email}.
rtl: هب غخع اشدث زهممهرل ضعثسفهخرس, حمثشسث ذخرفشذف {billing_email}.

source: {order_placed_by} placed an order and mentioned your name as the Organization contact.
rtl: {order_placed_by} حمشذثي شر خقيثق شري وثرفهخرثي غخعق رشوث شس فاث خقلشرهظشفهخر ذخرفشذف.{order_placed_by} dlɐɔǝd ɐn øɹdǝɹ ɐnd ɯǝnʇᴉønǝd ʎønɹ nɐɯǝ ɐs ʇɥǝ Øɹƃɐnᴉzɐʇᴉøn ɔønʇɐɔʇ.

source: {order_placed_by} placed an order and mentioned your name as the additional receipt recipient.
rtl: {order_placed_by} حمشذثي شر خقيثق شري وثرفهخرثي غخعق رشوث شس فاث شييهفهخرشم قثذثهحف قثذهحهثرف.{order_placed_by} dlɐɔǝd ɐn øɹdǝɹ ɐnd ɯǝnʇᴉønǝd ʎønɹ nɐɯǝ ɐs ʇɥǝ ɐddᴉʇᴉønɐl ɹǝɔǝᴉdʇ ɹǝɔᴉdᴉǝnʇ.

source: The items in your order are:
rtl: فاث هفثوس هر غخعق خقيثق شقث:

source: Quantity - Description - Price
rtl: ضعشرفهفغ - يثسذقهحفهخر - حقهذث

source: Total billed to credit/debit card: {currency_symbol}{total_cost}
rtl: فخفشم زهممثي فخ ذقثيهف/يثزهف ذشقي: {currency_symbol}{total_cost}

source: Company Name:
rtl: ذخوحشرغ رشوث:

source: Purchase Order Number:
rtl: حعقذاشسث خقيثق رعوزثق:

source: Company Contact Name:
rtl: ذخوحشرغ ذخرفشذف رشوث:

source: Company Contact Email:
rtl: ذخوحشرغ ذخرفشذف ثوشهم:

source: Recipient Name:
rtl: قثذهحهثرف رشوث:

source: Recipient Email:
rtl: قثذهحهثرف ثوشهم:

source: Order Number: {order_number}
rtl: خقيثق رعوزثق: {order_number}

source: A CSV file of your registration URLs is attached. Please distribute registration URLs to each student planning to enroll using the email template below.
rtl: ش ذسد بهمث خب غخعق قثلهسفقشفهخر عقمس هس شففشذاثي. حمثشسث يهسفقهزعفث قثلهسفقشفهخر عقمس فخ ثشذا سفعيثرف حمشررهرل فخ ثرقخمم عسهرل فاث ثوشهم فثوحمشفث زثمخص.Ⱥ ȻSV ɟᴉlǝ øɟ ʎønɹ ɹǝƃᴉsʇɹɐʇᴉøn ɄɌŁs ᴉs ɐʇʇɐɔɥǝd. Ᵽlǝɐsǝ dᴉsʇɹᴉbnʇǝ ɹǝƃᴉsʇɹɐʇᴉøn ɄɌŁs ʇø ǝɐɔɥ sʇndǝnʇ dlɐnnᴉnƃ ʇø ǝnɹøll nsᴉnƃ ʇɥǝ ǝɯɐᴉl ʇǝɯdlɐʇǝ bǝløʍ.

source: Warm regards,
rtl: صشقو قثلشقيس,

source: Warm regards,<br>The {platform_name} Team
rtl: صشقو قثلشقيس,<br>فاث {platform_name} فثشو

source: Dear [[Name]]
rtl: يثشق [[رشوث]]

source: To enroll in {course_names} we have provided a registration URL for you. Please follow the instructions below to claim your access.
rtl: فخ ثرقخمم هر {course_names} صث اشدث حقخدهيثي ش قثلهسفقشفهخر عقم بخق غخع. حمثشسث بخممخص فاث هرسفقعذفهخرس زثمخص فخ ذمشهو غخعق شذذثسس.Ŧø ǝnɹøll ᴉn {course_names} ʍǝ ɥɐʌǝ dɹøʌᴉdǝd ɐ ɹǝƃᴉsʇɹɐʇᴉøn ɄɌŁ ɟøɹ ʎøn. Ᵽlǝɐsǝ ɟølløʍ ʇɥǝ ᴉnsʇɹnɔʇᴉøns bǝløʍ ʇø ɔlɐᴉɯ ʎønɹ ɐɔɔǝss.

source: Your redeem url is: [[Enter Redeem URL here from the attached CSV]]
rtl: غخعق قثيثثو عقم هس: [[ثرفثق قثيثثو عقم اثقث بقخو فاث شففشذاثي ذسد]]

source: (1) Register for an account at {site_name}
rtl: (1) قثلهسفثق بخق شر شذذخعرف شف {site_name}

source: (2) Once registered, copy the redeem URL and paste it in your web browser.
rtl: (2) خرذث قثلهسفثقثي, ذخحغ فاث قثيثثو عقم شري حشسفث هف هر غخعق صثز زقخصسثق.(2) Ønɔǝ ɹǝƃᴉsʇǝɹǝd, ɔødʎ ʇɥǝ ɹǝdǝǝɯ ɄɌŁ ɐnd dɐsʇǝ ᴉʇ ᴉn ʎønɹ ʍǝb bɹøʍsǝɹ.

source: (3) On the enrollment confirmation page, Click the 'Activate Enrollment Code' button. This will show the enrollment confirmation.
rtl: (3) خر فاث ثرقخمموثرف ذخربهقوشفهخر حشلث, ذمهذن فاث 'شذفهدشفث ثرقخمموثرف ذخيث' زعففخر. فاهس صهمم ساخص فاث ثرقخمموثرف ذخربهقوشفهخر.(3) Øn ʇɥǝ ǝnɹøllɯǝnʇ ɔønɟᴉɹɯɐʇᴉøn dɐƃǝ, Ȼlᴉɔʞ ʇɥǝ 'Ⱥɔʇᴉʌɐʇǝ Ɇnɹøllɯǝnʇ Ȼødǝ' bnʇʇøn. Ŧɥᴉs ʍᴉll sɥøʍ ʇɥǝ ǝnɹøllɯǝnʇ ɔønɟᴉɹɯɐʇᴉøn.

source: (4) You should be able to click on 'view course' button or see your course on your student dashboard at {url}
rtl: (4) غخع ساخعمي زث شزمث فخ ذمهذن خر 'دهثص ذخعقسث' زعففخر خق سثث غخعق ذخعقسث خر غخعق سفعيثرف يشسازخشقي شف {url}(4) Ɏøn sɥønld bǝ ɐblǝ ʇø ɔlᴉɔʞ øn 'ʌᴉǝʍ ɔønɹsǝ' bnʇʇøn øɹ sǝǝ ʎønɹ ɔønɹsǝ øn ʎønɹ sʇndǝnʇ dɐsɥbøɐɹd ɐʇ {url}

source: (5) Course materials will not be available until the course start date.
rtl: (5) ذخعقسث وشفثقهشمس صهمم رخف زث شدشهمشزمث عرفهم فاث ذخعقسث سفشقف يشفث.(5) Ȼønɹsǝ ɯɐʇǝɹᴉɐls ʍᴉll nøʇ bǝ ɐʌɐᴉlɐblǝ nnʇᴉl ʇɥǝ ɔønɹsǝ sʇɐɹʇ dɐʇǝ.

source: <p>Sincerely,</p><p>[[Your Signature]]</p>
rtl: <p>سهرذثقثمغ,</p><p>[[غخعق سهلرشفعقث]]</p>

source: Sorry! The photos you submitted for ID verification were not accepted, for the following reason(s):
rtl: سخققغ! فاث حاخفخس غخع سعزوهففثي بخق هي دثقهبهذشفهخر صثقث رخف شذذثحفثي, بخق فاث بخممخصهرل قثشسخر(س):

source: The photo(s) of you:
rtl: فاث حاخفخ(س) خب غخع:

source: The photo of you:
rtl: فاث حاخفخ خب غخع:

source: The photo of your ID:
rtl: فاث حاخفخ خب غخعق هي:

source: Other Reasons:
rtl: خفاثق قثشسخرس:

source: Resubmit Verification: {reverify_url}
rtl: قثسعزوهف دثقهبهذشفهخر: {reverify_url}

source: ID Verification FAQ: {faq_url}
rtl: هي دثقهبهذشفهخر بشض: {faq_url}Søɹɹʎ! Ŧɥǝ dɥøʇøs ʎøn snbɯᴉʇʇǝd ɟøɹ ƗĐ ʌǝɹᴉɟᴉɔɐʇᴉøn ʍǝɹǝ nøʇ ɐɔɔǝdʇǝd, ɟøɹ ʇɥǝ ɟølløʍᴉnƃ ɹǝɐsøn(s):

source: The {platform_name} team
rtl: فاث {platform_name} فثشو

source: Your payment was successful. You will see the charge below on your next credit or debit card statement under the company name {merchant_name}.
rtl: غخعق حشغوثرف صشس سعذذثسسبعم. غخع صهمم سثث فاث ذاشقلث زثمخص خر غخعق رثطف ذقثيهف خق يثزهف ذشقي سفشفثوثرف عريثق فاث ذخوحشرغ رشوث {merchant_name}.

source: Your order number is: {order_number}
rtl: غخعق خقيثق رعوزثق هس: {order_number}

source: Hello {full_name},
rtl: اثممخ {full_name},

source: Your {platform_name} ID verification photos have been approved.
rtl: غخعق {platform_name} هي دثقهبهذشفهخر حاخفخس اشدث زثثر شححقخدثي.Ɏønɹ dɐʎɯǝnʇ ʍɐs snɔɔǝssɟnl. Ɏøn ʍᴉll sǝǝ ʇɥǝ ɔɥɐɹƃǝ bǝløʍ øn ʎønɹ nǝxʇ ɔɹǝdᴉʇ øɹ dǝbᴉʇ ɔɐɹd sʇɐʇǝɯǝnʇ nndǝɹ ʇɥǝ ɔøɯdɐnʎ nɐɯǝ {merchant_name}.

source: Your approval status remains valid for two years, and it will expire {expiration_datetime}.
rtl: غخعق شححقخدشم سفشفعس قثوشهرس دشمهي بخق فصخ غثشقس, شري هف صهمم ثطحهقث Ɏønɹ ɐddɹøʌɐl sʇɐʇns ɹǝɯɐᴉns ʌɐlᴉd ɟøɹ ʇʍø ʎǝɐɹs, ɐnd ᴉʇ ʍᴉll ǝxdᴉɹǝ {expiration_datetime}.

source: Hi {full_name},
rtl: اه {full_name},

source: Thanks for submitting your photos!
rtl: فاشرنس بخق سعزوهففهرل غخعق حاخفخس!

source: We've received your information and the ID verification process has begun.Check for an email from us in the next few days to confirm whether your verification was successful.You can also check the status of the verification process on your dashboard.
rtl: صث'دث قثذثهدثي غخعق هربخقوشفهخر شري فاث هي دثقهبهذشفهخر حقخذثسس اشس زثلعر.ذاثذن بخق شر ثوشهم بقخو عس هر فاث رثطف بثص يشغس فخ ذخربهقو صاثفاثق غخعق دثقهبهذشفهخر صشس سعذذثسسبعم.غخع ذشر شمسخ ذاثذن فاث سفشفعس خب فاث دثقهبهذشفهخر حقخذثسس خر غخعق يشسازخشقي.Wǝ'ʌǝ ɹǝɔǝᴉʌǝd ʎønɹ ᴉnɟøɹɯɐʇᴉøn ɐnd ʇɥǝ ƗĐ ʌǝɹᴉɟᴉɔɐʇᴉøn dɹøɔǝss ɥɐs bǝƃnn.Ȼɥǝɔʞ ɟøɹ ɐn ǝɯɐᴉl ɟɹøɯ ns ᴉn ʇɥǝ nǝxʇ ɟǝʍ dɐʎs ʇø ɔønɟᴉɹɯ ʍɥǝʇɥǝɹ ʎønɹ ʌǝɹᴉɟᴉɔɐʇᴉøn ʍɐs snɔɔǝssɟnl.Ɏøn ɔɐn ɐlsø ɔɥǝɔʞ ʇɥǝ sʇɐʇns øɟ ʇɥǝ ʌǝɹᴉɟᴉɔɐʇᴉøn dɹøɔǝss øn ʎønɹ dɐsɥbøɐɹd.

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the course staff at {email}.
rtl: صث شقث سخققغ. خعق ذخعقسث سفشبب يهي رخف شححقخدث غخعق قثضعثسف فخ ذاشرلث غخعق رشوث بقخو {old_name} فخ {new_name}. هب غخع رثثي بعقفاثق شسسهسفشرذث, حمثشسث ث-وشهم فاث ذخعقسث سفشبب شف {email}.Wǝ ɐɹǝ søɹɹʎ. Ønɹ ɔønɹsǝ sʇɐɟɟ dᴉd nøʇ ɐddɹøʌǝ ʎønɹ ɹǝbnǝsʇ ʇø ɔɥɐnƃǝ ʎønɹ nɐɯǝ ɟɹøɯ {old_name} ʇø {new_name}. Ɨɟ ʎøn nǝǝd ɟnɹʇɥǝɹ ɐssᴉsʇɐnɔǝ, dlǝɐsǝ ǝ-ɯɐᴉl ʇɥǝ ɔønɹsǝ sʇɐɟɟ ɐʇ {email}.

source: We have successfully verified your identity for the {assessment} assessment in the {course_name} course.
rtl: صث اشدث سعذذثسسبعممغ دثقهبهثي غخعق هيثرفهفغ بخق فاث {assessment} شسسثسسوثرف هر فاث {course_name} ذخعقسث.Wǝ ɥɐʌǝ snɔɔǝssɟnllʎ ʌǝɹᴉɟᴉǝd ʎønɹ ᴉdǝnʇᴉʇʎ ɟøɹ ʇɥǝ {assessment} ɐssǝssɯǝnʇ ᴉn ʇɥǝ {course_name} ɔønɹsǝ.

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity.
rtl: صث ذخعمي رخف دثقهبغ غخعق هيثرفهفغ بخق فاث {assessment} شسسثسسوثرف هر فاث {course_name} ذخعقسث. غخع اشدث عسثي {used_attempts} خعف خب {allowed_attempts} شففثوحفس فخ دثقهبغ غخعق هيثرفهفغ.Wǝ ɔønld nøʇ ʌǝɹᴉɟʎ ʎønɹ ᴉdǝnʇᴉʇʎ ɟøɹ ʇɥǝ {assessment} ɐssǝssɯǝnʇ ᴉn ʇɥǝ {course_name} ɔønɹsǝ. Ɏøn ɥɐʌǝ nsǝd {used_attempts} ønʇ øɟ {allowed_attempts} ɐʇʇǝɯdʇs ʇø ʌǝɹᴉɟʎ ʎønɹ ᴉdǝnʇᴉʇʎ.

source: You must verify your identity before the assessment closes on {due_date}.
rtl: غخع وعسف دثقهبغ غخعق هيثرفهفغ زثبخقث فاث شسسثسسوثرف ذمخسثس خر {due_date}.

source: To try to verify your identity again, select the following link:
rtl: فخ فقغ فخ دثقهبغ غخعق هيثرفهفغ شلشهر, سثمثذف فاث بخممخصهرل مهرن:Ɏøn ɯnsʇ ʌǝɹᴉɟʎ ʎønɹ ᴉdǝnʇᴉʇʎ bǝɟøɹǝ ʇɥǝ ɐssǝssɯǝnʇ ɔløsǝs øn {due_date}.

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity, and verification is no longer possible.
rtl: صث ذخعمي رخف دثقهبغ غخعق هيثرفهفغ بخق فاث {assessment} شسسثسسوثرف هر فاث {course_name} ذخعقسث. غخع اشدث عسثي {used_attempts} خعف خب {allowed_attempts} شففثوحفس فخ دثقهبغ غخعق هيثرفهفغ, شري دثقهبهذشفهخر هس رخ مخرلثق حخسسهزمث.

source: To go to the courseware, select the following link:
rtl: فخ لخ فخ فاث ذخعقسثصشقث, سثمثذف فاث بخممخصهرل مهرن:Wǝ ɔønld nøʇ ʌǝɹᴉɟʎ ʎønɹ ᴉdǝnʇᴉʇʎ ɟøɹ ʇɥǝ {assessment} ɐssǝssɯǝnʇ ᴉn ʇɥǝ {course_name} ɔønɹsǝ. Ɏøn ɥɐʌǝ nsǝd {used_attempts} ønʇ øɟ {allowed_attempts} ɐʇʇǝɯdʇs ʇø ʌǝɹᴉɟʎ ʎønɹ ᴉdǝnʇᴉʇʎ, ɐnd ʌǝɹᴉɟᴉɔɐʇᴉøn ᴉs nø lønƃǝɹ døssᴉblǝ.

source: If you have any questions, you can contact student support at {support_link}.
rtl: هب غخع اشدث شرغ ضعثسفهخرس, غخع ذشر ذخرفشذف سفعيثرف سعححخقف شف Ɨɟ ʎøn ɥɐʌǝ ɐnʎ bnǝsʇᴉøns, ʎøn ɔɐn ɔønʇɐɔʇ sʇndǝnʇ snddøɹʇ ɐʇ {support_link}.

source: Thanks,
rtl: فاشرنس,

source: This Course Unavailable In Your Country
rtl: فاهس ذخعقسث عرشدشهمشزمث هر غخعق ذخعرفقغ

source: Our system indicates that you are trying to access this {platform_name} course from a country or region in which it is not currently available.
rtl: خعق سغسفثو هريهذشفثس فاشف غخع شقث فقغهرل فخ شذذثسس فاهس {platform_name} ذخعقسث بقخو ش ذخعرفقغ خق قثلهخر هر صاهذا هف هس رخف ذعققثرفمغ شدشهمشزمث.Ønɹ sʎsʇǝɯ ᴉndᴉɔɐʇǝs ʇɥɐʇ ʎøn ɐɹǝ ʇɹʎᴉnƃ ʇø ɐɔɔǝss ʇɥᴉs {platform_name} ɔønɹsǝ ɟɹøɯ ɐ ɔønnʇɹʎ øɹ ɹǝƃᴉøn ᴉn ʍɥᴉɔɥ ᴉʇ ᴉs nøʇ ɔnɹɹǝnʇlʎ ɐʌɐᴉlɐblǝ.

source: Our system indicates that you are trying to enroll in this {platform_name} course from a country or region in which it is not currently available.
rtl: خعق سغسفثو هريهذشفثس فاشف غخع شقث فقغهرل فخ ثرقخمم هر فاهس {platform_name} ذخعقسث بقخو ش ذخعرفقغ خق قثلهخر هر صاهذا هف هس رخف ذعققثرفمغ شدشهمشزمث.

source: Enrollment Successful
rtl: ثرقخمموثرف سعذذثسسبعمØnɹ sʎsʇǝɯ ᴉndᴉɔɐʇǝs ʇɥɐʇ ʎøn ɐɹǝ ʇɹʎᴉnƃ ʇø ǝnɹøll ᴉn ʇɥᴉs {platform_name} ɔønɹsǝ ɟɹøɯ ɐ ɔønnʇɹʎ øɹ ɹǝƃᴉøn ᴉn ʍɥᴉɔɥ ᴉʇ ᴉs nøʇ ɔnɹɹǝnʇlʎ ɐʌɐᴉlɐblǝ.

source: Thank you for enrolling in {course_names}. We hope you enjoy the course.
rtl: فاشرن غخع بخق ثرقخممهرل هر {course_names}. صث اخحث غخع ثرتخغ فاث ذخعقسث.

source: Thank you for enrolling in:
rtl: فاشرن غخع بخق ثرقخممهرل هر:

source: We hope you enjoy the course.
rtl: صث اخحث غخع ثرتخغ فاث ذخعقسث.

source: Financial Assistance Application
rtl: بهرشرذهشم شسسهسفشرذث شححمهذشفهخر

source: A Note to Learners
rtl: ش رخفث فخ مثشقرثقسŦɥɐnʞ ʎøn ɟøɹ ǝnɹøllᴉnƃ ᴉn {course_names}. Wǝ ɥødǝ ʎøn ǝnɾøʎ ʇɥǝ ɔønɹsǝ.

source: Dear edX Learner,
rtl: يثشق ثيط مثشقرثق,

source: EdX Financial Assistance is a program we created to give learners in all financial circumstances a chance to earn a Verified Certificate upon successful completion of an edX course.
rtl: ثيط بهرشرذهشم شسسهسفشرذث هس ش حقخلقشو صث ذقثشفثي فخ لهدث مثشقرثقس هر شمم بهرشرذهشم ذهقذعوسفشرذثس ش ذاشرذث فخ ثشقر ش دثقهبهثي ذثقفهبهذشفث عحخر سعذذثسسبعم ذخوحمثفهخر خب شر ثيط ذخعقسث.ɆdX Fᴉnɐnɔᴉɐl Ⱥssᴉsʇɐnɔǝ ᴉs ɐ dɹøƃɹɐɯ ʍǝ ɔɹǝɐʇǝd ʇø ƃᴉʌǝ lǝɐɹnǝɹs ᴉn ɐll ɟᴉnɐnɔᴉɐl ɔᴉɹɔnɯsʇɐnɔǝs ɐ ɔɥɐnɔǝ ʇø ǝɐɹn ɐ Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝ ndøn snɔɔǝssɟnl ɔøɯdlǝʇᴉøn øɟ ɐn ǝdX ɔønɹsǝ.

source: If you are interested in working toward a Verified Certificate, but cannot afford to pay the fee, please apply now. Please note that financial assistance is limited and may not be awarded to all eligible candidates.
rtl: هب غخع شقث هرفثقثسفثي هر صخقنهرل فخصشقي ش دثقهبهثي ذثقفهبهذشفث, زعف ذشررخف شببخقي فخ حشغ فاث بثث, حمثشسث شححمغ رخص. حمثشسث رخفث فاشف بهرشرذهشم شسسهسفشرذث هس مهوهفثي شري وشغ رخف زث شصشقيثي فخ شمم ثمهلهزمث ذشريهيشفثس.Ɨɟ ʎøn ɐɹǝ ᴉnʇǝɹǝsʇǝd ᴉn ʍøɹʞᴉnƃ ʇøʍɐɹd ɐ Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝ, bnʇ ɔɐnnøʇ ɐɟɟøɹd ʇø dɐʎ ʇɥǝ ɟǝǝ, dlǝɐsǝ ɐddlʎ nøʍ. Ᵽlǝɐsǝ nøʇǝ ʇɥɐʇ ɟᴉnɐnɔᴉɐl ɐssᴉsʇɐnɔǝ ᴉs lᴉɯᴉʇǝd ɐnd ɯɐʎ nøʇ bǝ ɐʍɐɹdǝd ʇø ɐll ǝlᴉƃᴉblǝ ɔɐndᴉdɐʇǝs.

source: In order to be eligible for edX Financial Assistance, you must demonstrate that paying the Verified Certificate fee would cause you economic hardship. To apply, you will be asked to answer a few questions about why you are applying and how the Verified Certificate will benefit you.
rtl: هر خقيثق فخ زث ثمهلهزمث بخق ثيط بهرشرذهشم شسسهسفشرذث, غخع وعسف يثوخرسفقشفث فاشف حشغهرل فاث دثقهبهثي ذثقفهبهذشفث بثث صخعمي ذشعسث غخع ثذخرخوهذ اشقيساهح. فخ شححمغ, غخع صهمم زث شسنثي فخ شرسصثق ش بثص ضعثسفهخرس شزخعف صاغ غخع شقث شححمغهرل شري اخص فاث دثقهبهثي ذثقفهبهذشفث صهمم زثرثبهف غخع.Ɨn øɹdǝɹ ʇø bǝ ǝlᴉƃᴉblǝ ɟøɹ ǝdX Fᴉnɐnɔᴉɐl Ⱥssᴉsʇɐnɔǝ, ʎøn ɯnsʇ dǝɯønsʇɹɐʇǝ ʇɥɐʇ dɐʎᴉnƃ ʇɥǝ Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝ ɟǝǝ ʍønld ɔɐnsǝ ʎøn ǝɔønøɯᴉɔ ɥɐɹdsɥᴉd. Ŧø ɐddlʎ, ʎøn ʍᴉll bǝ ɐsʞǝd ʇø ɐnsʍǝɹ ɐ ɟǝʍ bnǝsʇᴉøns ɐbønʇ ʍɥʎ ʎøn ɐɹǝ ɐddlʎᴉnƃ ɐnd ɥøʍ ʇɥǝ Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝ ʍᴉll bǝnǝɟᴉʇ ʎøn.

source: If your application is approved, we'll give you instructions for verifying your identity on edx.org so you can start working toward completing your edX course.
rtl: هب غخعق شححمهذشفهخر هس شححقخدثي, صث'مم لهدث غخع هرسفقعذفهخرس بخق دثقهبغهرل غخعق هيثرفهفغ خر ثيط.خقل سخ غخع ذشر سفشقف صخقنهرل فخصشقي ذخوحمثفهرل غخعق ثيط ذخعقسث.Ɨɟ ʎønɹ ɐddlᴉɔɐʇᴉøn ᴉs ɐddɹøʌǝd, ʍǝ'll ƃᴉʌǝ ʎøn ᴉnsʇɹnɔʇᴉøns ɟøɹ ʌǝɹᴉɟʎᴉnƃ ʎønɹ ᴉdǝnʇᴉʇʎ øn ǝdx.øɹƃ sø ʎøn ɔɐn sʇɐɹʇ ʍøɹʞᴉnƃ ʇøʍɐɹd ɔøɯdlǝʇᴉnƃ ʎønɹ ǝdX ɔønɹsǝ.

source: EdX is committed to making it possible for you to take high quality courses from leading institutions regardless of your financial situation, earn a Verified Certificate, and share your success with others.
rtl: ثيط هس ذخووهففثي فخ وشنهرل هف حخسسهزمث بخق غخع فخ فشنث اهلا ضعشمهفغ ذخعقسثس بقخو مثشيهرل هرسفهفعفهخرس قثلشقيمثسس خب غخعق بهرشرذهشم سهفعشفهخر, ثشقر ش دثقهبهثي ذثقفهبهذشفث, شري ساشقث غخعق سعذذثسس صهفا خفاثقس.ɆdX ᴉs ɔøɯɯᴉʇʇǝd ʇø ɯɐʞᴉnƃ ᴉʇ døssᴉblǝ ɟøɹ ʎøn ʇø ʇɐʞǝ ɥᴉƃɥ bnɐlᴉʇʎ ɔønɹsǝs ɟɹøɯ lǝɐdᴉnƃ ᴉnsʇᴉʇnʇᴉøns ɹǝƃɐɹdlǝss øɟ ʎønɹ ɟᴉnɐnɔᴉɐl sᴉʇnɐʇᴉøn, ǝɐɹn ɐ Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝ, ɐnd sɥɐɹǝ ʎønɹ snɔɔǝss ʍᴉʇɥ øʇɥǝɹs.

source: Sincerely, Anant
rtl: سهرذثقثمغ, شرشرف

source: Back to Student FAQs
rtl: زشذن فخ سفعيثرف بشضس

source: Apply for Financial Assistance
rtl: شححمغ بخق بهرشرذهشم شسسهسفشرذث

source: {platform_name} Home Page
rtl: {platform_name} اخوث حشلث

source: Options Menu
rtl: خحفهخرس وثرع

source: {begin_strong}Warning:{end_strong} Your browser is not fully supported. We strongly recommend using {chrome_link} or {ff_link}.
rtl: {begin_strong}صشقرهرل:{end_strong} غخعق زقخصسثق هس رخف بعممغ سعححخقفثي. صث سفقخرلمغ قثذخووثري عسهرل {chrome_link} خق {ff_link}.

source: Discover New
rtl: يهسذخدثق رثص

source: {name} Dashboard
rtl: {name} يشسازخشقي

source: Supplemental Links
rtl: سعححمثوثرفشم مهرنس

source: How it Works
rtl: اخص هف صخقنس{begin_strong}Wɐɹnᴉnƃ:{end_strong} Ɏønɹ bɹøʍsǝɹ ᴉs nøʇ ɟnllʎ snddøɹʇǝd. Wǝ sʇɹønƃlʎ ɹǝɔøɯɯǝnd nsᴉnƃ {chrome_link} øɹ {ff_link}.

source: Schools
rtl: سذاخخمس

source: Resume your last course
rtl: قثسعوث غخعق مشسف ذخعقسث

source: Profile
rtl: حقخبهمث

source: Order History
rtl: خقيثق اهسفخقغ

source: Add Coupon Code
rtl: شيي ذخعحخر ذخيث

source: Enter information about the coupon code below.
rtl: ثرفثق هربخقوشفهخر شزخعف فاث ذخعحخر ذخيث زثمخص.

source: Coupon Code
rtl: ذخعحخر ذخيث

source: Discount Percentage
rtl: يهسذخعرف حثقذثرفشلث

source: Description
rtl: يثسذقهحفهخر

source: Add expiration date
rtl: شيي ثطحهقشفهخر يشفث

source: Example Certificates
rtl: ثطشوحمث ذثقفهبهذشفثس
