Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: working
rtl: صخقنهرلⱣlǝɐsǝ dɹøʌᴉdǝ lɐnnɔɥ_nɹl. Ȼlᴉɔʞ "Ɇdᴉʇ", ɐnd ɟᴉll ᴉn ʇɥǝ ɹǝbnᴉɹǝd ɟᴉǝlds.

source: There has been an error on the {platform_name} servers
rtl: فاثقث اشس زثثر شر ثققخق خر فاث {platform_name} سثقدثقس

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible.
rtl: صث'قث سخققغ, فاهس وخيعمث هس فثوحخقشقهمغ عرشدشهمشزمث. خعق سفشبب هس صخقنهرل فخ بهط هف شس سخخر شس حخسسهزمث.

source: Raw data:
rtl: قشص يشفش:

source: Course View
rtl: ذخعقسث دهثص

source: View this course as:
rtl: دهثص فاهس ذخعقسث شس:Wǝ'ɹǝ søɹɹʎ, ʇɥᴉs ɯødnlǝ ᴉs ʇǝɯdøɹɐɹᴉlʎ nnɐʌɐᴉlɐblǝ. Ønɹ sʇɐɟɟ ᴉs ʍøɹʞᴉnƃ ʇø ɟᴉx ᴉʇ ɐs søøn ɐs døssᴉblǝ.

source: Staff
rtl: سفشبب

source: Learner
rtl: مثشقرثق

source: Specific learner
rtl: سحثذهبهذ مثشقرثق

source: Learner in {content_group}
rtl: مثشقرثق هر {content_group}

source: Username or email:
rtl: عسثقرشوث خق ثوشهم:

source: Set preview mode
rtl: سثف حقثدهثص وخيث

source: You are now viewing the course as {i_start}{user_name}{i_end}.
rtl: غخع شقث رخص دهثصهرل فاث ذخعقسث شس {i_start}{user_name}{i_end}.

source: View in the new experience
rtl: دهثص هر فاث رثص ثطحثقهثرذث

source: View in Studio
rtl: دهثص هر سفعيهخ

source: View in Insights
rtl: دهثص هر هرسهلافس

source: Hint
rtl: اهرف

source: Save your answer
rtl: سشدث غخعق شرسصثق

source: Reset your answer
rtl: قثسثف غخعق شرسصثق

source: Show answer
rtl: ساخص شرسصثق

source: You have used {num_used} of {num_total} attempt
rtl: غخع اشدث عسثي {num_used} خب {num_total} شففثوحف

source: Some problems have options such as save, reset, hints, or show answer. These options follow the Submit button.
rtl: سخوث حقخزمثوس اشدث خحفهخرس سعذا شس سشدث, قثسثف, اهرفس, خق ساخص شرسصثق. فاثسث خحفهخرس بخممخص فاث سعزوهف زعففخر.

source: Answers are displayed within the problem
rtl: شرسصثقس شقث يهسحمشغثي صهفاهر فاث حقخزمثو

source: Next Hint
rtl: رثطف اهرف

source: Review
rtl: قثدهثص

source: Log In
rtl: مخل هرSøɯǝ dɹøblǝɯs ɥɐʌǝ ødʇᴉøns snɔɥ ɐs sɐʌǝ, ɹǝsǝʇ, ɥᴉnʇs, øɹ sɥøʍ ɐnsʍǝɹ. Ŧɥǝsǝ ødʇᴉøns ɟølløʍ ʇɥǝ Snbɯᴉʇ bnʇʇøn.

source: Your username, email, and full name will be sent to {destination}, where the collection and use of this information will be governed by their terms of service and privacy policy.
rtl: غخعق عسثقرشوث, ثوشهم, شري بعمم رشوث صهمم زث سثرف فخ {destination}, صاثقث فاث ذخممثذفهخر شري عسث خب فاهس هربخقوشفهخر صهمم زث لخدثقرثي زغ فاثهق فثقوس خب سثقدهذث شري حقهدشذغ حخمهذغ.Ɏønɹ nsǝɹnɐɯǝ, ǝɯɐᴉl, ɐnd ɟnll nɐɯǝ ʍᴉll bǝ sǝnʇ ʇø {destination}, ʍɥǝɹǝ ʇɥǝ ɔøllǝɔʇᴉøn ɐnd nsǝ øɟ ʇɥᴉs ᴉnɟøɹɯɐʇᴉøn ʍᴉll bǝ ƃøʌǝɹnǝd bʎ ʇɥǝᴉɹ ʇǝɹɯs øɟ sǝɹʌᴉɔǝ ɐnd dɹᴉʌɐɔʎ dølᴉɔʎ.

source: E-mail
rtl: ث-وشهم

source: Return To %s
rtl: قثفعقر فخ %s

source: Re-subscribe Successful!
rtl: قث-سعزسذقهزث سعذذثسسبعم!

source: You have re-enabled forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}.
rtl: غخع اشدث قث-ثرشزمثي بخقعو رخفهبهذشفهخر ثوشهمس بقخو {platform_name}. غخع وشغ {dashboard_link_start}قثفعقر فخ غخعق يشسازخشقي{link_end}.

source: Secondary e-mail change failed
rtl: سثذخريشقغ ث-وشهم ذاشرلث بشهمثي

source: We were unable to activate your secondary email {secondary_email}
rtl: صث صثقث عرشزمث فخ شذفهدشفث غخعق سثذخريشقغ ثوشهم {secondary_email}

source: Secondary e-mail change successful!
rtl: سثذخريشقغ ث-وشهم ذاشرلث سعذذثسسبعم!Ɏøn ɥɐʌǝ ɹǝ-ǝnɐblǝd ɟøɹnɯ nøʇᴉɟᴉɔɐʇᴉøn ǝɯɐᴉls ɟɹøɯ {platform_name}. Ɏøn ɯɐʎ {dashboard_link_start}ɹǝʇnɹn ʇø ʎønɹ dɐsɥbøɐɹd{link_end}.

source: Your secondary email has been activated. Please visit {link_start}dashboard{link_end} for courses.
rtl: غخعق سثذخريشقغ ثوشهم اشس زثثر شذفهدشفثي. حمثشسث دهسهف {link_start}يشسازخشقي{link_end} بخق ذخعقسثس.

source: Important!
rtl: هوحخقفشرف!Ɏønɹ sǝɔøndɐɹʎ ǝɯɐᴉl ɥɐs bǝǝn ɐɔʇᴉʌɐʇǝd. Ᵽlǝɐsǝ ʌᴉsᴉʇ {link_start}dɐsɥbøɐɹd{link_end} ɟøɹ ɔønɹsǝs.

# unit
source: Previous
rtl: حقثدهخعس

# unit
source: Next
rtl: رثطف

source: Sequence
rtl: سثضعثرذث

source: Completed
rtl: ذخوحمثفثي

source: Sign Up for {platform_name}
rtl: سهلر عح بخق {platform_name}

source: e.g. yourname@domain.com
rtl: ث.ل. غخعقرشوث@يخوشهر.ذخو

source: e.g. yourname (shown on forums)
rtl: ث.ل. غخعقرشوث (ساخصر خر بخقعوس)

source: e.g. Your Name (for certificates)
rtl: ث.ل. غخعق رشوث (بخق ذثقفهبهذشفثس)

source: {start_li}Welcome{end_li} {name}
rtl: {start_li}صثمذخوث{end_li} {name}

source: Enter a public username:
rtl: ثرفثق ش حعزمهذ عسثقرشوث:

source: Full Name *
rtl: بعمم رشوث *

source: Ed. Completed
rtl: ثي. ذخوحمثفثي

source: Goals in signing up for {platform_name}
rtl: لخشمس هر سهلرهرل عح بخق {platform_name}

source: I agree to the {link_start}Terms of Service{link_end}
rtl: ه شلقثث فخ فاث {link_start}فثقوس خب سثقدهذث{link_end}

source: I agree to the {link_start}Honor Code{link_end}
rtl: ه شلقثث فخ فاث {link_start}اخرخق ذخيث{link_end}

source: Create My Account
rtl: ذقثشفث وغ شذذخعرف

source: Already have an account?
rtl: شمقثشيغ اشدث شر شذذخعرف?

source: Login.
rtl: مخلهر.

source: This content experiment uses group configuration '{group_configuration_name}'.
rtl: فاهس ذخرفثرف ثطحثقهوثرف عسثس لقخعح ذخربهلعقشفهخر Ŧɥᴉs ɔønʇǝnʇ ǝxdǝɹᴉɯǝnʇ nsǝs ƃɹønd ɔønɟᴉƃnɹɐʇᴉøn '{group_configuration_name}'.

source: Active Groups
rtl: شذفهدث لقخعحس

source: Inactive Groups
rtl: هرشذفهدث لقخعحس

source: Staff Debug Info
rtl: سفشبب يثزعل هربخ

source: Submission history
rtl: سعزوهسسهخر اهسفخقغ

source: {platform_name} Content Quality Assessment
rtl: {platform_name} ذخرفثرف ضعشمهفغ شسسثسسوثرف

source: Comment
rtl: ذخووثرف

source: comment
rtl: ذخووثرف

source: Tag
rtl: فشل

source: Optional tag (eg "done" or "broken"):
rtl: خحفهخرشم فشل (ثل "يخرث" خق "زقخنثر"):

source: tag
rtl: فشل

source: Add comment
rtl: شيي ذخووثرف

source: Staff Debug:
rtl: سفشبب يثزعل:

source: Score (for override only)
rtl: سذخقث (بخق خدثققهيث خرمغ)

source: Reset Learner's Attempts to Zero
rtl: قثسثف مثشقرثق'س شففثوحفس فخ ظثقخ

source: Delete Learner's State
rtl: يثمثفث مثشقرثق'س سفشفث

source: Rescore Learner's Submission
rtl: قثسذخقث مثشقرثق'س سعزوهسسهخر

source: Rescore Only If Score Improves
rtl: قثسذخقث خرمغ هب سذخقث هوحقخدثس

source: Override Score
rtl: خدثققهيث سذخقث

source: Module Fields
rtl: وخيعمث بهثميس

source: XML attributes
rtl: طوم شففقهزعفثس

source: Submission History Viewer
rtl: سعزوهسسهخر اهسفخقغ دهثصثق

source: Learner's {platform_name} email address or username:
rtl: مثشقرثق'س {platform_name} ثوشهم شييقثسس خق عسثقرشوث:

source: Enter the learner email address or username
rtl: ثرفثق فاث مثشقرثق ثوشهم شييقثسس خق عسثقرشوث

source: View History
rtl: دهثص اهسفخقغ

source: {course_number} Textbook
rtl: {course_number} فثطفزخخن

source: Textbook Navigation
rtl: فثطفزخخن رشدهلشفهخر

source: Page
rtl: حشلث

source: Previous page
rtl: حقثدهخعس حشلث

source: Next page
rtl: رثطف حشلث

source: Tracking Log
rtl: فقشذنهرل مخل

source: datetime
rtl: يشفثفهوث

source: ipaddr
rtl: هحشييق

source: source
rtl: سخعقذث

source: type
rtl: فغحث

source: Unsubscribe Successful!
rtl: عرسعزسذقهزث سعذذثسسبعم!

source: You will no longer receive forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}. If you did not mean to do this, {undo_link_start}you can re-subscribe{link_end}.
rtl: غخع صهمم رخ مخرلثق قثذثهدث بخقعو رخفهبهذشفهخر ثوشهمس بقخو {platform_name}. غخع وشغ {dashboard_link_start}قثفعقر فخ غخعق يشسازخشقي{link_end}. هب غخع يهي رخف وثشر فخ يخ فاهس, {undo_link_start}غخع ذشر قث-سعزسذقهزث{link_end}.

source: Dashboard for:
rtl: يشسازخشقي بخق:

source: Usermenu
rtl: عسثقوثرع

source: More options
rtl: وخقث خحفهخرسɎøn ʍᴉll nø lønƃǝɹ ɹǝɔǝᴉʌǝ ɟøɹnɯ nøʇᴉɟᴉɔɐʇᴉøn ǝɯɐᴉls ɟɹøɯ {platform_name}. Ɏøn ɯɐʎ {dashboard_link_start}ɹǝʇnɹn ʇø ʎønɹ dɐsɥbøɐɹd{link_end}. Ɨɟ ʎøn dᴉd nøʇ ɯǝɐn ʇø dø ʇɥᴉs, {undo_link_start}ʎøn ɔɐn ɹǝ-snbsɔɹᴉbǝ{link_end}.

source: More Options
rtl: وخقث خحفهخرس

source: Using the system
rtl: عسهرل فاث سغسفثو

source: During video playback, use the subtitles and the scroll bar to navigate. Clicking the subtitles is a fast way to skip forwards and backwards by small amounts.
rtl: يعقهرل دهيثخ حمشغزشذن, عسث فاث سعزفهفمثس شري فاث سذقخمم زشق فخ رشدهلشفث. ذمهذنهرل فاث سعزفهفمثس هس ش بشسف صشغ فخ سنهح بخقصشقيس شري زشذنصشقيس زغ سوشمم شوخعرفس.Đnɹᴉnƃ ʌᴉdǝø dlɐʎbɐɔʞ, nsǝ ʇɥǝ snbʇᴉʇlǝs ɐnd ʇɥǝ sɔɹøll bɐɹ ʇø nɐʌᴉƃɐʇǝ. Ȼlᴉɔʞᴉnƃ ʇɥǝ snbʇᴉʇlǝs ᴉs ɐ ɟɐsʇ ʍɐʎ ʇø sʞᴉd ɟøɹʍɐɹds ɐnd bɐɔʞʍɐɹds bʎ sɯɐll ɐɯønnʇs.

source: If you are on a low-resolution display, the left navigation bar can be hidden by clicking on the set of three left arrows next to it.
rtl: هب غخع شقث خر ش مخص-قثسخمعفهخر يهسحمشغ, فاث مثبف رشدهلشفهخر زشق ذشر زث اهييثر زغ ذمهذنهرل خر فاث سثف خب فاقثث مثبف شققخصس رثطف فخ هف.Ɨɟ ʎøn ɐɹǝ øn ɐ løʍ-ɹǝsølnʇᴉøn dᴉsdlɐʎ, ʇɥǝ lǝɟʇ nɐʌᴉƃɐʇᴉøn bɐɹ ɔɐn bǝ ɥᴉddǝn bʎ ɔlᴉɔʞᴉnƃ øn ʇɥǝ sǝʇ øɟ ʇɥɹǝǝ lǝɟʇ ɐɹɹøʍs nǝxʇ ʇø ᴉʇ.

source: If you need bigger or smaller fonts, use your browsers settings to scale them up or down. Under Google Chrome, this is done by pressing ctrl-plus, or ctrl-minus at the same time.
rtl: هب غخع رثثي زهللثق خق سوشممثق بخرفس, عسث غخعق زقخصسثقس سثففهرلس فخ سذشمث فاثو عح خق يخصر. عريثق لخخلمث ذاقخوث, فاهس هس يخرث زغ حقثسسهرل ذفقم-حمعس, خق ذفقم-وهرعس شف فاث سشوث فهوث.

source: {subsection_format} due {{date}}
rtl: {subsection_format} يعث {{date}}

source: Due {date}
rtl: يعث {date}

source: Past due
rtl: حشسف يعث

source: Loading video player
rtl: مخشيهرل دهيثخ حمشغثق

source: Play video
rtl: حمشغ دهيثخ

source: No playable video sources found.
rtl: رخ حمشغشزمث دهيثخ سخعقذثس بخعري.Ɨɟ ʎøn nǝǝd bᴉƃƃǝɹ øɹ sɯɐllǝɹ ɟønʇs, nsǝ ʎønɹ bɹøʍsǝɹs sǝʇʇᴉnƃs ʇø sɔɐlǝ ʇɥǝɯ nd øɹ døʍn. Ʉndǝɹ Ǥøøƃlǝ Ȼɥɹøɯǝ, ʇɥᴉs ᴉs dønǝ bʎ dɹǝssᴉnƃ ɔʇɹl-dlns, øɹ ɔʇɹl-ɯᴉnns ɐʇ ʇɥǝ sɐɯǝ ʇᴉɯǝ.

source: Your browser does not support this video format. Try using a different browser.
rtl: غخعق زقخصسثق يخثس رخف سعححخقف فاهس دهيثخ بخقوشف. فقغ عسهرل ش يهببثقثرف زقخصسثق.

source: Downloads and transcripts
rtl: يخصرمخشيس شري فقشرسذقهحفس

source: Download video file
rtl: يخصرمخشي دهيثخ بهمث

source: Transcripts
rtl: فقشرسذقهحفس

source: Download {file}
rtl: يخصرمخشي {file}

source: Download transcript
rtl: يخصرمخشي فقشرسذقهحف

source: Handouts
rtl: اشريخعفس

source: Download Handout
rtl: يخصرمخشي اشريخعف

source: {num} of {total}
rtl: {num} خب {total}

source: Your words were:
rtl: غخعق صخقيس صثقث:

source: API Access Request
rtl: شحه شذذثسس قثضعثسفɎønɹ bɹøʍsǝɹ døǝs nøʇ snddøɹʇ ʇɥᴉs ʌᴉdǝø ɟøɹɯɐʇ. Ŧɹʎ nsᴉnƃ ɐ dᴉɟɟǝɹǝnʇ bɹøʍsǝɹ.

source: {platform_name} API Access Request
rtl: {platform_name} شحه شذذثسس قثضعثسف

source: Request API Access
rtl: قثضعثسف شحه شذذثسس

source: API Access Request Status
rtl: شحه شذذثسس قثضعثسف سفشفعس

source: Your request to access the {platform_name} Course Catalog API is being processed. You will receive a message at the email address in your profile when processing is complete. You can also return to this page to see the status of your API access request.
rtl: غخعق قثضعثسف فخ شذذثسس فاث {platform_name} ذخعقسث ذشفشمخل شحه هس زثهرل حقخذثسسثي. غخع صهمم قثذثهدث ش وثسسشلث شف فاث ثوشهم شييقثسس هر غخعق حقخبهمث صاثر حقخذثسسهرل هس ذخوحمثفث. غخع ذشر شمسخ قثفعقر فخ فاهس حشلث فخ سثث فاث سفشفعس خب غخعق شحه شذذثسس قثضعثسف.Ɏønɹ ɹǝbnǝsʇ ʇø ɐɔɔǝss ʇɥǝ {platform_name} Ȼønɹsǝ Ȼɐʇɐløƃ ȺⱣƗ ᴉs bǝᴉnƃ dɹøɔǝssǝd. Ɏøn ʍᴉll ɹǝɔǝᴉʌǝ ɐ ɯǝssɐƃǝ ɐʇ ʇɥǝ ǝɯɐᴉl ɐddɹǝss ᴉn ʎønɹ dɹøɟᴉlǝ ʍɥǝn dɹøɔǝssᴉnƃ ᴉs ɔøɯdlǝʇǝ. Ɏøn ɔɐn ɐlsø ɹǝʇnɹn ʇø ʇɥᴉs dɐƃǝ ʇø sǝǝ ʇɥǝ sʇɐʇns øɟ ʎønɹ ȺⱣƗ ɐɔɔǝss ɹǝbnǝsʇ.

source: Your request to access the {platform_name} Course Catalog API has been denied. If you think this is an error, or for other questions about using this API, contact {api_support_email_link}.
rtl: غخعق قثضعثسف فخ شذذثسس فاث {platform_name} ذخعقسث ذشفشمخل شحه اشس زثثر يثرهثي. هب غخع فاهرن فاهس هس شر ثققخق, خق بخق خفاثق ضعثسفهخرس شزخعف عسهرل فاهس شحه, ذخرفشذف {api_support_email_link}.Ɏønɹ ɹǝbnǝsʇ ʇø ɐɔɔǝss ʇɥǝ {platform_name} Ȼønɹsǝ Ȼɐʇɐløƃ ȺⱣƗ ɥɐs bǝǝn dǝnᴉǝd. Ɨɟ ʎøn ʇɥᴉnʞ ʇɥᴉs ᴉs ɐn ǝɹɹøɹ, øɹ ɟøɹ øʇɥǝɹ bnǝsʇᴉøns ɐbønʇ nsᴉnƃ ʇɥᴉs ȺⱣƗ, ɔønʇɐɔʇ {api_support_email_link}.

source: Your request to access the {platform_name} Course Catalog API has been approved.
rtl: غخعق قثضعثسف فخ شذذثسس فاث {platform_name} ذخعقسث ذشفشمخل شحه اشس زثثر شححقخدثي.

source: Application Name
rtl: شححمهذشفهخر رشوث

source: API Client ID
rtl: شحه ذمهثرف هي

source: API Client Secret
rtl: شحه ذمهثرف سثذقثف

source: Redirect URLs
rtl: قثيهقثذف عقمسɎønɹ ɹǝbnǝsʇ ʇø ɐɔɔǝss ʇɥǝ {platform_name} Ȼønɹsǝ Ȼɐʇɐløƃ ȺⱣƗ ɥɐs bǝǝn ɐddɹøʌǝd.

source: If you would like to regenerate your API client information, please use the form below.
rtl: هب غخع صخعمي مهنث فخ قثلثرثقشفث غخعق شحه ذمهثرف هربخقوشفهخر, حمثشسث عسث فاث بخقو زثمخص.

source: Generate API client credentials
rtl: لثرثقشفث شحه ذمهثرف ذقثيثرفهشمسƗɟ ʎøn ʍønld lᴉʞǝ ʇø ɹǝƃǝnǝɹɐʇǝ ʎønɹ ȺⱣƗ ɔlᴉǝnʇ ᴉnɟøɹɯɐʇᴉøn, dlǝɐsǝ nsǝ ʇɥǝ ɟøɹɯ bǝløʍ.

source: To learn more about the {platform_name} Course Catalog API, visit {link_start}our API documentation page{link_end}. For questions about using this API, contact {api_support_email_link}.
rtl: فخ مثشقر وخقث شزخعف فاث {platform_name} ذخعقسث ذشفشمخل شحه, دهسهف {link_start}خعق شحه يخذعوثرفشفهخر حشلث{link_end}. بخق ضعثسفهخرس شزخعف عسهرل فاهس شحه, ذخرفشذف {api_support_email_link}.

source: API Terms of Service
rtl: شحه فثقوس خب سثقدهذث

source: Terms of Service for {platform_name} APIs
rtl: فثقوس خب سثقدهذث بخق {platform_name} شحهس

source: Effective Date: May 24th, 2018
rtl: ثببثذفهدث يشفث: وشغ 24فا, 2018Ŧø lǝɐɹn ɯøɹǝ ɐbønʇ ʇɥǝ {platform_name} Ȼønɹsǝ Ȼɐʇɐløƃ ȺⱣƗ, ʌᴉsᴉʇ {link_start}ønɹ ȺⱣƗ døɔnɯǝnʇɐʇᴉøn dɐƃǝ{link_end}. Føɹ bnǝsʇᴉøns ɐbønʇ nsᴉnƃ ʇɥᴉs ȺⱣƗ, ɔønʇɐɔʇ {api_support_email_link}.

source: Welcome to {platform_name}. Thank you for using {platform_name}'s Course Discovery API, Enterprise API and/or any additional APIs that we may offer from time to time (collectively, the "APIs"). Please read these Terms of Service prior to accessing or using the APIs. These Terms of Service, any additional terms within accompanying API documentation, and any applicable policies and guidelines that {platform_name} makes available and/or updates from time to time are agreements (collectively, the "Terms") between you and {platform_name}. These Terms are issued under the enterprise product agreement, member participation agreement, or other direct agreement governing the purchase of {platform_name} products, if any (the "Agreement"), executed by you or the party on whose behalf you are accessing or using the APIs and {platform_name}. In the event that you have such an Agreement that applies to your use of the APIs, the Agreement will control in the event of any conflict between it and these Terms. By accessing or using the APIs, you accept and agree to be legally bound by the Terms, whether or not you are a registered user. If you are accessing or using the APIs on behalf of a company, organization or other legal entity, you are agreeing to these Terms for that entity and representing and warranting to {platform_name} that you have full authority to accept and agree to these Terms for such entity, in which case the terms "you," "your" or related terms herein shall refer to such entity on whose behalf you are accessing or using the APIs. If you do not have such authority or if you do not understand or do not wish to be bound by the Terms, you should not use the APIs.
rtl: صثمذخوث فخ {platform_name}. فاشرن غخع بخق عسهرل {platform_name}'س ذخعقسث يهسذخدثقغ شحه, ثرفثقحقهسث شحه شري/خق شرغ شييهفهخرشم شحهس فاشف صث وشغ خببثق بقخو فهوث فخ فهوث (ذخممثذفهدثمغ, فاث "شحهس"). حمثشسث قثشي فاثسث فثقوس خب سثقدهذث حقهخق فخ شذذثسسهرل خق عسهرل فاث شحهس. فاثسث فثقوس خب سثقدهذث, شرغ شييهفهخرشم فثقوس صهفاهر شذذخوحشرغهرل شحه يخذعوثرفشفهخر, شري شرغ شححمهذشزمث حخمهذهثس شري لعهيثمهرثس فاشف {platform_name} وشنثس شدشهمشزمث شري/خق عحيشفثس بقخو فهوث فخ فهوث شقث شلقثثوثرفس (ذخممثذفهدثمغ, فاث "فثقوس") زثفصثثر غخع شري {platform_name}. فاثسث فثقوس شقث هسسعثي عريثق فاث ثرفثقحقهسث حقخيعذف شلقثثوثرف, وثوزثق حشقفهذهحشفهخر شلقثثوثرف, خق خفاثق يهقثذف شلقثثوثرف لخدثقرهرل فاث حعقذاشسث خب {platform_name} حقخيعذفس, هب شرغ (فاث "شلقثثوثرف"), ثطثذعفثي زغ غخع خق فاث حشقفغ خر صاخسث زثاشمب غخع شقث شذذثسسهرل خق عسهرل فاث شحهس شري {platform_name}. هر فاث ثدثرف فاشف غخع اشدث سعذا شر شلقثثوثرف فاشف شححمهثس فخ غخعق عسث خب فاث شحهس, فاث شلقثثوثرف صهمم ذخرفقخم هر فاث ثدثرف خب شرغ ذخربمهذف زثفصثثر هف شري فاثسث فثقوس. زغ شذذثسسهرل خق عسهرل فاث شحهس, غخع شذذثحف شري شلقثث فخ زث مثلشممغ زخعري زغ فاث فثقوس, صاثفاثق خق رخف غخع شقث ش قثلهسفثقثي عسثق. هب غخع شقث شذذثسسهرل خق عسهرل فاث شحهس خر زثاشمب خب ش ذخوحشرغ, خقلشرهظشفهخر خق خفاثق مثلشم ثرفهفغ, غخع شقث شلقثثهرل فخ فاثسث فثقوس بخق فاشف ثرفهفغ شري قثحقثسثرفهرل شري صشققشرفهرل فخ {platform_name} فاشف غخع اشدث بعمم شعفاخقهفغ فخ شذذثحف شري شلقثث فخ فاثسث فثقوس بخق سعذا ثرفهفغ, هر صاهذا ذشسث فاث فثقوس "غخع," "غخعق" خق قثمشفثي فثقوس اثقثهر ساشمم قثبثق فخ سعذا ثرفهفغ خر صاخسث زثاشمب غخع شقث شذذثسسهرل خق عسهرل فاث شحهس. هب غخع يخ رخف اشدث سعذا شعفاخقهفغ خق هب غخع يخ رخف عريثقسفشري خق يخ رخف صهسا فخ زث زخعري زغ فاث فثقوس, غخع ساخعمي رخف عسث فاث شحهس.

source: API Access
rtl: شحه شذذثسسWǝlɔøɯǝ ʇø {platform_name}. Ŧɥɐnʞ ʎøn ɟøɹ nsᴉnƃ {platform_name}'s Ȼønɹsǝ Đᴉsɔøʌǝɹʎ ȺⱣƗ, Ɇnʇǝɹdɹᴉsǝ ȺⱣƗ ɐnd/øɹ ɐnʎ ɐddᴉʇᴉønɐl ȺⱣƗs ʇɥɐʇ ʍǝ ɯɐʎ øɟɟǝɹ ɟɹøɯ ʇᴉɯǝ ʇø ʇᴉɯǝ (ɔøllǝɔʇᴉʌǝlʎ, ʇɥǝ "ȺⱣƗs"). Ᵽlǝɐsǝ ɹǝɐd ʇɥǝsǝ Ŧǝɹɯs øɟ Sǝɹʌᴉɔǝ dɹᴉøɹ ʇø ɐɔɔǝssᴉnƃ øɹ nsᴉnƃ ʇɥǝ ȺⱣƗs. Ŧɥǝsǝ Ŧǝɹɯs øɟ Sǝɹʌᴉɔǝ, ɐnʎ ɐddᴉʇᴉønɐl ʇǝɹɯs ʍᴉʇɥᴉn ɐɔɔøɯdɐnʎᴉnƃ ȺⱣƗ døɔnɯǝnʇɐʇᴉøn, ɐnd ɐnʎ ɐddlᴉɔɐblǝ dølᴉɔᴉǝs ɐnd ƃnᴉdǝlᴉnǝs ʇɥɐʇ {platform_name} ɯɐʞǝs ɐʌɐᴉlɐblǝ ɐnd/øɹ nddɐʇǝs ɟɹøɯ ʇᴉɯǝ ʇø ʇᴉɯǝ ɐɹǝ ɐƃɹǝǝɯǝnʇs (ɔøllǝɔʇᴉʌǝlʎ, ʇɥǝ "Ŧǝɹɯs") bǝʇʍǝǝn ʎøn ɐnd {platform_name}. Ŧɥǝsǝ Ŧǝɹɯs ɐɹǝ ᴉssnǝd nndǝɹ ʇɥǝ ǝnʇǝɹdɹᴉsǝ dɹødnɔʇ ɐƃɹǝǝɯǝnʇ, ɯǝɯbǝɹ dɐɹʇᴉɔᴉdɐʇᴉøn ɐƃɹǝǝɯǝnʇ, øɹ øʇɥǝɹ dᴉɹǝɔʇ ɐƃɹǝǝɯǝnʇ ƃøʌǝɹnᴉnƃ ʇɥǝ dnɹɔɥɐsǝ øɟ {platform_name} dɹødnɔʇs, ᴉɟ ɐnʎ (ʇɥǝ "Ⱥƃɹǝǝɯǝnʇ"), ǝxǝɔnʇǝd bʎ ʎøn øɹ ʇɥǝ dɐɹʇʎ øn ʍɥøsǝ bǝɥɐlɟ ʎøn ɐɹǝ ɐɔɔǝssᴉnƃ øɹ nsᴉnƃ ʇɥǝ ȺⱣƗs ɐnd {platform_name}. Ɨn ʇɥǝ ǝʌǝnʇ ʇɥɐʇ ʎøn ɥɐʌǝ snɔɥ ɐn Ⱥƃɹǝǝɯǝnʇ ʇɥɐʇ ɐddlᴉǝs ʇø ʎønɹ nsǝ øɟ ʇɥǝ ȺⱣƗs, ʇɥǝ Ⱥƃɹǝǝɯǝnʇ ʍᴉll ɔønʇɹøl ᴉn ʇɥǝ ǝʌǝnʇ øɟ ɐnʎ ɔønɟlᴉɔʇ bǝʇʍǝǝn ᴉʇ ɐnd ʇɥǝsǝ Ŧǝɹɯs. Ƀʎ ɐɔɔǝssᴉnƃ øɹ nsᴉnƃ ʇɥǝ ȺⱣƗs, ʎøn ɐɔɔǝdʇ ɐnd ɐƃɹǝǝ ʇø bǝ lǝƃɐllʎ bønnd bʎ ʇɥǝ Ŧǝɹɯs, ʍɥǝʇɥǝɹ øɹ nøʇ ʎøn ɐɹǝ ɐ ɹǝƃᴉsʇǝɹǝd nsǝɹ. Ɨɟ ʎøn ɐɹǝ ɐɔɔǝssᴉnƃ øɹ nsᴉnƃ ʇɥǝ ȺⱣƗs øn bǝɥɐlɟ øɟ ɐ ɔøɯdɐnʎ, øɹƃɐnᴉzɐʇᴉøn øɹ øʇɥǝɹ lǝƃɐl ǝnʇᴉʇʎ, ʎøn ɐɹǝ ɐƃɹǝǝᴉnƃ ʇø ʇɥǝsǝ Ŧǝɹɯs ɟøɹ ʇɥɐʇ ǝnʇᴉʇʎ ɐnd ɹǝdɹǝsǝnʇᴉnƃ ɐnd ʍɐɹɹɐnʇᴉnƃ ʇø {platform_name} ʇɥɐʇ ʎøn ɥɐʌǝ ɟnll ɐnʇɥøɹᴉʇʎ ʇø ɐɔɔǝdʇ ɐnd ɐƃɹǝǝ ʇø ʇɥǝsǝ Ŧǝɹɯs ɟøɹ snɔɥ ǝnʇᴉʇʎ, ᴉn ʍɥᴉɔɥ ɔɐsǝ ʇɥǝ ʇǝɹɯs "ʎøn," "ʎønɹ" øɹ ɹǝlɐʇǝd ʇǝɹɯs ɥǝɹǝᴉn sɥɐll ɹǝɟǝɹ ʇø snɔɥ ǝnʇᴉʇʎ øn ʍɥøsǝ bǝɥɐlɟ ʎøn ɐɹǝ ɐɔɔǝssᴉnƃ øɹ nsᴉnƃ ʇɥǝ ȺⱣƗs. Ɨɟ ʎøn dø nøʇ ɥɐʌǝ snɔɥ ɐnʇɥøɹᴉʇʎ øɹ ᴉɟ ʎøn dø nøʇ nndǝɹsʇɐnd øɹ dø nøʇ ʍᴉsɥ ʇø bǝ bønnd bʎ ʇɥǝ Ŧǝɹɯs, ʎøn sɥønld nøʇ nsǝ ʇɥǝ ȺⱣƗs.

source: To access the APIs, you will need to create an {platform_name} user account for your application (not for personal use). This account will provide you with access to our API request page at {request_url}. On that page, you must complete the API request form including a description of your proposed uses for the APIs. Any account and registration information that you provide to {platform_name} must be accurate and up to date, and you agree to inform us promptly of any changes. {platform_name_capitalized} will review your API request form and, upon approval in {platform_name}'s sole discretion, will provide you with instructions for obtaining your API shared secret and client ID.
rtl: فخ شذذثسس فاث شحهس, غخع صهمم رثثي فخ ذقثشفث شر {platform_name} عسثق شذذخعرف بخق غخعق شححمهذشفهخر (رخف بخق حثقسخرشم عسث). فاهس شذذخعرف صهمم حقخدهيث غخع صهفا شذذثسس فخ خعق شحه قثضعثسف حشلث شف {request_url}. خر فاشف حشلث, غخع وعسف ذخوحمثفث فاث شحه قثضعثسف بخقو هرذمعيهرل ش يثسذقهحفهخر خب غخعق حقخحخسثي عسثس بخق فاث شحهس. شرغ شذذخعرف شري قثلهسفقشفهخر هربخقوشفهخر فاشف غخع حقخدهيث فخ {platform_name} وعسف زث شذذعقشفث شري عح فخ يشفث, شري غخع شلقثث فخ هربخقو عس حقخوحفمغ خب شرغ ذاشرلثس. {platform_name_capitalized} صهمم قثدهثص غخعق شحه قثضعثسف بخقو شري, عحخر شححقخدشم هر {platform_name}'س سخمث يهسذقثفهخر, صهمم حقخدهيث غخع صهفا هرسفقعذفهخرس بخق خزفشهرهرل غخعق شحه ساشقثي سثذقثف شري ذمهثرف هي.

source: Permissible Use
rtl: حثقوهسسهزمث عسثŦø ɐɔɔǝss ʇɥǝ ȺⱣƗs, ʎøn ʍᴉll nǝǝd ʇø ɔɹǝɐʇǝ ɐn {platform_name} nsǝɹ ɐɔɔønnʇ ɟøɹ ʎønɹ ɐddlᴉɔɐʇᴉøn (nøʇ ɟøɹ dǝɹsønɐl nsǝ). Ŧɥᴉs ɐɔɔønnʇ ʍᴉll dɹøʌᴉdǝ ʎøn ʍᴉʇɥ ɐɔɔǝss ʇø ønɹ ȺⱣƗ ɹǝbnǝsʇ dɐƃǝ ɐʇ {request_url}. Øn ʇɥɐʇ dɐƃǝ, ʎøn ɯnsʇ ɔøɯdlǝʇǝ ʇɥǝ ȺⱣƗ ɹǝbnǝsʇ ɟøɹɯ ᴉnɔlndᴉnƃ ɐ dǝsɔɹᴉdʇᴉøn øɟ ʎønɹ dɹødøsǝd nsǝs ɟøɹ ʇɥǝ ȺⱣƗs. Ⱥnʎ ɐɔɔønnʇ ɐnd ɹǝƃᴉsʇɹɐʇᴉøn ᴉnɟøɹɯɐʇᴉøn ʇɥɐʇ ʎøn dɹøʌᴉdǝ ʇø {platform_name} ɯnsʇ bǝ ɐɔɔnɹɐʇǝ ɐnd nd ʇø dɐʇǝ, ɐnd ʎøn ɐƃɹǝǝ ʇø ᴉnɟøɹɯ ns dɹøɯdʇlʎ øɟ ɐnʎ ɔɥɐnƃǝs. {platform_name_capitalized} ʍᴉll ɹǝʌᴉǝʍ ʎønɹ ȺⱣƗ ɹǝbnǝsʇ ɟøɹɯ ɐnd, ndøn ɐddɹøʌɐl ᴉn {platform_name}'s sølǝ dᴉsɔɹǝʇᴉøn, ʍᴉll dɹøʌᴉdǝ ʎøn ʍᴉʇɥ ᴉnsʇɹnɔʇᴉøns ɟøɹ øbʇɐᴉnᴉnƃ ʎønɹ ȺⱣƗ sɥɐɹǝd sǝɔɹǝʇ ɐnd ɔlᴉǝnʇ ƗĐ.

source: You agree to use the APIs solely for the purpose of delivering content that is accessed through the APIs (the "API Content") to your own website, mobile site, app, blog, email distribution list, or social media property ("Your Application") or for another commercial use that you described in your request for access and that {platform_name} has approved on a case-by-case basis. {platform_name_capitalized} may monitor your use of the APIs for compliance with the Terms and may deny your access or shut down your integration if you attempt to go around or exceed the requirements and limitations set by {platform_name}. Your Application or other approved use of the API or the API Content must not prompt your end users to provide their {platform_name} username, password or other {platform_name} user credentials anywhere other than on the {platform_name} website at {platform_url}.
rtl: غخع شلقثث فخ عسث فاث شحهس سخمثمغ بخق فاث حعقحخسث خب يثمهدثقهرل ذخرفثرف فاشف هس شذذثسسثي فاقخعلا فاث شحهس (فاث "شحه ذخرفثرف") فخ غخعق خصر صثزسهفث, وخزهمث سهفث, شحح, زمخل, ثوشهم يهسفقهزعفهخر مهسف, خق سخذهشم وثيهش حقخحثقفغ ("غخعق شححمهذشفهخر") خق بخق شرخفاثق ذخووثقذهشم عسث فاشف غخع يثسذقهزثي هر غخعق قثضعثسف بخق شذذثسس شري فاشف {platform_name} اشس شححقخدثي خر ش ذشسث-زغ-ذشسث زشسهس. {platform_name_capitalized} وشغ وخرهفخق غخعق عسث خب فاث شحهس بخق ذخوحمهشرذث صهفا فاث فثقوس شري وشغ يثرغ غخعق شذذثسس خق ساعف يخصر غخعق هرفثلقشفهخر هب غخع شففثوحف فخ لخ شقخعري خق ثطذثثي فاث قثضعهقثوثرفس شري مهوهفشفهخرس سثف زغ {platform_name}. غخعق شححمهذشفهخر خق خفاثق شححقخدثي عسث خب فاث شحه خق فاث شحه ذخرفثرف وعسف رخف حقخوحف غخعق ثري عسثقس فخ حقخدهيث فاثهق {platform_name} عسثقرشوث, حشسسصخقي خق خفاثق {platform_name} عسثق ذقثيثرفهشمس شرغصاثقث خفاثق فاشر خر فاث {platform_name} صثزسهفث شف Ɏøn ɐƃɹǝǝ ʇø nsǝ ʇɥǝ ȺⱣƗs sølǝlʎ ɟøɹ ʇɥǝ dnɹdøsǝ øɟ dǝlᴉʌǝɹᴉnƃ ɔønʇǝnʇ ʇɥɐʇ ᴉs ɐɔɔǝssǝd ʇɥɹønƃɥ ʇɥǝ ȺⱣƗs (ʇɥǝ "ȺⱣƗ Ȼønʇǝnʇ") ʇø ʎønɹ øʍn ʍǝbsᴉʇǝ, ɯøbᴉlǝ sᴉʇǝ, ɐdd, bløƃ, ǝɯɐᴉl dᴉsʇɹᴉbnʇᴉøn lᴉsʇ, øɹ søɔᴉɐl ɯǝdᴉɐ dɹødǝɹʇʎ ("Ɏønɹ Ⱥddlᴉɔɐʇᴉøn") øɹ ɟøɹ ɐnøʇɥǝɹ ɔøɯɯǝɹɔᴉɐl nsǝ ʇɥɐʇ ʎøn dǝsɔɹᴉbǝd ᴉn ʎønɹ ɹǝbnǝsʇ ɟøɹ ɐɔɔǝss ɐnd ʇɥɐʇ {platform_name} ɥɐs ɐddɹøʌǝd øn ɐ ɔɐsǝ-bʎ-ɔɐsǝ bɐsᴉs. {platform_name_capitalized} ɯɐʎ ɯønᴉʇøɹ ʎønɹ nsǝ øɟ ʇɥǝ ȺⱣƗs ɟøɹ ɔøɯdlᴉɐnɔǝ ʍᴉʇɥ ʇɥǝ Ŧǝɹɯs ɐnd ɯɐʎ dǝnʎ ʎønɹ ɐɔɔǝss øɹ sɥnʇ døʍn ʎønɹ ᴉnʇǝƃɹɐʇᴉøn ᴉɟ ʎøn ɐʇʇǝɯdʇ ʇø ƃø ɐɹønnd øɹ ǝxɔǝǝd ʇɥǝ ɹǝbnᴉɹǝɯǝnʇs ɐnd lᴉɯᴉʇɐʇᴉøns sǝʇ bʎ {platform_name}. Ɏønɹ Ⱥddlᴉɔɐʇᴉøn øɹ øʇɥǝɹ ɐddɹøʌǝd nsǝ øɟ ʇɥǝ ȺⱣƗ øɹ ʇɥǝ ȺⱣƗ Ȼønʇǝnʇ ɯnsʇ nøʇ dɹøɯdʇ ʎønɹ ǝnd nsǝɹs ʇø dɹøʌᴉdǝ ʇɥǝᴉɹ {platform_name} nsǝɹnɐɯǝ, dɐssʍøɹd øɹ øʇɥǝɹ {platform_name} nsǝɹ ɔɹǝdǝnʇᴉɐls ɐnʎʍɥǝɹǝ øʇɥǝɹ ʇɥɐn øn ʇɥǝ {platform_name} ʍǝbsᴉʇǝ ɐʇ {platform_url}.

source: Prohibited Uses and Activities
rtl: حقخاهزهفثي عسثس شري شذفهدهفهثس
