Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: {platform_name_capitalized} shall have the sole right to determine whether or not any given use of the APIs is acceptable, and {platform_name} reserves the right to revoke API access for any use that {platform_name} determines at any time, in its sole discretion, does not benefit or serve the best interests of {platform_name}, its users and its partners.
rtl: {platform_name_capitalized} ساشمم اشدث فاث سخمث قهلاف فخ يثفثقوهرث صاثفاثق خق رخف شرغ لهدثر عسث خب فاث شحهس هس شذذثحفشزمث, شري {platform_name} قثسثقدثس فاث قهلاف فخ قثدخنث شحه شذذثسس بخق شرغ عسث فاشف {platform_name} يثفثقوهرثس شف شرغ فهوث, هر هفس سخمث يهسذقثفهخر, يخثس رخف زثرثبهف خق سثقدث فاث زثسف هرفثقثسفس خب {platform_name}, هفس عسثقس شري هفس حشقفرثقس.{platform_name_capitalized} sɥɐll ɥɐʌǝ ʇɥǝ sølǝ ɹᴉƃɥʇ ʇø dǝʇǝɹɯᴉnǝ ʍɥǝʇɥǝɹ øɹ nøʇ ɐnʎ ƃᴉʌǝn nsǝ øɟ ʇɥǝ ȺⱣƗs ᴉs ɐɔɔǝdʇɐblǝ, ɐnd {platform_name} ɹǝsǝɹʌǝs ʇɥǝ ɹᴉƃɥʇ ʇø ɹǝʌøʞǝ ȺⱣƗ ɐɔɔǝss ɟøɹ ɐnʎ nsǝ ʇɥɐʇ {platform_name} dǝʇǝɹɯᴉnǝs ɐʇ ɐnʎ ʇᴉɯǝ, ᴉn ᴉʇs sølǝ dᴉsɔɹǝʇᴉøn, døǝs nøʇ bǝnǝɟᴉʇ øɹ sǝɹʌǝ ʇɥǝ bǝsʇ ᴉnʇǝɹǝsʇs øɟ {platform_name}, ᴉʇs nsǝɹs ɐnd ᴉʇs dɐɹʇnǝɹs.

source: The following activities are not acceptable when using the APIs (this is not an exhaustive list):
rtl: فاث بخممخصهرل شذفهدهفهثس شقث رخف شذذثحفشزمث صاثر عسهرل فاث شحهس (فاهس هس رخف شر ثطاشعسفهدث مهسف):Ŧɥǝ ɟølløʍᴉnƃ ɐɔʇᴉʌᴉʇᴉǝs ɐɹǝ nøʇ ɐɔɔǝdʇɐblǝ ʍɥǝn nsᴉnƃ ʇɥǝ ȺⱣƗs (ʇɥᴉs ᴉs nøʇ ɐn ǝxɥɐnsʇᴉʌǝ lᴉsʇ):

source: collecting or storing the names, passwords, or other credentials of {platform_name} users;
rtl: ذخممثذفهرل خق سفخقهرل فاث رشوثس, حشسسصخقيس, خق خفاثق ذقثيثرفهشمس خب {platform_name} عسثقس;ɔøllǝɔʇᴉnƃ øɹ sʇøɹᴉnƃ ʇɥǝ nɐɯǝs, dɐssʍøɹds, øɹ øʇɥǝɹ ɔɹǝdǝnʇᴉɐls øɟ {platform_name} nsǝɹs;

source: scraping or similar techniques to aggregate or otherwise create permanent copies of API Content;
rtl: سذقشحهرل خق سهوهمشق فثذارهضعثس فخ شللقثلشفث خق خفاثقصهسث ذقثشفث حثقوشرثرف ذخحهثس خب شحه ذخرفثرف;sɔɹɐdᴉnƃ øɹ sᴉɯᴉlɐɹ ʇǝɔɥnᴉbnǝs ʇø ɐƃƃɹǝƃɐʇǝ øɹ øʇɥǝɹʍᴉsǝ ɔɹǝɐʇǝ dǝɹɯɐnǝnʇ ɔødᴉǝs øɟ ȺⱣƗ Ȼønʇǝnʇ;

source: violating, misappropriating or infringing any copyright, trademark rights, rights of privacy or publicity, confidential information or any other right of any third party;
rtl: دهخمشفهرل, وهسشححقخحقهشفهرل خق هربقهرلهرل شرغ ذخحغقهلاف, فقشيثوشقن قهلافس, قهلافس خب حقهدشذغ خق حعزمهذهفغ, ذخربهيثرفهشم هربخقوشفهخر خق شرغ خفاثق قهلاف خب شرغ فاهقي حشقفغ;

source: altering or editing any content or graphics in the API Content;
rtl: شمفثقهرل خق ثيهفهرل شرغ ذخرفثرف خق لقشحاهذس هر فاث شحه ذخرفثرف;ʌᴉølɐʇᴉnƃ, ɯᴉsɐddɹødɹᴉɐʇᴉnƃ øɹ ᴉnɟɹᴉnƃᴉnƃ ɐnʎ ɔødʎɹᴉƃɥʇ, ʇɹɐdǝɯɐɹʞ ɹᴉƃɥʇs, ɹᴉƃɥʇs øɟ dɹᴉʌɐɔʎ øɹ dnblᴉɔᴉʇʎ, ɔønɟᴉdǝnʇᴉɐl ᴉnɟøɹɯɐʇᴉøn øɹ ɐnʎ øʇɥǝɹ ɹᴉƃɥʇ øɟ ɐnʎ ʇɥᴉɹd dɐɹʇʎ;

source: altering or removing any trademark, copyright or other proprietary or legal notices contained in, or appearing on, the APIs or any API Content;
rtl: شمفثقهرل خق قثوخدهرل شرغ فقشيثوشقن, ذخحغقهلاف خق خفاثق حقخحقهثفشقغ خق مثلشم رخفهذثس ذخرفشهرثي هر, خق شححثشقهرل خر, فاث شحهس خق شرغ شحه ذخرفثرف;ɐlʇǝɹᴉnƃ øɹ ɹǝɯøʌᴉnƃ ɐnʎ ʇɹɐdǝɯɐɹʞ, ɔødʎɹᴉƃɥʇ øɹ øʇɥǝɹ dɹødɹᴉǝʇɐɹʎ øɹ lǝƃɐl nøʇᴉɔǝs ɔønʇɐᴉnǝd ᴉn, øɹ ɐddǝɐɹᴉnƃ øn, ʇɥǝ ȺⱣƗs øɹ ɐnʎ ȺⱣƗ Ȼønʇǝnʇ;

source: sublicensing, re-distributing, renting, selling or leasing access to the APIs or your client secret to any third party;
rtl: سعزمهذثرسهرل, قث-يهسفقهزعفهرل, قثرفهرل, سثممهرل خق مثشسهرل شذذثسس فخ فاث شحهس خق غخعق ذمهثرف سثذقثف فخ شرغ فاهقي حشقفغ;snblᴉɔǝnsᴉnƃ, ɹǝ-dᴉsʇɹᴉbnʇᴉnƃ, ɹǝnʇᴉnƃ, sǝllᴉnƃ øɹ lǝɐsᴉnƃ ɐɔɔǝss ʇø ʇɥǝ ȺⱣƗs øɹ ʎønɹ ɔlᴉǝnʇ sǝɔɹǝʇ ʇø ɐnʎ ʇɥᴉɹd dɐɹʇʎ;

source: distributing any virus, Trojan horse, spyware, adware, malware, bot, time bomb, worm, or other harmful or malicious component; or
rtl: يهسفقهزعفهرل شرغ دهقعس, فقختشر اخقسث, سحغصشقث, شيصشقث, وشمصشقث, زخف, فهوث زخوز, صخقو, خق خفاثق اشقوبعم خق وشمهذهخعس ذخوحخرثرف; خقdᴉsʇɹᴉbnʇᴉnƃ ɐnʎ ʌᴉɹns, Ŧɹøɾɐn ɥøɹsǝ, sdʎʍɐɹǝ, ɐdʍɐɹǝ, ɯɐlʍɐɹǝ, bøʇ, ʇᴉɯǝ bøɯb, ʍøɹɯ, øɹ øʇɥǝɹ ɥɐɹɯɟnl øɹ ɯɐlᴉɔᴉøns ɔøɯdønǝnʇ; øɹ

source: using the APIs for any purpose which or might overburden, impair or disrupt the {platform_name} platform, servers or networks.
rtl: عسهرل فاث شحهس بخق شرغ حعقحخسث صاهذا خق وهلاف خدثقزعقيثر, هوحشهق خق يهسقعحف فاث {platform_name} حمشفبخقو, سثقدثقس خق رثفصخقنس.

source: Usage and Quotas
rtl: عسشلث شري ضعخفشسnsᴉnƃ ʇɥǝ ȺⱣƗs ɟøɹ ɐnʎ dnɹdøsǝ ʍɥᴉɔɥ øɹ ɯᴉƃɥʇ øʌǝɹbnɹdǝn, ᴉɯdɐᴉɹ øɹ dᴉsɹndʇ ʇɥǝ {platform_name} dlɐʇɟøɹɯ, sǝɹʌǝɹs øɹ nǝʇʍøɹʞs.

source: {platform_name_capitalized} reserves the right, in its discretion, to impose reasonable restrictions and limitations on the number and frequency of calls made by you or Your Application to the APIs. You must not attempt to circumvent any restrictions or limitations imposed by {platform_name}.
rtl: {platform_name_capitalized} قثسثقدثس فاث قهلاف, هر هفس يهسذقثفهخر, فخ هوحخسث قثشسخرشزمث قثسفقهذفهخرس شري مهوهفشفهخرس خر فاث رعوزثق شري بقثضعثرذغ خب ذشممس وشيث زغ غخع خق غخعق شححمهذشفهخر فخ فاث شحهس. غخع وعسف رخف شففثوحف فخ ذهقذعودثرف شرغ قثسفقهذفهخرس خق مهوهفشفهخرس هوحخسثي زغ {platform_name}.

source: Compliance
rtl: ذخوحمهشرذث{platform_name_capitalized} ɹǝsǝɹʌǝs ʇɥǝ ɹᴉƃɥʇ, ᴉn ᴉʇs dᴉsɔɹǝʇᴉøn, ʇø ᴉɯdøsǝ ɹǝɐsønɐblǝ ɹǝsʇɹᴉɔʇᴉøns ɐnd lᴉɯᴉʇɐʇᴉøns øn ʇɥǝ nnɯbǝɹ ɐnd ɟɹǝbnǝnɔʎ øɟ ɔɐlls ɯɐdǝ bʎ ʎøn øɹ Ɏønɹ Ⱥddlᴉɔɐʇᴉøn ʇø ʇɥǝ ȺⱣƗs. Ɏøn ɯnsʇ nøʇ ɐʇʇǝɯdʇ ʇø ɔᴉɹɔnɯʌǝnʇ ɐnʎ ɹǝsʇɹᴉɔʇᴉøns øɹ lᴉɯᴉʇɐʇᴉøns ᴉɯdøsǝd bʎ {platform_name}.

source: You agree to comply with all applicable laws, regulations, and third party rights (including without limitation laws regarding the import or export of data or software, privacy, copyright, and local laws). You will not use the APIs to encourage or promote illegal activity or violation of third party rights. You will not violate any other terms of service with {platform_name}. You will only access (or attempt to access) an API by the means described in the documentation of that API. You will not misrepresent or mask either your identity or Your Application's identity when using the APIs.
rtl: غخع شلقثث فخ ذخوحمغ صهفا شمم شححمهذشزمث مشصس, قثلعمشفهخرس, شري فاهقي حشقفغ قهلافس (هرذمعيهرل صهفاخعف مهوهفشفهخر مشصس قثلشقيهرل فاث هوحخقف خق ثطحخقف خب يشفش خق سخبفصشقث, حقهدشذغ, ذخحغقهلاف, شري مخذشم مشصس). غخع صهمم رخف عسث فاث شحهس فخ ثرذخعقشلث خق حقخوخفث هممثلشم شذفهدهفغ خق دهخمشفهخر خب فاهقي حشقفغ قهلافس. غخع صهمم رخف دهخمشفث شرغ خفاثق فثقوس خب سثقدهذث صهفا {platform_name}. غخع صهمم خرمغ شذذثسس (خق شففثوحف فخ شذذثسس) شر شحه زغ فاث وثشرس يثسذقهزثي هر فاث يخذعوثرفشفهخر خب فاشف شحه. غخع صهمم رخف وهسقثحقثسثرف خق وشسن ثهفاثق غخعق هيثرفهفغ خق غخعق شححمهذشفهخر'س هيثرفهفغ صاثر عسهرل فاث شحهس.

source: Ownership
rtl: خصرثقساهحɎøn ɐƃɹǝǝ ʇø ɔøɯdlʎ ʍᴉʇɥ ɐll ɐddlᴉɔɐblǝ lɐʍs, ɹǝƃnlɐʇᴉøns, ɐnd ʇɥᴉɹd dɐɹʇʎ ɹᴉƃɥʇs (ᴉnɔlndᴉnƃ ʍᴉʇɥønʇ lᴉɯᴉʇɐʇᴉøn lɐʍs ɹǝƃɐɹdᴉnƃ ʇɥǝ ᴉɯdøɹʇ øɹ ǝxdøɹʇ øɟ dɐʇɐ øɹ søɟʇʍɐɹǝ, dɹᴉʌɐɔʎ, ɔødʎɹᴉƃɥʇ, ɐnd løɔɐl lɐʍs). Ɏøn ʍᴉll nøʇ nsǝ ʇɥǝ ȺⱣƗs ʇø ǝnɔønɹɐƃǝ øɹ dɹøɯøʇǝ ᴉllǝƃɐl ɐɔʇᴉʌᴉʇʎ øɹ ʌᴉølɐʇᴉøn øɟ ʇɥᴉɹd dɐɹʇʎ ɹᴉƃɥʇs. Ɏøn ʍᴉll nøʇ ʌᴉølɐʇǝ ɐnʎ øʇɥǝɹ ʇǝɹɯs øɟ sǝɹʌᴉɔǝ ʍᴉʇɥ {platform_name}. Ɏøn ʍᴉll ønlʎ ɐɔɔǝss (øɹ ɐʇʇǝɯdʇ ʇø ɐɔɔǝss) ɐn ȺⱣƗ bʎ ʇɥǝ ɯǝɐns dǝsɔɹᴉbǝd ᴉn ʇɥǝ døɔnɯǝnʇɐʇᴉøn øɟ ʇɥɐʇ ȺⱣƗ. Ɏøn ʍᴉll nøʇ ɯᴉsɹǝdɹǝsǝnʇ øɹ ɯɐsʞ ǝᴉʇɥǝɹ ʎønɹ ᴉdǝnʇᴉʇʎ øɹ Ɏønɹ Ⱥddlᴉɔɐʇᴉøn's ᴉdǝnʇᴉʇʎ ʍɥǝn nsᴉnƃ ʇɥǝ ȺⱣƗs.

source: You acknowledge and agree that the APIs and all API Content contain valuable intellectual property of {platform_name} and its partners. The APIs and all API Content are protected by United States and foreign copyright, trademark, and other laws. All rights in the APIs and the API Content, if not expressly granted, are reserved. By using the APIs or any API Content, you do not acquire ownership of any rights in the APIs or API Content. You must not claim or attempt to claim ownership in the APIs or any API Content or misrepresent yourself or your company or your Application as being the source of any API Content. You may not modify, create derivative works of, or attempt to use, license, or in any way exploit any API Content in whole or in part on your own behalf or on behalf of any third party. You may not distribute or modify the APIs or any API Content (including adaptation, editing, excerpting, or creating derivative works).
rtl: غخع شذنرخصمثيلث شري شلقثث فاشف فاث شحهس شري شمم شحه ذخرفثرف ذخرفشهر دشمعشزمث هرفثممثذفعشم حقخحثقفغ خب {platform_name} شري هفس حشقفرثقس. فاث شحهس شري شمم شحه ذخرفثرف شقث حقخفثذفثي زغ عرهفثي سفشفثس شري بخقثهلر ذخحغقهلاف, فقشيثوشقن, شري خفاثق مشصس. شمم قهلافس هر فاث شحهس شري فاث شحه ذخرفثرف, هب رخف ثطحقثسسمغ لقشرفثي, شقث قثسثقدثي. زغ عسهرل فاث شحهس خق شرغ شحه ذخرفثرف, غخع يخ رخف شذضعهقث خصرثقساهح خب شرغ قهلافس هر فاث شحهس خق شحه ذخرفثرف. غخع وعسف رخف ذمشهو خق شففثوحف فخ ذمشهو خصرثقساهح هر فاث شحهس خق شرغ شحه ذخرفثرف خق وهسقثحقثسثرف غخعقسثمب خق غخعق ذخوحشرغ خق غخعق شححمهذشفهخر شس زثهرل فاث سخعقذث خب شرغ شحه ذخرفثرف. غخع وشغ رخف وخيهبغ, ذقثشفث يثقهدشفهدث صخقنس خب, خق شففثوحف فخ عسث, مهذثرسث, خق هر شرغ صشغ ثطحمخهف شرغ شحه ذخرفثرف هر صاخمث خق هر حشقف خر غخعق خصر زثاشمب خق خر زثاشمب خب شرغ فاهقي حشقفغ. غخع وشغ رخف يهسفقهزعفث خق وخيهبغ فاث شحهس خق شرغ شحه ذخرفثرف (هرذمعيهرل شيشحفشفهخر, ثيهفهرل, ثطذثقحفهرل, خق ذقثشفهرل يثقهدشفهدث صخقنس).Ɏøn ɐɔʞnøʍlǝdƃǝ ɐnd ɐƃɹǝǝ ʇɥɐʇ ʇɥǝ ȺⱣƗs ɐnd ɐll ȺⱣƗ Ȼønʇǝnʇ ɔønʇɐᴉn ʌɐlnɐblǝ ᴉnʇǝllǝɔʇnɐl dɹødǝɹʇʎ øɟ {platform_name} ɐnd ᴉʇs dɐɹʇnǝɹs. Ŧɥǝ ȺⱣƗs ɐnd ɐll ȺⱣƗ Ȼønʇǝnʇ ɐɹǝ dɹøʇǝɔʇǝd bʎ Ʉnᴉʇǝd Sʇɐʇǝs ɐnd ɟøɹǝᴉƃn ɔødʎɹᴉƃɥʇ, ʇɹɐdǝɯɐɹʞ, ɐnd øʇɥǝɹ lɐʍs. Ⱥll ɹᴉƃɥʇs ᴉn ʇɥǝ ȺⱣƗs ɐnd ʇɥǝ ȺⱣƗ Ȼønʇǝnʇ, ᴉɟ nøʇ ǝxdɹǝsslʎ ƃɹɐnʇǝd, ɐɹǝ ɹǝsǝɹʌǝd. Ƀʎ nsᴉnƃ ʇɥǝ ȺⱣƗs øɹ ɐnʎ ȺⱣƗ Ȼønʇǝnʇ, ʎøn dø nøʇ ɐɔbnᴉɹǝ øʍnǝɹsɥᴉd øɟ ɐnʎ ɹᴉƃɥʇs ᴉn ʇɥǝ ȺⱣƗs øɹ ȺⱣƗ Ȼønʇǝnʇ. Ɏøn ɯnsʇ nøʇ ɔlɐᴉɯ øɹ ɐʇʇǝɯdʇ ʇø ɔlɐᴉɯ øʍnǝɹsɥᴉd ᴉn ʇɥǝ ȺⱣƗs øɹ ɐnʎ ȺⱣƗ Ȼønʇǝnʇ øɹ ɯᴉsɹǝdɹǝsǝnʇ ʎønɹsǝlɟ øɹ ʎønɹ ɔøɯdɐnʎ øɹ ʎønɹ Ⱥddlᴉɔɐʇᴉøn ɐs bǝᴉnƃ ʇɥǝ sønɹɔǝ øɟ ɐnʎ ȺⱣƗ Ȼønʇǝnʇ. Ɏøn ɯɐʎ nøʇ ɯødᴉɟʎ, ɔɹǝɐʇǝ dǝɹᴉʌɐʇᴉʌǝ ʍøɹʞs øɟ, øɹ ɐʇʇǝɯdʇ ʇø nsǝ, lᴉɔǝnsǝ, øɹ ᴉn ɐnʎ ʍɐʎ ǝxdløᴉʇ ɐnʎ ȺⱣƗ Ȼønʇǝnʇ ᴉn ʍɥølǝ øɹ ᴉn dɐɹʇ øn ʎønɹ øʍn bǝɥɐlɟ øɹ øn bǝɥɐlɟ øɟ ɐnʎ ʇɥᴉɹd dɐɹʇʎ. Ɏøn ɯɐʎ nøʇ dᴉsʇɹᴉbnʇǝ øɹ ɯødᴉɟʎ ʇɥǝ ȺⱣƗs øɹ ɐnʎ ȺⱣƗ Ȼønʇǝnʇ (ᴉnɔlndᴉnƃ ɐdɐdʇɐʇᴉøn, ǝdᴉʇᴉnƃ, ǝxɔǝɹdʇᴉnƃ, øɹ ɔɹǝɐʇᴉnƃ dǝɹᴉʌɐʇᴉʌǝ ʍøɹʞs).

source: All names, logos and seals ("Trademarks") that appear in the APIs, API Content, or on or through the services made available on or through the APIs, if any, are the property of their respective owners. You may not remove, alter, or obscure any copyright, Trademark, or other proprietary rights notices incorporated in or accompanying the API Content. If any {platform_name} Participant (as hereinafter defined) or other third party revokes access to API Content owned or controlled by that {platform_name} Participant or third party, including without limitation any Trademarks, you must ensure that all API Content pertaining to that {platform_name} Participant or third party is deleted from Your Application and your networks, systems and servers as soon as reasonably possible. "{platform_name_capitalized} Participants" means MIT, Harvard, and the other entities providing information, API Content or services for the APIs, the course instructors and their staffs.
rtl: شمم رشوثس, مخلخس شري سثشمس ("فقشيثوشقنس") فاشف شححثشق هر فاث شحهس, شحه ذخرفثرف, خق خر خق فاقخعلا فاث سثقدهذثس وشيث شدشهمشزمث خر خق فاقخعلا فاث شحهس, هب شرغ, شقث فاث حقخحثقفغ خب فاثهق قثسحثذفهدث خصرثقس. غخع وشغ رخف قثوخدث, شمفثق, خق خزسذعقث شرغ ذخحغقهلاف, فقشيثوشقن, خق خفاثق حقخحقهثفشقغ قهلافس رخفهذثس هرذخقحخقشفثي هر خق شذذخوحشرغهرل فاث شحه ذخرفثرف. هب شرغ {platform_name} حشقفهذهحشرف (شس اثقثهرشبفثق يثبهرثي) خق خفاثق فاهقي حشقفغ قثدخنثس شذذثسس فخ شحه ذخرفثرف خصرثي خق ذخرفقخممثي زغ فاشف {platform_name} حشقفهذهحشرف خق فاهقي حشقفغ, هرذمعيهرل صهفاخعف مهوهفشفهخر شرغ فقشيثوشقنس, غخع وعسف ثرسعقث فاشف شمم شحه ذخرفثرف حثقفشهرهرل فخ فاشف {platform_name} حشقفهذهحشرف خق فاهقي حشقفغ هس يثمثفثي بقخو غخعق شححمهذشفهخر شري غخعق رثفصخقنس, سغسفثوس شري سثقدثقس شس سخخر شس قثشسخرشزمغ حخسسهزمث. "{platform_name_capitalized} حشقفهذهحشرفس" وثشرس وهف, اشقدشقي, شري فاث خفاثق ثرفهفهثس حقخدهيهرل هربخقوشفهخر, شحه ذخرفثرف خق سثقدهذثس بخق فاث شحهس, فاث ذخعقسث هرسفقعذفخقس شري فاثهق سفشببس.Ⱥll nɐɯǝs, løƃøs ɐnd sǝɐls ("Ŧɹɐdǝɯɐɹʞs") ʇɥɐʇ ɐddǝɐɹ ᴉn ʇɥǝ ȺⱣƗs, ȺⱣƗ Ȼønʇǝnʇ, øɹ øn øɹ ʇɥɹønƃɥ ʇɥǝ sǝɹʌᴉɔǝs ɯɐdǝ ɐʌɐᴉlɐblǝ øn øɹ ʇɥɹønƃɥ ʇɥǝ ȺⱣƗs, ᴉɟ ɐnʎ, ɐɹǝ ʇɥǝ dɹødǝɹʇʎ øɟ ʇɥǝᴉɹ ɹǝsdǝɔʇᴉʌǝ øʍnǝɹs. Ɏøn ɯɐʎ nøʇ ɹǝɯøʌǝ, ɐlʇǝɹ, øɹ øbsɔnɹǝ ɐnʎ ɔødʎɹᴉƃɥʇ, Ŧɹɐdǝɯɐɹʞ, øɹ øʇɥǝɹ dɹødɹᴉǝʇɐɹʎ ɹᴉƃɥʇs nøʇᴉɔǝs ᴉnɔøɹdøɹɐʇǝd ᴉn øɹ ɐɔɔøɯdɐnʎᴉnƃ ʇɥǝ ȺⱣƗ Ȼønʇǝnʇ. Ɨɟ ɐnʎ {platform_name} Ᵽɐɹʇᴉɔᴉdɐnʇ (ɐs ɥǝɹǝᴉnɐɟʇǝɹ dǝɟᴉnǝd) øɹ øʇɥǝɹ ʇɥᴉɹd dɐɹʇʎ ɹǝʌøʞǝs ɐɔɔǝss ʇø ȺⱣƗ Ȼønʇǝnʇ øʍnǝd øɹ ɔønʇɹøllǝd bʎ ʇɥɐʇ {platform_name} Ᵽɐɹʇᴉɔᴉdɐnʇ øɹ ʇɥᴉɹd dɐɹʇʎ, ᴉnɔlndᴉnƃ ʍᴉʇɥønʇ lᴉɯᴉʇɐʇᴉøn ɐnʎ Ŧɹɐdǝɯɐɹʞs, ʎøn ɯnsʇ ǝnsnɹǝ ʇɥɐʇ ɐll ȺⱣƗ Ȼønʇǝnʇ dǝɹʇɐᴉnᴉnƃ ʇø ʇɥɐʇ {platform_name} Ᵽɐɹʇᴉɔᴉdɐnʇ øɹ ʇɥᴉɹd dɐɹʇʎ ᴉs dǝlǝʇǝd ɟɹøɯ Ɏønɹ Ⱥddlᴉɔɐʇᴉøn ɐnd ʎønɹ nǝʇʍøɹʞs, sʎsʇǝɯs ɐnd sǝɹʌǝɹs ɐs søøn ɐs ɹǝɐsønɐblʎ døssᴉblǝ. "{platform_name_capitalized} Ᵽɐɹʇᴉɔᴉdɐnʇs" ɯǝɐns MƗŦ, Ħɐɹʌɐɹd, ɐnd ʇɥǝ øʇɥǝɹ ǝnʇᴉʇᴉǝs dɹøʌᴉdᴉnƃ ᴉnɟøɹɯɐʇᴉøn, ȺⱣƗ Ȼønʇǝnʇ øɹ sǝɹʌᴉɔǝs ɟøɹ ʇɥǝ ȺⱣƗs, ʇɥǝ ɔønɹsǝ ᴉnsʇɹnɔʇøɹs ɐnd ʇɥǝᴉɹ sʇɐɟɟs.

source: To the extent that you submit any content to {platform_name} in connection with your use of the APIs or any API Content, you hereby grant to {platform_name} a worldwide, non-exclusive, transferable, assignable, sub licensable, fully paid-up, royalty-free, perpetual, irrevocable right and license to host, transfer, display, perform, reproduce, modify, distribute, re-distribute, relicense and otherwise use, make available and exploit such content, in whole or in part, in any form and in any media formats and through any media channels (now known or hereafter developed).
rtl: فخ فاث ثطفثرف فاشف غخع سعزوهف شرغ ذخرفثرف فخ {platform_name} هر ذخررثذفهخر صهفا غخعق عسث خب فاث شحهس خق شرغ شحه ذخرفثرف, غخع اثقثزغ لقشرف فخ {platform_name} ش صخقميصهيث, رخر-ثطذمعسهدث, فقشرسبثقشزمث, شسسهلرشزمث, سعز مهذثرسشزمث, بعممغ حشهي-عح, قخغشمفغ-بقثث, حثقحثفعشم, هققثدخذشزمث قهلاف شري مهذثرسث فخ اخسف, فقشرسبثق, يهسحمشغ, حثقبخقو, قثحقخيعذث, وخيهبغ, يهسفقهزعفث, قث-يهسفقهزعفث, قثمهذثرسث شري خفاثقصهسث عسث, وشنث شدشهمشزمث شري ثطحمخهف سعذا ذخرفثرف, هر صاخمث خق هر حشقف, هر شرغ بخقو شري هر شرغ وثيهش بخقوشفس شري فاقخعلا شرغ وثيهش ذاشررثمس (رخص نرخصر خق اثقثشبفثق يثدثمخحثي).

source: Privacy
rtl: حقهدشذغŦø ʇɥǝ ǝxʇǝnʇ ʇɥɐʇ ʎøn snbɯᴉʇ ɐnʎ ɔønʇǝnʇ ʇø {platform_name} ᴉn ɔønnǝɔʇᴉøn ʍᴉʇɥ ʎønɹ nsǝ øɟ ʇɥǝ ȺⱣƗs øɹ ɐnʎ ȺⱣƗ Ȼønʇǝnʇ, ʎøn ɥǝɹǝbʎ ƃɹɐnʇ ʇø {platform_name} ɐ ʍøɹldʍᴉdǝ, nøn-ǝxɔlnsᴉʌǝ, ʇɹɐnsɟǝɹɐblǝ, ɐssᴉƃnɐblǝ, snb lᴉɔǝnsɐblǝ, ɟnllʎ dɐᴉd-nd, ɹøʎɐlʇʎ-ɟɹǝǝ, dǝɹdǝʇnɐl, ᴉɹɹǝʌøɔɐblǝ ɹᴉƃɥʇ ɐnd lᴉɔǝnsǝ ʇø ɥøsʇ, ʇɹɐnsɟǝɹ, dᴉsdlɐʎ, dǝɹɟøɹɯ, ɹǝdɹødnɔǝ, ɯødᴉɟʎ, dᴉsʇɹᴉbnʇǝ, ɹǝ-dᴉsʇɹᴉbnʇǝ, ɹǝlᴉɔǝnsǝ ɐnd øʇɥǝɹʍᴉsǝ nsǝ, ɯɐʞǝ ɐʌɐᴉlɐblǝ ɐnd ǝxdløᴉʇ snɔɥ ɔønʇǝnʇ, ᴉn ʍɥølǝ øɹ ᴉn dɐɹʇ, ᴉn ɐnʎ ɟøɹɯ ɐnd ᴉn ɐnʎ ɯǝdᴉɐ ɟøɹɯɐʇs ɐnd ʇɥɹønƃɥ ɐnʎ ɯǝdᴉɐ ɔɥɐnnǝls (nøʍ ʞnøʍn øɹ ɥǝɹǝɐɟʇǝɹ dǝʌǝlødǝd).

source: You agree to comply with all applicable privacy laws and regulations and to be transparent with respect to any collection and use of end user data. You will provide and adhere to a privacy policy for Your Application that clearly and accurately describes to your end users what user information you collect and how you may use and share such information (including for advertising) with {platform_name} and other third parties.
rtl: غخع شلقثث فخ ذخوحمغ صهفا شمم شححمهذشزمث حقهدشذغ مشصس شري قثلعمشفهخرس شري فخ زث فقشرسحشقثرف صهفا قثسحثذف فخ شرغ ذخممثذفهخر شري عسث خب ثري عسثق يشفش. غخع صهمم حقخدهيث شري شياثقث فخ ش حقهدشذغ حخمهذغ بخق غخعق شححمهذشفهخر فاشف ذمثشقمغ شري شذذعقشفثمغ يثسذقهزثس فخ غخعق ثري عسثقس صاشف عسثق هربخقوشفهخر غخع ذخممثذف شري اخص غخع وشغ عسث شري ساشقث سعذا هربخقوشفهخر (هرذمعيهرل بخق شيدثقفهسهرل) صهفا {platform_name} شري خفاثق فاهقي حشقفهثس.

source: Right to Charge
rtl: قهلاف فخ ذاشقلثɎøn ɐƃɹǝǝ ʇø ɔøɯdlʎ ʍᴉʇɥ ɐll ɐddlᴉɔɐblǝ dɹᴉʌɐɔʎ lɐʍs ɐnd ɹǝƃnlɐʇᴉøns ɐnd ʇø bǝ ʇɹɐnsdɐɹǝnʇ ʍᴉʇɥ ɹǝsdǝɔʇ ʇø ɐnʎ ɔøllǝɔʇᴉøn ɐnd nsǝ øɟ ǝnd nsǝɹ dɐʇɐ. Ɏøn ʍᴉll dɹøʌᴉdǝ ɐnd ɐdɥǝɹǝ ʇø ɐ dɹᴉʌɐɔʎ dølᴉɔʎ ɟøɹ Ɏønɹ Ⱥddlᴉɔɐʇᴉøn ʇɥɐʇ ɔlǝɐɹlʎ ɐnd ɐɔɔnɹɐʇǝlʎ dǝsɔɹᴉbǝs ʇø ʎønɹ ǝnd nsǝɹs ʍɥɐʇ nsǝɹ ᴉnɟøɹɯɐʇᴉøn ʎøn ɔøllǝɔʇ ɐnd ɥøʍ ʎøn ɯɐʎ nsǝ ɐnd sɥɐɹǝ snɔɥ ᴉnɟøɹɯɐʇᴉøn (ᴉnɔlndᴉnƃ ɟøɹ ɐdʌǝɹʇᴉsᴉnƃ) ʍᴉʇɥ {platform_name} ɐnd øʇɥǝɹ ʇɥᴉɹd dɐɹʇᴉǝs.

source: Certain access to the APIs may be provided free of charge, but {platform_name} reserves the right to charge fees for future use or access to the APIs.
rtl: ذثقفشهر شذذثسس فخ فاث شحهس وشغ زث حقخدهيثي بقثث خب ذاشقلث, زعف {platform_name} قثسثقدثس فاث قهلاف فخ ذاشقلث بثثس بخق بعفعقث عسث خق شذذثسس فخ فاث شحهس.Ȼǝɹʇɐᴉn ɐɔɔǝss ʇø ʇɥǝ ȺⱣƗs ɯɐʎ bǝ dɹøʌᴉdǝd ɟɹǝǝ øɟ ɔɥɐɹƃǝ, bnʇ {platform_name} ɹǝsǝɹʌǝs ʇɥǝ ɹᴉƃɥʇ ʇø ɔɥɐɹƃǝ ɟǝǝs ɟøɹ ɟnʇnɹǝ nsǝ øɹ ɐɔɔǝss ʇø ʇɥǝ ȺⱣƗs.

source: {platform_name_capitalized} reserves the right to modify the Terms at any time without advance notice. Any changes to the Terms will be effective immediately upon posting on this page, with an updated effective date. By accessing or using the APIs after any changes have been made, you signify your agreement on a prospective basis to the modified Terms and all of the changes. Be sure to return to this page periodically to ensure familiarity with the most current version of the Terms.
rtl: {platform_name_capitalized} قثسثقدثس فاث قهلاف فخ وخيهبغ فاث فثقوس شف شرغ فهوث صهفاخعف شيدشرذث رخفهذث. شرغ ذاشرلثس فخ فاث فثقوس صهمم زث ثببثذفهدث هووثيهشفثمغ عحخر حخسفهرل خر فاهس حشلث, صهفا شر عحيشفثي ثببثذفهدث يشفث. زغ شذذثسسهرل خق عسهرل فاث شحهس شبفثق شرغ ذاشرلثس اشدث زثثر وشيث, غخع سهلرهبغ غخعق شلقثثوثرف خر ش حقخسحثذفهدث زشسهس فخ فاث وخيهبهثي فثقوس شري شمم خب فاث ذاشرلثس. زث سعقث فخ قثفعقر فخ فاهس حشلث حثقهخيهذشممغ فخ ثرسعقث بشوهمهشقهفغ صهفا فاث وخسف ذعققثرف دثقسهخر خب فاث فثقوس.{platform_name_capitalized} ɹǝsǝɹʌǝs ʇɥǝ ɹᴉƃɥʇ ʇø ɯødᴉɟʎ ʇɥǝ Ŧǝɹɯs ɐʇ ɐnʎ ʇᴉɯǝ ʍᴉʇɥønʇ ɐdʌɐnɔǝ nøʇᴉɔǝ. Ⱥnʎ ɔɥɐnƃǝs ʇø ʇɥǝ Ŧǝɹɯs ʍᴉll bǝ ǝɟɟǝɔʇᴉʌǝ ᴉɯɯǝdᴉɐʇǝlʎ ndøn døsʇᴉnƃ øn ʇɥᴉs dɐƃǝ, ʍᴉʇɥ ɐn nddɐʇǝd ǝɟɟǝɔʇᴉʌǝ dɐʇǝ. Ƀʎ ɐɔɔǝssᴉnƃ øɹ nsᴉnƃ ʇɥǝ ȺⱣƗs ɐɟʇǝɹ ɐnʎ ɔɥɐnƃǝs ɥɐʌǝ bǝǝn ɯɐdǝ, ʎøn sᴉƃnᴉɟʎ ʎønɹ ɐƃɹǝǝɯǝnʇ øn ɐ dɹøsdǝɔʇᴉʌǝ bɐsᴉs ʇø ʇɥǝ ɯødᴉɟᴉǝd Ŧǝɹɯs ɐnd ɐll øɟ ʇɥǝ ɔɥɐnƃǝs. Ƀǝ snɹǝ ʇø ɹǝʇnɹn ʇø ʇɥᴉs dɐƃǝ dǝɹᴉødᴉɔɐllʎ ʇø ǝnsnɹǝ ɟɐɯᴉlᴉɐɹᴉʇʎ ʍᴉʇɥ ʇɥǝ ɯøsʇ ɔnɹɹǝnʇ ʌǝɹsᴉøn øɟ ʇɥǝ Ŧǝɹɯs.

source: {platform_name_capitalized} may also update or modify the APIs from time to time without advance notice. These changes may affect your use of the APIs or the way your integration interacts with the API. If we make a change that is unacceptable to you, you should stop using the APIs. Continued use of the APIs means you accept the change.
rtl: {platform_name_capitalized} وشغ شمسخ عحيشفث خق وخيهبغ فاث شحهس بقخو فهوث فخ فهوث صهفاخعف شيدشرذث رخفهذث. فاثسث ذاشرلثس وشغ شببثذف غخعق عسث خب فاث شحهس خق فاث صشغ غخعق هرفثلقشفهخر هرفثقشذفس صهفا فاث شحه. هب صث وشنث ش ذاشرلث فاشف هس عرشذذثحفشزمث فخ غخع, غخع ساخعمي سفخح عسهرل فاث شحهس. ذخرفهرعثي عسث خب فاث شحهس وثشرس غخع شذذثحف فاث ذاشرلث.

source: Confidentiality
rtl: ذخربهيثرفهشمهفغ{platform_name_capitalized} ɯɐʎ ɐlsø nddɐʇǝ øɹ ɯødᴉɟʎ ʇɥǝ ȺⱣƗs ɟɹøɯ ʇᴉɯǝ ʇø ʇᴉɯǝ ʍᴉʇɥønʇ ɐdʌɐnɔǝ nøʇᴉɔǝ. Ŧɥǝsǝ ɔɥɐnƃǝs ɯɐʎ ɐɟɟǝɔʇ ʎønɹ nsǝ øɟ ʇɥǝ ȺⱣƗs øɹ ʇɥǝ ʍɐʎ ʎønɹ ᴉnʇǝƃɹɐʇᴉøn ᴉnʇǝɹɐɔʇs ʍᴉʇɥ ʇɥǝ ȺⱣƗ. Ɨɟ ʍǝ ɯɐʞǝ ɐ ɔɥɐnƃǝ ʇɥɐʇ ᴉs nnɐɔɔǝdʇɐblǝ ʇø ʎøn, ʎøn sɥønld sʇød nsᴉnƃ ʇɥǝ ȺⱣƗs. Ȼønʇᴉnnǝd nsǝ øɟ ʇɥǝ ȺⱣƗs ɯǝɐns ʎøn ɐɔɔǝdʇ ʇɥǝ ɔɥɐnƃǝ.

source: Your credentials (such as client secret and IDs) are intended to be used solely by you. You will keep your credentials confidential and prevent and discourage others from using your credentials. Your credentials may not be embedded in open source projects.
rtl: غخعق ذقثيثرفهشمس (سعذا شس ذمهثرف سثذقثف شري هيس) شقث هرفثريثي فخ زث عسثي سخمثمغ زغ غخع. غخع صهمم نثثح غخعق ذقثيثرفهشمس ذخربهيثرفهشم شري حقثدثرف شري يهسذخعقشلث خفاثقس بقخو عسهرل غخعق ذقثيثرفهشمس. غخعق ذقثيثرفهشمس وشغ رخف زث ثوزثييثي هر خحثر سخعقذث حقختثذفس.Ɏønɹ ɔɹǝdǝnʇᴉɐls (snɔɥ ɐs ɔlᴉǝnʇ sǝɔɹǝʇ ɐnd ƗĐs) ɐɹǝ ᴉnʇǝndǝd ʇø bǝ nsǝd sølǝlʎ bʎ ʎøn. Ɏøn ʍᴉll ʞǝǝd ʎønɹ ɔɹǝdǝnʇᴉɐls ɔønɟᴉdǝnʇᴉɐl ɐnd dɹǝʌǝnʇ ɐnd dᴉsɔønɹɐƃǝ øʇɥǝɹs ɟɹøɯ nsᴉnƃ ʎønɹ ɔɹǝdǝnʇᴉɐls. Ɏønɹ ɔɹǝdǝnʇᴉɐls ɯɐʎ nøʇ bǝ ǝɯbǝddǝd ᴉn ødǝn sønɹɔǝ dɹøɾǝɔʇs.

source: In the event that {platform_name} provides you with access to information specific to {platform_name} and/or the APIs that is either marked as "Confidential" or which a reasonable person would assume to be confidential or proprietary given the terms of its disclosure ("Confidential Information"), you agree to use this information only to use and build with the APIs. You may not disclose the Confidential Information to anyone without {platform_name}'s prior written consent, and you agree to protect the Confidential Information from unauthorized use and disclosure in the same way that you would protect your own confidential information. Confidential Information does not include information that you independently developed, that was rightfully given to you by a third party without any confidentiality obligation, or that becomes public through no fault of your own. You may disclose Confidential Information when compelled to do so by law if you provide {platform_name} with reasonable prior notice, unless a court orders that {platform_name} not receive notice.
rtl: هر فاث ثدثرف فاشف {platform_name} حقخدهيثس غخع صهفا شذذثسس فخ هربخقوشفهخر سحثذهبهذ فخ {platform_name} شري/خق فاث شحهس فاشف هس ثهفاثق وشقنثي شس "ذخربهيثرفهشم" خق صاهذا ش قثشسخرشزمث حثقسخر صخعمي شسسعوث فخ زث ذخربهيثرفهشم خق حقخحقهثفشقغ لهدثر فاث فثقوس خب هفس يهسذمخسعقث ("ذخربهيثرفهشم هربخقوشفهخر"), غخع شلقثث فخ عسث فاهس هربخقوشفهخر خرمغ فخ عسث شري زعهمي صهفا فاث شحهس. غخع وشغ رخف يهسذمخسث فاث ذخربهيثرفهشم هربخقوشفهخر فخ شرغخرث صهفاخعف {platform_name}'س حقهخق صقهففثر ذخرسثرف, شري غخع شلقثث فخ حقخفثذف فاث ذخربهيثرفهشم هربخقوشفهخر بقخو عرشعفاخقهظثي عسث شري يهسذمخسعقث هر فاث سشوث صشغ فاشف غخع صخعمي حقخفثذف غخعق خصر ذخربهيثرفهشم هربخقوشفهخر. ذخربهيثرفهشم هربخقوشفهخر يخثس رخف هرذمعيث هربخقوشفهخر فاشف غخع هريثحثريثرفمغ يثدثمخحثي, فاشف صشس قهلافبعممغ لهدثر فخ غخع زغ ش فاهقي حشقفغ صهفاخعف شرغ ذخربهيثرفهشمهفغ خزمهلشفهخر, خق فاشف زثذخوثس حعزمهذ فاقخعلا رخ بشعمف خب غخعق خصر. غخع وشغ يهسذمخسث ذخربهيثرفهشم هربخقوشفهخر صاثر ذخوحثممثي فخ يخ سخ زغ مشص هب غخع حقخدهيث {platform_name} صهفا قثشسخرشزمث حقهخق رخفهذث, عرمثسس ش ذخعقف خقيثقس فاشف {platform_name} رخف قثذثهدث رخفهذث.

source: Disclaimer of Warranty / Limitation of Liabilities
rtl: يهسذمشهوثق خب صشققشرفغ / مهوهفشفهخر خب مهشزهمهفهثسƗn ʇɥǝ ǝʌǝnʇ ʇɥɐʇ {platform_name} dɹøʌᴉdǝs ʎøn ʍᴉʇɥ ɐɔɔǝss ʇø ᴉnɟøɹɯɐʇᴉøn sdǝɔᴉɟᴉɔ ʇø {platform_name} ɐnd/øɹ ʇɥǝ ȺⱣƗs ʇɥɐʇ ᴉs ǝᴉʇɥǝɹ ɯɐɹʞǝd ɐs "Ȼønɟᴉdǝnʇᴉɐl" øɹ ʍɥᴉɔɥ ɐ ɹǝɐsønɐblǝ dǝɹsøn ʍønld ɐssnɯǝ ʇø bǝ ɔønɟᴉdǝnʇᴉɐl øɹ dɹødɹᴉǝʇɐɹʎ ƃᴉʌǝn ʇɥǝ ʇǝɹɯs øɟ ᴉʇs dᴉsɔløsnɹǝ ("Ȼønɟᴉdǝnʇᴉɐl Ɨnɟøɹɯɐʇᴉøn"), ʎøn ɐƃɹǝǝ ʇø nsǝ ʇɥᴉs ᴉnɟøɹɯɐʇᴉøn ønlʎ ʇø nsǝ ɐnd bnᴉld ʍᴉʇɥ ʇɥǝ ȺⱣƗs. Ɏøn ɯɐʎ nøʇ dᴉsɔløsǝ ʇɥǝ Ȼønɟᴉdǝnʇᴉɐl Ɨnɟøɹɯɐʇᴉøn ʇø ɐnʎønǝ ʍᴉʇɥønʇ {platform_name}'s dɹᴉøɹ ʍɹᴉʇʇǝn ɔønsǝnʇ, ɐnd ʎøn ɐƃɹǝǝ ʇø dɹøʇǝɔʇ ʇɥǝ Ȼønɟᴉdǝnʇᴉɐl Ɨnɟøɹɯɐʇᴉøn ɟɹøɯ nnɐnʇɥøɹᴉzǝd nsǝ ɐnd dᴉsɔløsnɹǝ ᴉn ʇɥǝ sɐɯǝ ʍɐʎ ʇɥɐʇ ʎøn ʍønld dɹøʇǝɔʇ ʎønɹ øʍn ɔønɟᴉdǝnʇᴉɐl ᴉnɟøɹɯɐʇᴉøn. Ȼønɟᴉdǝnʇᴉɐl Ɨnɟøɹɯɐʇᴉøn døǝs nøʇ ᴉnɔlndǝ ᴉnɟøɹɯɐʇᴉøn ʇɥɐʇ ʎøn ᴉndǝdǝndǝnʇlʎ dǝʌǝlødǝd, ʇɥɐʇ ʍɐs ɹᴉƃɥʇɟnllʎ ƃᴉʌǝn ʇø ʎøn bʎ ɐ ʇɥᴉɹd dɐɹʇʎ ʍᴉʇɥønʇ ɐnʎ ɔønɟᴉdǝnʇᴉɐlᴉʇʎ øblᴉƃɐʇᴉøn, øɹ ʇɥɐʇ bǝɔøɯǝs dnblᴉɔ ʇɥɹønƃɥ nø ɟɐnlʇ øɟ ʎønɹ øʍn. Ɏøn ɯɐʎ dᴉsɔløsǝ Ȼønɟᴉdǝnʇᴉɐl Ɨnɟøɹɯɐʇᴉøn ʍɥǝn ɔøɯdǝllǝd ʇø dø sø bʎ lɐʍ ᴉɟ ʎøn dɹøʌᴉdǝ {platform_name} ʍᴉʇɥ ɹǝɐsønɐblǝ dɹᴉøɹ nøʇᴉɔǝ, nnlǝss ɐ ɔønɹʇ øɹdǝɹs ʇɥɐʇ {platform_name} nøʇ ɹǝɔǝᴉʌǝ nøʇᴉɔǝ.
