Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: The term in which the new course will run. (This value is often different than the original course run value.)
rtl: فاث فثقو هر صاهذا فاث رثص ذخعقسث صهمم قعر. (فاهس دشمعث هس خبفثر يهببثقثرف فاشر فاث خقهلهرشم ذخعقسث قعر دشمعث.)

source: Create Re-run
rtl: ذقثشفث قث-قعر

source: When will my course re-run start?
rtl: صاثر صهمم وغ ذخعقسث قث-قعر سفشقف?

source: The new course is set to start on January 1, 2030 at midnight (UTC).
rtl: فاث رثص ذخعقسث هس سثف فخ سفشقف خر تشرعشقغ 1, 2030 شف وهيرهلاف (عفذ).

source: What transfers from the original course?
rtl: صاشف فقشرسبثقس بقخو فاث خقهلهرشم ذخعقسث?Ŧɥǝ ʇǝɹɯ ᴉn ʍɥᴉɔɥ ʇɥǝ nǝʍ ɔønɹsǝ ʍᴉll ɹnn. (Ŧɥᴉs ʌɐlnǝ ᴉs øɟʇǝn dᴉɟɟǝɹǝnʇ ʇɥɐn ʇɥǝ øɹᴉƃᴉnɐl ɔønɹsǝ ɹnn ʌɐlnǝ.)

source: The new course has the same course outline and content as the original course. All problems, videos, announcements, and other files are duplicated to the new course.
rtl: فاث رثص ذخعقسث اشس فاث سشوث ذخعقسث خعفمهرث شري ذخرفثرف شس فاث خقهلهرشم ذخعقسث. شمم حقخزمثوس, دهيثخس, شررخعرذثوثرفس, شري خفاثق بهمثس شقث يعحمهذشفثي فخ فاث رثص ذخعقسث.

source: What does not transfer from the original course?
rtl: صاشف يخثس رخف فقشرسبثق بقخو فاث خقهلهرشم ذخعقسث?Ŧɥǝ nǝʍ ɔønɹsǝ ɥɐs ʇɥǝ sɐɯǝ ɔønɹsǝ ønʇlᴉnǝ ɐnd ɔønʇǝnʇ ɐs ʇɥǝ øɹᴉƃᴉnɐl ɔønɹsǝ. Ⱥll dɹøblǝɯs, ʌᴉdǝøs, ɐnnønnɔǝɯǝnʇs, ɐnd øʇɥǝɹ ɟᴉlǝs ɐɹǝ dndlᴉɔɐʇǝd ʇø ʇɥǝ nǝʍ ɔønɹsǝ.

source: You are the only member of the new course's staff. No students are enrolled in the course, and there is no student data. There is no content in the discussion topics or wiki.
rtl: غخع شقث فاث خرمغ وثوزثق خب فاث رثص ذخعقسث'س سفشبب. رخ سفعيثرفس شقث ثرقخممثي هر فاث ذخعقسث, شري فاثقث هس رخ سفعيثرف يشفش. فاثقث هس رخ ذخرفثرف هر فاث يهسذعسسهخر فخحهذس خق صهنه.

source: Learn more about Course Re-runs
rtl: مثشقر وخقث شزخعف ذخعقسث قث-قعرس

source: Course Updates
rtl: ذخعقسث عحيشفثس

source: New Update
rtl: رثص عحيشفثɎøn ɐɹǝ ʇɥǝ ønlʎ ɯǝɯbǝɹ øɟ ʇɥǝ nǝʍ ɔønɹsǝ's sʇɐɟɟ. Nø sʇndǝnʇs ɐɹǝ ǝnɹøllǝd ᴉn ʇɥǝ ɔønɹsǝ, ɐnd ʇɥǝɹǝ ᴉs nø sʇndǝnʇ dɐʇɐ. Ŧɥǝɹǝ ᴉs nø ɔønʇǝnʇ ᴉn ʇɥǝ dᴉsɔnssᴉøn ʇødᴉɔs øɹ ʍᴉʞᴉ.

source: Use course updates to notify students of important dates or exams, highlight particular discussions in the forums, announce schedule changes, and respond to student questions. You add or edit updates in HTML.
rtl: عسث ذخعقسث عحيشفثس فخ رخفهبغ سفعيثرفس خب هوحخقفشرف يشفثس خق ثطشوس, اهلامهلاف حشقفهذعمشق يهسذعسسهخرس هر فاث بخقعوس, شررخعرذث سذاثيعمث ذاشرلثس, شري قثسحخري فخ سفعيثرف ضعثسفهخرس. غخع شيي خق ثيهف عحيشفثس هر افوم.Ʉsǝ ɔønɹsǝ nddɐʇǝs ʇø nøʇᴉɟʎ sʇndǝnʇs øɟ ᴉɯdøɹʇɐnʇ dɐʇǝs øɹ ǝxɐɯs, ɥᴉƃɥlᴉƃɥʇ dɐɹʇᴉɔnlɐɹ dᴉsɔnssᴉøns ᴉn ʇɥǝ ɟøɹnɯs, ɐnnønnɔǝ sɔɥǝdnlǝ ɔɥɐnƃǝs, ɐnd ɹǝsdønd ʇø sʇndǝnʇ bnǝsʇᴉøns. Ɏøn ɐdd øɹ ǝdᴉʇ nddɐʇǝs ᴉn ĦŦMŁ.

source: This course was created as a re-run. Some manual configuration is needed.
rtl: فاهس ذخعقسث صشس ذقثشفثي شس ش قث-قعر. سخوث وشرعشم ذخربهلعقشفهخر هس رثثيثي.Ŧɥᴉs ɔønɹsǝ ʍɐs ɔɹǝɐʇǝd ɐs ɐ ɹǝ-ɹnn. Søɯǝ ɯɐnnɐl ɔønɟᴉƃnɹɐʇᴉøn ᴉs nǝǝdǝd.

source: No course content is currently visible, and no learners are enrolled. Be sure to review and reset all dates, including the Course Start Date; set up the course team; review course updates and other assets for dated material; and seed the discussions and wiki.
rtl: رخ ذخعقسث ذخرفثرف هس ذعققثرفمغ دهسهزمث, شري رخ مثشقرثقس شقث ثرقخممثي. زث سعقث فخ قثدهثص شري قثسثف شمم يشفثس, هرذمعيهرل فاث ذخعقسث سفشقف يشفث; سثف عح فاث ذخعقسث فثشو; قثدهثص ذخعقسث عحيشفثس شري خفاثق شسسثفس بخق يشفثي وشفثقهشم; شري سثثي فاث يهسذعسسهخرس شري صهنه.

source: This course uses features that are no longer supported.
rtl: فاهس ذخعقسث عسثس بثشفعقثس فاشف شقث رخ مخرلثق سعححخقفثي.

source: You must delete or replace the following components.
rtl: غخع وعسف يثمثفث خق قثحمشذث فاث بخممخصهرل ذخوحخرثرفس.

source: Unsupported Components
rtl: عرسعححخقفثي ذخوحخرثرفس

source: Deprecated Component
rtl: يثحقثذشفثي ذخوحخرثرفNø ɔønɹsǝ ɔønʇǝnʇ ᴉs ɔnɹɹǝnʇlʎ ʌᴉsᴉblǝ, ɐnd nø lǝɐɹnǝɹs ɐɹǝ ǝnɹøllǝd. Ƀǝ snɹǝ ʇø ɹǝʌᴉǝʍ ɐnd ɹǝsǝʇ ɐll dɐʇǝs, ᴉnɔlndᴉnƃ ʇɥǝ Ȼønɹsǝ Sʇɐɹʇ Đɐʇǝ; sǝʇ nd ʇɥǝ ɔønɹsǝ ʇǝɐɯ; ɹǝʌᴉǝʍ ɔønɹsǝ nddɐʇǝs ɐnd øʇɥǝɹ ɐssǝʇs ɟøɹ dɐʇǝd ɯɐʇǝɹᴉɐl; ɐnd sǝǝd ʇɥǝ dᴉsɔnssᴉøns ɐnd ʍᴉʞᴉ.

source: To avoid errors, {platform_name} strongly recommends that you remove unsupported features from the course advanced settings. To do this, go to the {link_start}Advanced Settings page{link_end}, locate the "Advanced Module List" setting, and then delete the following modules from the list.
rtl: فخ شدخهي ثققخقس, {platform_name} سفقخرلمغ قثذخووثريس فاشف غخع قثوخدث عرسعححخقفثي بثشفعقثس بقخو فاث ذخعقسث شيدشرذثي سثففهرلس. فخ يخ فاهس, لخ فخ فاث {link_start}شيدشرذثي سثففهرلس حشلث{link_end}, مخذشفث فاث "شيدشرذثي وخيعمث مهسف" سثففهرل, شري فاثر يثمثفث فاث بخممخصهرل وخيعمثس بقخو فاث مهسف.

source: Unsupported Advance Modules
rtl: عرسعححخقفثي شيدشرذث وخيعمثسŦø ɐʌøᴉd ǝɹɹøɹs, {platform_name} sʇɹønƃlʎ ɹǝɔøɯɯǝnds ʇɥɐʇ ʎøn ɹǝɯøʌǝ nnsnddøɹʇǝd ɟǝɐʇnɹǝs ɟɹøɯ ʇɥǝ ɔønɹsǝ ɐdʌɐnɔǝd sǝʇʇᴉnƃs. Ŧø dø ʇɥᴉs, ƃø ʇø ʇɥǝ {link_start}Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs dɐƃǝ{link_end}, løɔɐʇǝ ʇɥǝ "Ⱥdʌɐnɔǝd Mødnlǝ Łᴉsʇ" sǝʇʇᴉnƃ, ɐnd ʇɥǝn dǝlǝʇǝ ʇɥǝ ɟølløʍᴉnƃ ɯødnlǝs ɟɹøɯ ʇɥǝ lᴉsʇ.

source: This course has proctored exam settings that are incomplete or invalid.
rtl: فاهس ذخعقسث اشس حقخذفخقثي ثطشو سثففهرلس فاشف شقث هرذخوحمثفث خق هردشمهي.Ŧɥᴉs ɔønɹsǝ ɥɐs dɹøɔʇøɹǝd ǝxɐɯ sǝʇʇᴉnƃs ʇɥɐʇ ɐɹǝ ᴉnɔøɯdlǝʇǝ øɹ ᴉnʌɐlᴉd.

source: To update these settings go to the {link_start}Proctored Exam Settings page{link_end}.
rtl: فخ عحيشفث فاثسث سثففهرلس لخ فخ فاث {link_start}حقخذفخقثي ثطشو سثففهرلس حشلث{link_end}.Ŧø nddɐʇǝ ʇɥǝsǝ sǝʇʇᴉnƃs ƃø ʇø ʇɥǝ {link_start}Ᵽɹøɔʇøɹǝd Ɇxɐɯ Sǝʇʇᴉnƃs dɐƃǝ{link_end}.

source: To update these settings go to the {link_start}Advanced Settings page{link_end}.
rtl: فخ عحيشفث فاثسث سثففهرلس لخ فخ فاث {link_start}شيدشرذثي سثففهرلس حشلث{link_end}.

source: Proctoring Settings Errors
rtl: حقخذفخقهرل سثففهرلس ثققخقس

source: Click to add a new section
rtl: ذمهذن فخ شيي ش رثص سثذفهخر

source: New Section
rtl: رثص سثذفهخر

source: Reindex current course
rtl: قثهريثط ذعققثرف ذخعقسث

source: Reindex
rtl: قثهريثط

source: Collapse All Sections
rtl: ذخممشحسث شمم سثذفهخرس

source: Expand All Sections
rtl: ثطحشري شمم سثذفهخرس

source: Click to open the courseware in the LMS in a new tab
rtl: ذمهذن فخ خحثر فاث ذخعقسثصشقث هر فاث موس هر ش رثص فشز

source: View Live
rtl: دهثص مهدث

source: Creating your course organization
rtl: ذقثشفهرل غخعق ذخعقسث خقلشرهظشفهخر

source: You add sections, subsections, and units directly in the outline.
rtl: غخع شيي سثذفهخرس, سعزسثذفهخرس, شري عرهفس يهقثذفمغ هر فاث خعفمهرث.Ŧø nddɐʇǝ ʇɥǝsǝ sǝʇʇᴉnƃs ƃø ʇø ʇɥǝ {link_start}Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs dɐƃǝ{link_end}.

source: Create a section, then add subsections and units. Open a unit to add course components.
rtl: ذقثشفث ش سثذفهخر, فاثر شيي سعزسثذفهخرس شري عرهفس. خحثر ش عرهف فخ شيي ذخعقسث ذخوحخرثرفس.

source: Reorganizing your course
rtl: قثخقلشرهظهرل غخعق ذخعقسثȻɹǝɐʇǝ ɐ sǝɔʇᴉøn, ʇɥǝn ɐdd snbsǝɔʇᴉøns ɐnd nnᴉʇs. Ødǝn ɐ nnᴉʇ ʇø ɐdd ɔønɹsǝ ɔøɯdønǝnʇs.

source: Drag sections, subsections, and units to new locations in the outline.
rtl: يقشل سثذفهخرس, سعزسثذفهخرس, شري عرهفس فخ رثص مخذشفهخرس هر فاث خعفمهرث.

source: Learn more about the course outline
rtl: مثشقر وخقث شزخعف فاث ذخعقسث خعفمهرث

source: Setting release dates and grading policies
rtl: سثففهرل قثمثشسث يشفثس شري لقشيهرل حخمهذهثسĐɹɐƃ sǝɔʇᴉøns, snbsǝɔʇᴉøns, ɐnd nnᴉʇs ʇø nǝʍ løɔɐʇᴉøns ᴉn ʇɥǝ ønʇlᴉnǝ.

source: Select the Configure icon for a section or subsection to set its release date. When you configure a subsection, you can also set the grading policy and due date.
rtl: سثمثذف فاث ذخربهلعقث هذخر بخق ش سثذفهخر خق سعزسثذفهخر فخ سثف هفس قثمثشسث يشفث. صاثر غخع ذخربهلعقث ش سعزسثذفهخر, غخع ذشر شمسخ سثف فاث لقشيهرل حخمهذغ شري يعث يشفث.

source: Learn more about grading policy settings
rtl: مثشقر وخقث شزخعف لقشيهرل حخمهذغ سثففهرلس

source: Changing the content learners see
rtl: ذاشرلهرل فاث ذخرفثرف مثشقرثقس سثثSǝlǝɔʇ ʇɥǝ Ȼønɟᴉƃnɹǝ ᴉɔøn ɟøɹ ɐ sǝɔʇᴉøn øɹ snbsǝɔʇᴉøn ʇø sǝʇ ᴉʇs ɹǝlǝɐsǝ dɐʇǝ. Wɥǝn ʎøn ɔønɟᴉƃnɹǝ ɐ snbsǝɔʇᴉøn, ʎøn ɔɐn ɐlsø sǝʇ ʇɥǝ ƃɹɐdᴉnƃ dølᴉɔʎ ɐnd dnǝ dɐʇǝ.

source: To publish draft content, select the Publish icon for a section, subsection, or unit.
rtl: فخ حعزمهسا يقشبف ذخرفثرف, سثمثذف فاث حعزمهسا هذخر بخق ش سثذفهخر, سعزسثذفهخر, خق عرهف.Ŧø dnblᴉsɥ dɹɐɟʇ ɔønʇǝnʇ, sǝlǝɔʇ ʇɥǝ Ᵽnblᴉsɥ ᴉɔøn ɟøɹ ɐ sǝɔʇᴉøn, snbsǝɔʇᴉøn, øɹ nnᴉʇ.

source: To make a section, subsection, or unit unavailable to learners, select the Configure icon for that level, then select the appropriate {em_start}Hide{em_end} option. Grades for hidden sections, subsections, and units are not included in grade calculations.
rtl: فخ وشنث ش سثذفهخر, سعزسثذفهخر, خق عرهف عرشدشهمشزمث فخ مثشقرثقس, سثمثذف فاث ذخربهلعقث هذخر بخق فاشف مثدثم, فاثر سثمثذف فاث شححقخحقهشفث {em_start}اهيث{em_end} خحفهخر. لقشيثس بخق اهييثر سثذفهخرس, سعزسثذفهخرس, شري عرهفس شقث رخف هرذمعيثي هر لقشيث ذشمذعمشفهخرس.Ŧø ɯɐʞǝ ɐ sǝɔʇᴉøn, snbsǝɔʇᴉøn, øɹ nnᴉʇ nnɐʌɐᴉlɐblǝ ʇø lǝɐɹnǝɹs, sǝlǝɔʇ ʇɥǝ Ȼønɟᴉƃnɹǝ ᴉɔøn ɟøɹ ʇɥɐʇ lǝʌǝl, ʇɥǝn sǝlǝɔʇ ʇɥǝ ɐddɹødɹᴉɐʇǝ {em_start}Ħᴉdǝ{em_end} ødʇᴉøn. Ǥɹɐdǝs ɟøɹ ɥᴉddǝn sǝɔʇᴉøns, snbsǝɔʇᴉøns, ɐnd nnᴉʇs ɐɹǝ nøʇ ᴉnɔlndǝd ᴉn ƃɹɐdǝ ɔɐlɔnlɐʇᴉøns.

source: To hide the content of a subsection from learners after the subsection due date has passed, select the Configure icon for a subsection, then select {em_start}Hide content after due date{em_end}. Grades for the subsection remain included in grade calculations.
rtl: فخ اهيث فاث ذخرفثرف خب ش سعزسثذفهخر بقخو مثشقرثقس شبفثق فاث سعزسثذفهخر يعث يشفث اشس حشسسثي, سثمثذف فاث ذخربهلعقث هذخر بخق ش سعزسثذفهخر, فاثر سثمثذف {em_start}اهيث ذخرفثرف شبفثق يعث يشفث{em_end}. لقشيثس بخق فاث سعزسثذفهخر قثوشهر هرذمعيثي هر لقشيث ذشمذعمشفهخرس.

source: Learn more about content visibility settings
rtl: مثشقر وخقث شزخعف ذخرفثرف دهسهزهمهفغ سثففهرلس

source: Pages
rtl: حشلثس

source: New Page
rtl: رثص حشلثŦø ɥᴉdǝ ʇɥǝ ɔønʇǝnʇ øɟ ɐ snbsǝɔʇᴉøn ɟɹøɯ lǝɐɹnǝɹs ɐɟʇǝɹ ʇɥǝ snbsǝɔʇᴉøn dnǝ dɐʇǝ ɥɐs dɐssǝd, sǝlǝɔʇ ʇɥǝ Ȼønɟᴉƃnɹǝ ᴉɔøn ɟøɹ ɐ snbsǝɔʇᴉøn, ʇɥǝn sǝlǝɔʇ {em_start}Ħᴉdǝ ɔønʇǝnʇ ɐɟʇǝɹ dnǝ dɐʇǝ{em_end}. Ǥɹɐdǝs ɟøɹ ʇɥǝ snbsǝɔʇᴉøn ɹǝɯɐᴉn ᴉnɔlndǝd ᴉn ƃɹɐdǝ ɔɐlɔnlɐʇᴉøns.

source: Pages & Resources
rtl: Ᵽɐƃǝs & Ɍǝsønɹɔǝs

source: Note: Pages are publicly visible. If users know the URL of a page, they can view the page even if they are not registered for or logged in to your course.
rtl: رخفث: حشلثس شقث حعزمهذمغ دهسهزمث. هب عسثقس نرخص فاث عقم خب ش حشلث, فاثغ ذشر دهثص فاث حشلث ثدثر هب فاثغ شقث رخف قثلهسفثقثي بخق خق مخللثي هر فخ غخعق ذخعقسث.

source: Show this page
rtl: ساخص فاهس حشلث

source: Show/hide page
rtl: ساخص/اهيث حشلث

source: This page cannot be reordered
rtl: فاهس حشلث ذشررخف زث قثخقيثقثي

source: You can add additional custom pages to your course.
rtl: غخع ذشر شيي شييهفهخرشم ذعسفخو حشلثس فخ غخعق ذخعقسث.

source: Add a New Page
rtl: شيي ش رثص حشلث

source: What are pages?
rtl: صاشف شقث حشلثس?

source: Pages are listed horizontally at the top of your course. Default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages that you create.
rtl: حشلثس شقث مهسفثي اخقهظخرفشممغ شف فاث فخح خب غخعق ذخعقسث. يثبشعمف حشلثس (اخوث, ذخعقسث, يهسذعسسهخر, صهنه, شري حقخلقثسس) شقث بخممخصثي زغ فثطفزخخنس شري ذعسفخو حشلثس فاشف غخع ذقثشفث.Nøʇǝ: Ᵽɐƃǝs ɐɹǝ dnblᴉɔlʎ ʌᴉsᴉblǝ. Ɨɟ nsǝɹs ʞnøʍ ʇɥǝ ɄɌŁ øɟ ɐ dɐƃǝ, ʇɥǝʎ ɔɐn ʌᴉǝʍ ʇɥǝ dɐƃǝ ǝʌǝn ᴉɟ ʇɥǝʎ ɐɹǝ nøʇ ɹǝƃᴉsʇǝɹǝd ɟøɹ øɹ løƃƃǝd ᴉn ʇø ʎønɹ ɔønɹsǝ.

source: What are custom pages?
rtl: Wɥɐʇ ɐɹǝ ɔnsʇøɯ dɐƃǝs?

source: You can create and edit custom pages to provide students with additional course content. For example, you can create pages for the grading policy, course slides, and a course calendar.
rtl: غخع ذشر ذقثشفث شري ثيهف ذعسفخو حشلثس فخ حقخدهيث سفعيثرفس صهفا شييهفهخرشم ذخعقسث ذخرفثرف. بخق ثطشوحمث, غخع ذشر ذقثشفث حشلثس بخق فاث لقشيهرل حخمهذغ, ذخعقسث سمهيثس, شري ش ذخعقسث ذشمثريشق.

source: How do pages look to students in my course?
rtl: اخص يخ حشلثس مخخن فخ سفعيثرفس هر وغ ذخعقسث?

source: Students see the default and custom pages at the top of your course and use these links to navigate.
rtl: سفعيثرفس سثث فاث يثبشعمف شري ذعسفخو حشلثس شف فاث فخح خب غخعق ذخعقسث شري عسث فاثسث مهرنس فخ رشدهلشفث.

source: See an example
rtl: سثث شر ثطشوحمث

source: Pages in Your Course
rtl: حشلثس هر غخعق ذخعقسث

source: Preview of Pages in your course
rtl: حقثدهثص خب حشلثس هر غخعق ذخعقسث

source: Pages appear in your course's top navigation bar. The default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages.
rtl: حشلثس شححثشق هر غخعق ذخعقسث'س فخح رشدهلشفهخر زشق. فاث يثبشعمف حشلثس (اخوث, ذخعقسث, يهسذعسسهخر, صهنه, شري حقخلقثسس) شقث بخممخصثي زغ فثطفزخخنس شري ذعسفخو حشلثس.

source: close modal
rtl: ذمخسث وخيشم

source: Internal Server Error
rtl: هرفثقرشم سثقدثق ثققخق

source: The Page You Requested Page Cannot be Found
rtl: فاث حشلث غخع قثضعثسفثي حشلث ذشررخف زث بخعريcourse syllabus, and a course calendar.

source: How do custom pages look to students in my course?
rtl: Ħøʍ dø ɔnsʇøɯ dɐƃǝs løøʞ ʇø sʇndǝnʇs ᴉn ɯʎ ɔønɹsǝ?

source: Custom pages are listed horizontally at the top of your course after default pages.
rtl: Ȼnsʇøɯ dɐƃǝs ɐɹǝ lᴉsʇǝd ɥøɹᴉzønʇɐllʎ ɐʇ ʇɥǝ ʇød øɟ ʎønɹ ɔønɹsǝ ɐɟʇǝɹ dǝɟɐnlʇ dɐƃǝs.

source: Custom pages in your course
rtl: Ȼnsʇøɯ dɐƃǝs ᴉn ʎønɹ ɔønɹsǝ

source: Custom pages are listed horizontally at the top of your course after default pages and textbooks. In the above example, custom pages for "Course Schedule" and "Supplements" have been added to a course.
rtl: Ȼnsʇøɯ dɐƃǝs ɐɹǝ lᴉsʇǝd ɥøɹᴉzønʇɐllʎ ɐʇ ʇɥǝ ʇød øɟ ʎønɹ ɔønɹsǝ ɐɟʇǝɹ dǝɟɐnlʇ dɐƃǝs ɐnd ʇǝxʇbøøʞs. Ɨn ʇɥǝ ɐbøʌǝ ǝxɐɯdlǝ, ɔnsʇøɯ dɐƃǝs ɟøɹ "Ȼønɹsǝ Sɔɥǝdnlǝ" ɐnd "Snddlǝɯǝnʇs" ɥɐʌǝ bǝǝn ɐddǝd ʇø ɐ ɔønɹsǝ.

source: We're sorry. We couldn't find the {studio_name} page you're looking for. You may want to return to the {studio_name} Dashboard and try again.
rtl: صث'قث سخققغ. صث ذخعمير'ف بهري فاث {studio_name} حشلث غخع'قث مخخنهرل بخق. غخع وشغ صشرف فخ قثفعقر فخ فاث {studio_name} يشسازخشقي شري فقغ شلشهر.

source: The Server Encountered an Error
rtl: فاث سثقدثق ثرذخعرفثقثي شر ثققخقWǝ'ɹǝ søɹɹʎ. Wǝ ɔønldn'ʇ ɟᴉnd ʇɥǝ {studio_name} dɐƃǝ ʎøn'ɹǝ løøʞᴉnƃ ɟøɹ. Ɏøn ɯɐʎ ʍɐnʇ ʇø ɹǝʇnɹn ʇø ʇɥǝ {studio_name} Đɐsɥbøɐɹd ɐnd ʇɹʎ ɐƃɐᴉn.

source: We're sorry. There was a problem with the server while trying to process your last request. You may want to return to the {studio_name} Dashboard or try this request again.
rtl: صث'قث سخققغ. فاثقث صشس ش حقخزمثو صهفا فاث سثقدثق صاهمث فقغهرل فخ حقخذثسس غخعق مشسف قثضعثسف. غخع وشغ صشرف فخ قثفعقر فخ فاث {studio_name} يشسازخشقي خق فقغ فاهس قثضعثسف شلشهر.

source: Back to dashboard
rtl: زشذن فخ يشسازخشقي

source: Library Export
rtl: مهزقشقغ ثطحخقف

source: Course Export
rtl: ذخعقسث ثطحخقف

source: About Exporting Libraries
rtl: شزخعف ثطحخقفهرل مهزقشقهثسWǝ'ɹǝ søɹɹʎ. Ŧɥǝɹǝ ʍɐs ɐ dɹøblǝɯ ʍᴉʇɥ ʇɥǝ sǝɹʌǝɹ ʍɥᴉlǝ ʇɹʎᴉnƃ ʇø dɹøɔǝss ʎønɹ lɐsʇ ɹǝbnǝsʇ. Ɏøn ɯɐʎ ʍɐnʇ ʇø ɹǝʇnɹn ʇø ʇɥǝ {studio_name} Đɐsɥbøɐɹd øɹ ʇɹʎ ʇɥᴉs ɹǝbnǝsʇ ɐƃɐᴉn.

source: You can export libraries and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the library structure and content. You can also re-import libraries that you've exported.
rtl: غخع ذشر ثطحخقف مهزقشقهثس شري ثيهف فاثو خعفسهيث خب {studio_name}. فاث ثطحخقفثي بهمث هس ش .فشق.لظ بهمث (فاشف هس, ش .فشق بهمث ذخوحقثسسثي صهفا لرع ظهح) فاشف ذخرفشهرس فاث مهزقشقغ سفقعذفعقث شري ذخرفثرف. غخع ذشر شمسخ قث-هوحخقف مهزقشقهثس فاشف غخع'دث ثطحخقفثي.

source: About Exporting Courses
rtl: شزخعف ثطحخقفهرل ذخعقسثسɎøn ɔɐn ǝxdøɹʇ lᴉbɹɐɹᴉǝs ɐnd ǝdᴉʇ ʇɥǝɯ ønʇsᴉdǝ øɟ {studio_name}. Ŧɥǝ ǝxdøɹʇǝd ɟᴉlǝ ᴉs ɐ .ʇɐɹ.ƃz ɟᴉlǝ (ʇɥɐʇ ᴉs, ɐ .ʇɐɹ ɟᴉlǝ ɔøɯdɹǝssǝd ʍᴉʇɥ ǤNɄ Ƶᴉd) ʇɥɐʇ ɔønʇɐᴉns ʇɥǝ lᴉbɹɐɹʎ sʇɹnɔʇnɹǝ ɐnd ɔønʇǝnʇ. Ɏøn ɔɐn ɐlsø ɹǝ-ᴉɯdøɹʇ lᴉbɹɐɹᴉǝs ʇɥɐʇ ʎøn'ʌǝ ǝxdøɹʇǝd.

source: You can export courses and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the course structure and content. You can also re-import courses that you've exported.
rtl: غخع ذشر ثطحخقف ذخعقسثس شري ثيهف فاثو خعفسهيث خب {studio_name}. فاث ثطحخقفثي بهمث هس ش .فشق.لظ بهمث (فاشف هس, ش .فشق بهمث ذخوحقثسسثي صهفا لرع ظهح) فاشف ذخرفشهرس فاث ذخعقسث سفقعذفعقث شري ذخرفثرف. غخع ذشر شمسخ قث-هوحخقف ذخعقسثس فاشف غخع'دث ثطحخقفثي.Ɏøn ɔɐn ǝxdøɹʇ ɔønɹsǝs ɐnd ǝdᴉʇ ʇɥǝɯ ønʇsᴉdǝ øɟ {studio_name}. Ŧɥǝ ǝxdøɹʇǝd ɟᴉlǝ ᴉs ɐ .ʇɐɹ.ƃz ɟᴉlǝ (ʇɥɐʇ ᴉs, ɐ .ʇɐɹ ɟᴉlǝ ɔøɯdɹǝssǝd ʍᴉʇɥ ǤNɄ Ƶᴉd) ʇɥɐʇ ɔønʇɐᴉns ʇɥǝ ɔønɹsǝ sʇɹnɔʇnɹǝ ɐnd ɔønʇǝnʇ. Ɏøn ɔɐn ɐlsø ɹǝ-ᴉɯdøɹʇ ɔønɹsǝs ʇɥɐʇ ʎøn'ʌǝ ǝxdøɹʇǝd.

source: {em_start}Caution:{em_end} When you export a course, information such as MATLAB API keys, LTI passports, annotation secret token strings, and annotation storage URLs are included in the exported data. If you share your exported files, you may also be sharing sensitive or license-specific information.
rtl: {em_start}ذشعفهخر:{em_end} صاثر غخع ثطحخقف ش ذخعقسث, هربخقوشفهخر سعذا شس وشفمشز شحه نثغس, مفه حشسسحخقفس, شررخفشفهخر سثذقثف فخنثر سفقهرلس, شري شررخفشفهخر سفخقشلث عقمس شقث هرذمعيثي هر فاث ثطحخقفثي يشفش. هب غخع ساشقث غخعق ثطحخقفثي بهمثس, غخع وشغ شمسخ زث ساشقهرل سثرسهفهدث خق مهذثرسث-سحثذهبهذ هربخقوشفهخر.

source: Export My Library Content
rtl: ثطحخقف وغ مهزقشقغ ذخرفثرف

source: Export My Course Content
rtl: ثطحخقف وغ ذخعقسث ذخرفثرف

source: Export Library Content
rtl: ثطحخقف مهزقشقغ ذخرفثرف

source: Export Course Content
rtl: ثطحخقف ذخعقسث ذخرفثرف

source: Library Export Status
rtl: مهزقشقغ ثطحخقف سفشفعس

source: Course Export Status
rtl: ذخعقسث ثطحخقف سفشفعس

source: Preparing
rtl: حقثحشقهرل

source: Preparing to start the export
rtl: حقثحشقهرل فخ سفشقف فاث ثطحخقف

source: Exporting
rtl: ثطحخقفهرل{em_start}Ȼɐnʇᴉøn:{em_end} Wɥǝn ʎøn ǝxdøɹʇ ɐ ɔønɹsǝ, ᴉnɟøɹɯɐʇᴉøn snɔɥ ɐs MȺŦŁȺɃ ȺⱣƗ ʞǝʎs, ŁŦƗ dɐssdøɹʇs, ɐnnøʇɐʇᴉøn sǝɔɹǝʇ ʇøʞǝn sʇɹᴉnƃs, ɐnd ɐnnøʇɐʇᴉøn sʇøɹɐƃǝ ɄɌŁs ɐɹǝ ᴉnɔlndǝd ᴉn ʇɥǝ ǝxdøɹʇǝd dɐʇɐ. Ɨɟ ʎøn sɥɐɹǝ ʎønɹ ǝxdøɹʇǝd ɟᴉlǝs, ʎøn ɯɐʎ ɐlsø bǝ sɥɐɹᴉnƃ sǝnsᴉʇᴉʌǝ øɹ lᴉɔǝnsǝ-sdǝɔᴉɟᴉɔ ᴉnɟøɹɯɐʇᴉøn.

source: Creating the export data files (You can now leave this page safely, but avoid making drastic changes to content until this export is complete)
rtl: ذقثشفهرل فاث ثطحخقف يشفش بهمثس (غخع ذشر رخص مثشدث فاهس حشلث سشبثمغ, زعف شدخهي وشنهرل يقشسفهذ ذاشرلثس فخ ذخرفثرف عرفهم فاهس ثطحخقف هس ذخوحمثفث)

source: Compressing
rtl: ذخوحقثسسهرل

source: Compressing the exported data and preparing it for download
rtl: ذخوحقثسسهرل فاث ثطحخقفثي يشفش شري حقثحشقهرل هف بخق يخصرمخشي

source: Your exported library can now be downloaded
rtl: غخعق ثطحخقفثي مهزقشقغ ذشر رخص زث يخصرمخشيثي

source: Your exported course can now be downloaded
rtl: غخعق ثطحخقفثي ذخعقسث ذشر رخص زث يخصرمخشيثي

source: Download Exported Library
rtl: يخصرمخشي ثطحخقفثي مهزقشقغ

source: Download Exported Course
rtl: يخصرمخشي ثطحخقفثي ذخعقسث

source: Data {em_start}exported with{em_end} your course:
rtl: يشفش {em_start}ثطحخقفثي صهفا{em_end} غخعق ذخعقسث:Ȼɹǝɐʇᴉnƃ ʇɥǝ ǝxdøɹʇ dɐʇɐ ɟᴉlǝs (Ɏøn ɔɐn nøʍ lǝɐʌǝ ʇɥᴉs dɐƃǝ sɐɟǝlʎ, bnʇ ɐʌøᴉd ɯɐʞᴉnƃ dɹɐsʇᴉɔ ɔɥɐnƃǝs ʇø ɔønʇǝnʇ nnʇᴉl ʇɥᴉs ǝxdøɹʇ ᴉs ɔøɯdlǝʇǝ)

source: Values from Advanced Settings, including MATLAB API keys and LTI passports
rtl: دشمعثس بقخو شيدشرذثي سثففهرلس, هرذمعيهرل وشفمشز شحه نثغس شري مفه حشسسحخقفس

source: Course Content (all Sections, Sub-sections, and Units)
rtl: ذخعقسث ذخرفثرف (شمم سثذفهخرس, سعز-سثذفهخرس, شري عرهفس)

source: Course Structure
rtl: ذخعقسث سفقعذفعقث

source: Individual Problems
rtl: هريهدهيعشم حقخزمثوس

source: Course Assets
rtl: ذخعقسث شسسثفس

source: Course Settings
rtl: ذخعقسث سثففهرلس

source: Data {em_start}not exported{em_end} with your course:
rtl: يشفش {em_start}رخف ثطحخقفثي{em_end} صهفا غخعق ذخعقسث:

source: User Data
rtl: عسثق يشفش

source: Course Team Data
rtl: ذخعقسث فثشو يشفش

source: Forum/discussion Data
rtl: بخقعو/يهسذعسسهخر يشفش

source: Why export a library?
rtl: صاغ ثطحخقف ش مهزقشقغ?Vɐlnǝs ɟɹøɯ Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs, ᴉnɔlndᴉnƃ MȺŦŁȺɃ ȺⱣƗ ʞǝʎs ɐnd ŁŦƗ dɐssdøɹʇs

source: You may want to edit the XML in your library directly, outside of {studio_name}. You may want to create a backup copy of your library. Or, you may want to create a copy of your library that you can later import into another library instance and customize.
rtl: غخع وشغ صشرف فخ ثيهف فاث طوم هر غخعق مهزقشقغ يهقثذفمغ, خعفسهيث خب {studio_name}. غخع وشغ صشرف فخ ذقثشفث ش زشذنعح ذخحغ خب غخعق مهزقشقغ. خق, غخع وشغ صشرف فخ ذقثشفث ش ذخحغ خب غخعق مهزقشقغ فاشف غخع ذشر مشفثق هوحخقف هرفخ شرخفاثق مهزقشقغ هرسفشرذث شري ذعسفخوهظث.

source: Opening the downloaded file
rtl: خحثرهرل فاث يخصرمخشيثي بهمثɎøn ɯɐʎ ʍɐnʇ ʇø ǝdᴉʇ ʇɥǝ XMŁ ᴉn ʎønɹ lᴉbɹɐɹʎ dᴉɹǝɔʇlʎ, ønʇsᴉdǝ øɟ {studio_name}. Ɏøn ɯɐʎ ʍɐnʇ ʇø ɔɹǝɐʇǝ ɐ bɐɔʞnd ɔødʎ øɟ ʎønɹ lᴉbɹɐɹʎ. Øɹ, ʎøn ɯɐʎ ʍɐnʇ ʇø ɔɹǝɐʇǝ ɐ ɔødʎ øɟ ʎønɹ lᴉbɹɐɹʎ ʇɥɐʇ ʎøn ɔɐn lɐʇǝɹ ᴉɯdøɹʇ ᴉnʇø ɐnøʇɥǝɹ lᴉbɹɐɹʎ ᴉnsʇɐnɔǝ ɐnd ɔnsʇøɯᴉzǝ.

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the library.xml file, as well as subfolders that contain library content.
rtl: عسث شر شقذاهدث حقخلقشو فخ ثطفقشذف فاث يشفش بقخو فاث .فشق.لظ بهمث. ثطفقشذفثي يشفش هرذمعيثس فاث مهزقشقغ.طوم بهمث, شس صثمم شس سعزبخميثقس فاشف ذخرفشهر مهزقشقغ ذخرفثرف.

source: Learn more about exporting a library
rtl: مثشقر وخقث شزخعف ثطحخقفهرل ش مهزقشقغ

source: Why export a course?
rtl: صاغ ثطحخقف ش ذخعقسث?Ʉsǝ ɐn ɐɹɔɥᴉʌǝ dɹøƃɹɐɯ ʇø ǝxʇɹɐɔʇ ʇɥǝ dɐʇɐ ɟɹøɯ ʇɥǝ .ʇɐɹ.ƃz ɟᴉlǝ. Ɇxʇɹɐɔʇǝd dɐʇɐ ᴉnɔlndǝs ʇɥǝ lᴉbɹɐɹʎ.xɯl ɟᴉlǝ, ɐs ʍǝll ɐs snbɟøldǝɹs ʇɥɐʇ ɔønʇɐᴉn lᴉbɹɐɹʎ ɔønʇǝnʇ.

source: You may want to edit the XML in your course directly, outside of {studio_name}. You may want to create a backup copy of your course. Or, you may want to create a copy of your course that you can later import into another course instance and customize.
rtl: غخع وشغ صشرف فخ ثيهف فاث طوم هر غخعق ذخعقسث يهقثذفمغ, خعفسهيث خب {studio_name}. غخع وشغ صشرف فخ ذقثشفث ش زشذنعح ذخحغ خب غخعق ذخعقسث. خق, غخع وشغ صشرف فخ ذقثشفث ش ذخحغ خب غخعق ذخعقسث فاشف غخع ذشر مشفثق هوحخقف هرفخ شرخفاثق ذخعقسث هرسفشرذث شري ذعسفخوهظث.

source: What content is exported?
rtl: صاشف ذخرفثرف هس ثطحخقفثي?

source: The following content is exported.
rtl: فاث بخممخصهرل ذخرفثرف هس ثطحخقفثي.

source: Course content and structure
rtl: ذخعقسث ذخرفثرف شري سفقعذفعقث

source: Course dates
rtl: ذخعقسث يشفثس

source: Grading policy
rtl: لقشيهرل حخمهذغ

source: Any group configurations
rtl: شرغ لقخعح ذخربهلعقشفهخرسɎøn ɯɐʎ ʍɐnʇ ʇø ǝdᴉʇ ʇɥǝ XMŁ ᴉn ʎønɹ ɔønɹsǝ dᴉɹǝɔʇlʎ, ønʇsᴉdǝ øɟ {studio_name}. Ɏøn ɯɐʎ ʍɐnʇ ʇø ɔɹǝɐʇǝ ɐ bɐɔʞnd ɔødʎ øɟ ʎønɹ ɔønɹsǝ. Øɹ, ʎøn ɯɐʎ ʍɐnʇ ʇø ɔɹǝɐʇǝ ɐ ɔødʎ øɟ ʎønɹ ɔønɹsǝ ʇɥɐʇ ʎøn ɔɐn lɐʇǝɹ ᴉɯdøɹʇ ᴉnʇø ɐnøʇɥǝɹ ɔønɹsǝ ᴉnsʇɐnɔǝ ɐnd ɔnsʇøɯᴉzǝ.

source: Settings on the Advanced Settings page, including MATLAB API keys and LTI passports
rtl: سثففهرلس خر فاث شيدشرذثي سثففهرلس حشلث, هرذمعيهرل وشفمشز شحه نثغس شري مفه حشسسحخقفس

source: The following content is not exported.
rtl: فاث بخممخصهرل ذخرفثرف هس رخف ثطحخقفثي.Sǝʇʇᴉnƃs øn ʇɥǝ Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs dɐƃǝ, ᴉnɔlndᴉnƃ MȺŦŁȺɃ ȺⱣƗ ʞǝʎs ɐnd ŁŦƗ dɐssdøɹʇs

source: Learner-specific content, such as learner grades and discussion forum data
rtl: مثشقرثق-سحثذهبهذ ذخرفثرف, سعذا شس مثشقرثق لقشيثس شري يهسذعسسهخر بخقعو يشفش

source: The course team
rtl: فاث ذخعقسث فثشوŁǝɐɹnǝɹ-sdǝɔᴉɟᴉɔ ɔønʇǝnʇ, snɔɥ ɐs lǝɐɹnǝɹ ƃɹɐdǝs ɐnd dᴉsɔnssᴉøn ɟøɹnɯ dɐʇɐ

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the course.xml file, as well as subfolders that contain course content.
rtl: عسث شر شقذاهدث حقخلقشو فخ ثطفقشذف فاث يشفش بقخو فاث .فشق.لظ بهمث. ثطفقشذفثي يشفش هرذمعيثس فاث ذخعقسث.طوم بهمث, شس صثمم شس سعزبخميثقس فاشف ذخرفشهر ذخعقسث ذخرفثرف.

source: Learn more about exporting a course
rtl: مثشقر وخقث شزخعف ثطحخقفهرل ش ذخعقسث

source: Export Course to Git
rtl: ثطحخقف ذخعقسث فخ لهف

source: Export to Git
rtl: ثطحخقف فخ لهف

source: About Export to Git
rtl: شزخعف ثطحخقف فخ لهف

source: Use this to export your course to its git repository.
rtl: عسث فاهس فخ ثطحخقف غخعق ذخعقسث فخ هفس لهف قثحخسهفخقغ.Ʉsǝ ɐn ɐɹɔɥᴉʌǝ dɹøƃɹɐɯ ʇø ǝxʇɹɐɔʇ ʇɥǝ dɐʇɐ ɟɹøɯ ʇɥǝ .ʇɐɹ.ƃz ɟᴉlǝ. Ɇxʇɹɐɔʇǝd dɐʇɐ ᴉnɔlndǝs ʇɥǝ ɔønɹsǝ.xɯl ɟᴉlǝ, ɐs ʍǝll ɐs snbɟøldǝɹs ʇɥɐʇ ɔønʇɐᴉn ɔønɹsǝ ɔønʇǝnʇ.
