Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: You will not get notification for emails that bounce, so please double-check spelling.
rtl: غخع صهمم رخف لثف رخفهبهذشفهخر بخق ثوشهمس فاشف زخعرذث, سخ حمثشسث يخعزمث-ذاثذن سحثممهرل.Ɏøn ʍᴉll nøʇ ƃǝʇ nøʇᴉɟᴉɔɐʇᴉøn ɟøɹ ǝɯɐᴉls ʇɥɐʇ bønnɔǝ, sø dlǝɐsǝ dønblǝ-ɔɥǝɔʞ sdǝllᴉnƃ.

source: Enter the reason why the students are to be manually enrolled or unenrolled.
rtl: ثرفثق فاث قثشسخر صاغ فاث سفعيثرفس شقث فخ زث وشرعشممغ ثرقخممثي خق عرثرقخممثي.Ɇnʇǝɹ ʇɥǝ ɹǝɐsøn ʍɥʎ ʇɥǝ sʇndǝnʇs ɐɹǝ ʇø bǝ ɯɐnnɐllʎ ǝnɹøllǝd øɹ nnǝnɹøllǝd.

source: This cannot be left blank and will be recorded and presented in Enrollment Reports.
rtl: فاهس ذشررخف زث مثبف زمشرن شري صهمم زث قثذخقيثي شري حقثسثرفثي هر ثرقخمموثرف قثحخقفس.

source: Therefore, please give enough detail to account for this action.
rtl: فاثقثبخقث, حمثشسث لهدث ثرخعلا يثفشهم فخ شذذخعرف بخق فاهس شذفهخر.Ŧɥᴉs ɔɐnnøʇ bǝ lǝɟʇ blɐnʞ ɐnd ʍᴉll bǝ ɹǝɔøɹdǝd ɐnd dɹǝsǝnʇǝd ᴉn Ɇnɹøllɯǝnʇ Ɍǝdøɹʇs.

source: Reason
rtl: قثشسخر

source: Register/Enroll Students
rtl: قثلهسفثق/ثرقخمم سفعيثرفس

source: To register and enroll a list of users in this course, choose a CSV file that contains the following columns in this exact order: email, username, name, and country. Please include one student per row and do not include any headers, footers, or blank lines.
rtl: فخ قثلهسفثق شري ثرقخمم ش مهسف خب عسثقس هر فاهس ذخعقسث, ذاخخسث ش ذسد بهمث فاشف ذخرفشهرس فاث بخممخصهرل ذخمعورس هر فاهس ثطشذف خقيثق: ثوشهم, عسثقرشوث, رشوث, شري ذخعرفقغ. حمثشسث هرذمعيث خرث سفعيثرف حثق قخص شري يخ رخف هرذمعيث شرغ اثشيثقس, بخخفثقس, خق زمشرن مهرثس.

source: Upload a CSV for bulk enrollment
rtl: عحمخشي ش ذسد بخق زعمن ثرقخمموثرف

source: Upload CSV
rtl: عحمخشي ذسد

source: Batch Beta Tester Addition
rtl: زشفذا زثفش فثسفثق شييهفهخر headers, footers, or blank lines. Optionally, extra columns can be provided: cohort and course mode, in that order. These extra columns may be blank.

source: Note: Users must have an activated {platform_name} account before they can be enrolled as beta testers.
rtl: رخفث: عسثقس وعسف اشدث شر شذفهدشفثي {platform_name} شذذخعرف زثبخقث فاثغ ذشر زث ثرقخممثي شس زثفش فثسفثقس.Nøʇǝ: Ʉsǝɹs ɯnsʇ ɥɐʌǝ ɐn ɐɔʇᴉʌɐʇǝd {platform_name} ɐɔɔønnʇ bǝɟøɹǝ ʇɥǝʎ ɔɐn bǝ ǝnɹøllǝd ɐs bǝʇɐ ʇǝsʇǝɹs.

source: If this option is {em_start}checked{em_end}, users who have not enrolled in your course will be automatically enrolled.
rtl: هب فاهس خحفهخر هس {em_start}ذاثذنثي{em_end}, عسثقس صاخ اشدث رخف ثرقخممثي هر غخعق ذخعقسث صهمم زث شعفخوشفهذشممغ ثرقخممثي.

source: Checking this box has no effect if 'Remove beta testers' is selected.
rtl: ذاثذنهرل فاهس زخط اشس رخ ثببثذف هب 'قثوخدث زثفش فثسفثقس' هس سثمثذفثي.

source: Add beta testers
rtl: شيي زثفش فثسفثقس

source: Remove beta testers
rtl: قثوخدث زثفش فثسفثقسƗɟ ʇɥᴉs ødʇᴉøn ᴉs {em_start}ɔɥǝɔʞǝd{em_end}, nsǝɹs ʍɥø ɥɐʌǝ nøʇ ǝnɹøllǝd ᴉn ʎønɹ ɔønɹsǝ ʍᴉll bǝ ɐnʇøɯɐʇᴉɔɐllʎ ǝnɹøllǝd.

source: Course Team Management
rtl: ذخعقسث فثشو وشرشلثوثرف

source: Select a course team role:
rtl: سثمثذف ش ذخعقسث فثشو قخمث:

source: Getting available lists...
rtl: لثففهرل شدشهمشزمث مهسفس...

source: Staff cannot modify these lists. To manage course team membership, a course Admin must give you the Admin role to add Staff or Beta Testers, or the Discussion Admin role to add discussion moderators and TAs.
rtl: سفشبب ذشررخف وخيهبغ فاثسث مهسفس. فخ وشرشلث ذخعقسث فثشو وثوزثقساهح, ش ذخعقسث شيوهر وعسف لهدث غخع فاث شيوهر قخمث فخ شيي سفشبب خق زثفش فثسفثقس, خق فاث يهسذعسسهخر شيوهر قخمث فخ شيي يهسذعسسهخر وخيثقشفخقس شري فشس.Sʇɐɟɟ ɔɐnnøʇ ɯødᴉɟʎ ʇɥǝsǝ lᴉsʇs. Ŧø ɯɐnɐƃǝ ɔønɹsǝ ʇǝɐɯ ɯǝɯbǝɹsɥᴉd, ɐ ɔønɹsǝ Ⱥdɯᴉn ɯnsʇ ƃᴉʌǝ ʎøn ʇɥǝ Ⱥdɯᴉn ɹølǝ ʇø ɐdd Sʇɐɟɟ øɹ Ƀǝʇɐ Ŧǝsʇǝɹs, øɹ ʇɥǝ Đᴉsɔnssᴉøn Ⱥdɯᴉn ɹølǝ ʇø ɐdd dᴉsɔnssᴉøn ɯødǝɹɐʇøɹs ɐnd ŦȺs.

source: Course team members with the Staff role help you manage your course. Staff can enroll and unenroll learners, as well as modify their grades and access all course data. Staff also have access to your course in Studio and Insights. You can only give course team roles to enrolled users.
rtl: ذخعقسث فثشو وثوزثقس صهفا فاث سفشبب قخمث اثمح غخع وشرشلث غخعق ذخعقسث. سفشبب ذشر ثرقخمم شري عرثرقخمم مثشقرثقس, شس صثمم شس وخيهبغ فاثهق لقشيثس شري شذذثسس شمم ذخعقسث يشفش. سفشبب شمسخ اشدث شذذثسس فخ غخعق ذخعقسث هر سفعيهخ شري هرسهلافس. غخع ذشر خرمغ لهدث ذخعقسث فثشو قخمثس فخ ثرقخممثي عسثقس.

source: Add Staff
rtl: شيي سفشبب

source: Admin
rtl: شيوهرȻønɹsǝ ʇǝɐɯ ɯǝɯbǝɹs ʍᴉʇɥ ʇɥǝ Sʇɐɟɟ ɹølǝ ɥǝld ʎøn ɯɐnɐƃǝ ʎønɹ ɔønɹsǝ. Sʇɐɟɟ ɔɐn ǝnɹøll ɐnd nnǝnɹøll lǝɐɹnǝɹs, ɐs ʍǝll ɐs ɯødᴉɟʎ ʇɥǝᴉɹ ƃɹɐdǝs ɐnd ɐɔɔǝss ɐll ɔønɹsǝ dɐʇɐ. Sʇɐɟɟ ɐlsø ɥɐʌǝ ɐɔɔǝss ʇø ʎønɹ ɔønɹsǝ ᴉn Sʇndᴉø ɐnd Ɨnsᴉƃɥʇs. Ɏøn ɔɐn ønlʎ ƃᴉʌǝ ɔønɹsǝ ʇǝɐɯ ɹølǝs ʇø ǝnɹøllǝd nsǝɹs.

source: Course team members with the Admin role help you manage your course. They can do all of the tasks that Staff can do, and can also add and remove the Staff and Admin roles, discussion moderation roles, and the beta tester role to manage course team membership. You can only give course team roles to enrolled users.
rtl: ذخعقسث فثشو وثوزثقس صهفا فاث شيوهر قخمث اثمح غخع وشرشلث غخعق ذخعقسث. فاثغ ذشر يخ شمم خب فاث فشسنس فاشف سفشبب ذشر يخ, شري ذشر شمسخ شيي شري قثوخدث فاث سفشبب شري شيوهر قخمثس, يهسذعسسهخر وخيثقشفهخر قخمثس, شري فاث زثفش فثسفثق قخمث فخ وشرشلث ذخعقسث فثشو وثوزثقساهح. غخع ذشر خرمغ لهدث ذخعقسث فثشو قخمثس فخ ثرقخممثي عسثقس.

source: Add Admin
rtl: شيي شيوهر

source: Beta Testers
rtl: زثفش فثسفثقسȻønɹsǝ ʇǝɐɯ ɯǝɯbǝɹs ʍᴉʇɥ ʇɥǝ Ⱥdɯᴉn ɹølǝ ɥǝld ʎøn ɯɐnɐƃǝ ʎønɹ ɔønɹsǝ. Ŧɥǝʎ ɔɐn dø ɐll øɟ ʇɥǝ ʇɐsʞs ʇɥɐʇ Sʇɐɟɟ ɔɐn dø, ɐnd ɔɐn ɐlsø ɐdd ɐnd ɹǝɯøʌǝ ʇɥǝ Sʇɐɟɟ ɐnd Ⱥdɯᴉn ɹølǝs, dᴉsɔnssᴉøn ɯødǝɹɐʇᴉøn ɹølǝs, ɐnd ʇɥǝ bǝʇɐ ʇǝsʇǝɹ ɹølǝ ʇø ɯɐnɐƃǝ ɔønɹsǝ ʇǝɐɯ ɯǝɯbǝɹsɥᴉd. Ɏøn ɔɐn ønlʎ ƃᴉʌǝ ɔønɹsǝ ʇǝɐɯ ɹølǝs ʇø ǝnɹøllǝd nsǝɹs.

source: Beta Testers can see course content before other learners. They can make sure that the content works, but have no additional privileges. You can only give course team roles to enrolled users.
rtl: زثفش فثسفثقس ذشر سثث ذخعقسث ذخرفثرف زثبخقث خفاثق مثشقرثقس. فاثغ ذشر وشنث سعقث فاشف فاث ذخرفثرف صخقنس, زعف اشدث رخ شييهفهخرشم حقهدهمثلثس. غخع ذشر خرمغ لهدث ذخعقسث فثشو قخمثس فخ ثرقخممثي عسثقس.

source: Add Beta Tester
rtl: شيي زثفش فثسفثق

source: Discussion Admins
rtl: يهسذعسسهخر شيوهرسɃǝʇɐ Ŧǝsʇǝɹs ɔɐn sǝǝ ɔønɹsǝ ɔønʇǝnʇ bǝɟøɹǝ øʇɥǝɹ lǝɐɹnǝɹs. Ŧɥǝʎ ɔɐn ɯɐʞǝ snɹǝ ʇɥɐʇ ʇɥǝ ɔønʇǝnʇ ʍøɹʞs, bnʇ ɥɐʌǝ nø ɐddᴉʇᴉønɐl dɹᴉʌᴉlǝƃǝs. Ɏøn ɔɐn ønlʎ ƃᴉʌǝ ɔønɹsǝ ʇǝɐɯ ɹølǝs ʇø ǝnɹøllǝd nsǝɹs.

source: Discussion Admins can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all groups. Their posts are marked as 'staff'. They can also add and remove the discussion moderation roles to manage course team membership. Only enrolled users can be added as Discussion Admins.
rtl: يهسذعسسهخر شيوهرس ذشر ثيهف خق يثمثفث شرغ حخسف, ذمثشق وهسعسث بمشلس, ذمخسث شري قث-خحثر فاقثشيس, ثريخقسث قثسحخرسثس, شري سثث حخسفس بقخو شمم لقخعحس. فاثهق حخسفس شقث وشقنثي شس 'سفشبب'. فاثغ ذشر شمسخ شيي شري قثوخدث فاث يهسذعسسهخر وخيثقشفهخر قخمثس فخ وشرشلث ذخعقسث فثشو وثوزثقساهح. خرمغ ثرقخممثي عسثقس ذشر زث شييثي شس يهسذعسسهخر شيوهرس.

source: Add Discussion Admin
rtl: شيي يهسذعسسهخر شيوهر

source: Course Data Researcher
rtl: ذخعقسث يشفش قثسثشقذاثق

source: Course Data Researchers can access the data download tab.
rtl: ذخعقسث يشفش قثسثشقذاثقس ذشر شذذثسس فاث يشفش يخصرمخشي فشز.

source: Add Course Data Researcher
rtl: شيي ذخعقسث يشفش قثسثشقذاثق

source: Discussion Moderators
rtl: يهسذعسسهخر وخيثقشفخقسĐᴉsɔnssᴉøn Ⱥdɯᴉns ɔɐn ǝdᴉʇ øɹ dǝlǝʇǝ ɐnʎ døsʇ, ɔlǝɐɹ ɯᴉsnsǝ ɟlɐƃs, ɔløsǝ ɐnd ɹǝ-ødǝn ʇɥɹǝɐds, ǝndøɹsǝ ɹǝsdønsǝs, ɐnd sǝǝ døsʇs ɟɹøɯ ɐll ƃɹønds. Ŧɥǝᴉɹ døsʇs ɐɹǝ ɯɐɹʞǝd ɐs 'sʇɐɟɟ'. Ŧɥǝʎ ɔɐn ɐlsø ɐdd ɐnd ɹǝɯøʌǝ ʇɥǝ dᴉsɔnssᴉøn ɯødǝɹɐʇᴉøn ɹølǝs ʇø ɯɐnɐƃǝ ɔønɹsǝ ʇǝɐɯ ɯǝɯbǝɹsɥᴉd. Ønlʎ ǝnɹøllǝd nsǝɹs ɔɐn bǝ ɐddǝd ɐs Đᴉsɔnssᴉøn Ⱥdɯᴉns.

source: Discussion Moderators can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all groups. Their posts are marked as 'staff'. They cannot manage course team membership by adding or removing discussion moderation roles. Only enrolled users can be added as Discussion Moderators.
rtl: يهسذعسسهخر وخيثقشفخقس ذشر ثيهف خق يثمثفث شرغ حخسف, ذمثشق وهسعسث بمشلس, ذمخسث شري قث-خحثر فاقثشيس, ثريخقسث قثسحخرسثس, شري سثث حخسفس بقخو شمم لقخعحس. فاثهق حخسفس شقث وشقنثي شس 'سفشبب'. فاثغ ذشررخف وشرشلث ذخعقسث فثشو وثوزثقساهح زغ شييهرل خق قثوخدهرل يهسذعسسهخر وخيثقشفهخر قخمثس. خرمغ ثرقخممثي عسثقس ذشر زث شييثي شس يهسذعسسهخر وخيثقشفخقس.

source: Add Moderator
rtl: شيي وخيثقشفخق

source: Group Community TA
rtl: لقخعح ذخووعرهفغ فشĐᴉsɔnssᴉøn Mødǝɹɐʇøɹs ɔɐn ǝdᴉʇ øɹ dǝlǝʇǝ ɐnʎ døsʇ, ɔlǝɐɹ ɯᴉsnsǝ ɟlɐƃs, ɔløsǝ ɐnd ɹǝ-ødǝn ʇɥɹǝɐds, ǝndøɹsǝ ɹǝsdønsǝs, ɐnd sǝǝ døsʇs ɟɹøɯ ɐll ƃɹønds. Ŧɥǝᴉɹ døsʇs ɐɹǝ ɯɐɹʞǝd ɐs 'sʇɐɟɟ'. Ŧɥǝʎ ɔɐnnøʇ ɯɐnɐƃǝ ɔønɹsǝ ʇǝɐɯ ɯǝɯbǝɹsɥᴉd bʎ ɐddᴉnƃ øɹ ɹǝɯøʌᴉnƃ dᴉsɔnssᴉøn ɯødǝɹɐʇᴉøn ɹølǝs. Ønlʎ ǝnɹøllǝd nsǝɹs ɔɐn bǝ ɐddǝd ɐs Đᴉsɔnssᴉøn Mødǝɹɐʇøɹs.

source: Group Community TAs are members of the community who help course teams moderate discussions. Group Community TAs see only posts by learners in their assigned group. They can edit or delete posts, clear flags, close and re-open threads, and endorse responses, but only for posts by learners in their group. Their posts are marked as 'Community TA'. Only enrolled learners can be added as Group Community TAs.
rtl: لقخعح ذخووعرهفغ فشس شقث وثوزثقس خب فاث ذخووعرهفغ صاخ اثمح ذخعقسث فثشوس وخيثقشفث يهسذعسسهخرس. لقخعح ذخووعرهفغ فشس سثث خرمغ حخسفس زغ مثشقرثقس هر فاثهق شسسهلرثي لقخعح. فاثغ ذشر ثيهف خق يثمثفث حخسفس, ذمثشق بمشلس, ذمخسث شري قث-خحثر فاقثشيس, شري ثريخقسث قثسحخرسثس, زعف خرمغ بخق حخسفس زغ مثشقرثقس هر فاثهق لقخعح. فاثهق حخسفس شقث وشقنثي شس 'ذخووعرهفغ فش'. خرمغ ثرقخممثي مثشقرثقس ذشر زث شييثي شس لقخعح ذخووعرهفغ فشس.

source: Add Group Community TA
rtl: شيي لقخعح ذخووعرهفغ فشǤɹønd Ȼøɯɯnnᴉʇʎ ŦȺs ɐɹǝ ɯǝɯbǝɹs øɟ ʇɥǝ ɔøɯɯnnᴉʇʎ ʍɥø ɥǝld ɔønɹsǝ ʇǝɐɯs ɯødǝɹɐʇǝ dᴉsɔnssᴉøns. Ǥɹønd Ȼøɯɯnnᴉʇʎ ŦȺs sǝǝ ønlʎ døsʇs bʎ lǝɐɹnǝɹs ᴉn ʇɥǝᴉɹ ɐssᴉƃnǝd ƃɹønd. Ŧɥǝʎ ɔɐn ǝdᴉʇ øɹ dǝlǝʇǝ døsʇs, ɔlǝɐɹ ɟlɐƃs, ɔløsǝ ɐnd ɹǝ-ødǝn ʇɥɹǝɐds, ɐnd ǝndøɹsǝ ɹǝsdønsǝs, bnʇ ønlʎ ɟøɹ døsʇs bʎ lǝɐɹnǝɹs ᴉn ʇɥǝᴉɹ ƃɹønd. Ŧɥǝᴉɹ døsʇs ɐɹǝ ɯɐɹʞǝd ɐs 'Ȼøɯɯnnᴉʇʎ ŦȺ'. Ønlʎ ǝnɹøllǝd lǝɐɹnǝɹs ɔɐn bǝ ɐddǝd ɐs Ǥɹønd Ȼøɯɯnnᴉʇʎ ŦȺs.

source: Community TAs are members of the community who help course teams moderate discussions. They can see posts by learners in their assigned cohort or enrollment track, and can edit or delete posts, clear flags, close or re-open threads, and endorse responses. Their posts are marked as 'Community TA'. Only enrolled learners can be added as Community TAs.
rtl: ذخووعرهفغ فشس شقث وثوزثقس خب فاث ذخووعرهفغ صاخ اثمح ذخعقسث فثشوس وخيثقشفث يهسذعسسهخرس. فاثغ ذشر سثث حخسفس زغ مثشقرثقس هر فاثهق شسسهلرثي ذخاخقف خق ثرقخمموثرف فقشذن, شري ذشر ثيهف خق يثمثفث حخسفس, ذمثشق بمشلس, ذمخسث خق قث-خحثر فاقثشيس, شري ثريخقسث قثسحخرسثس. فاثهق حخسفس شقث وشقنثي شس 'ذخووعرهفغ فش'. خرمغ ثرقخممثي مثشقرثقس ذشر زث شييثي شس ذخووعرهفغ فشس.

source: Add Community TA
rtl: شيي ذخووعرهفغ فش

source: CCX Coaches
rtl: ذذط ذخشذاثسȻøɯɯnnᴉʇʎ ŦȺs ɐɹǝ ɯǝɯbǝɹs øɟ ʇɥǝ ɔøɯɯnnᴉʇʎ ʍɥø ɥǝld ɔønɹsǝ ʇǝɐɯs ɯødǝɹɐʇǝ dᴉsɔnssᴉøns. Ŧɥǝʎ ɔɐn sǝǝ døsʇs bʎ lǝɐɹnǝɹs ᴉn ʇɥǝᴉɹ ɐssᴉƃnǝd ɔøɥøɹʇ øɹ ǝnɹøllɯǝnʇ ʇɹɐɔʞ, ɐnd ɔɐn ǝdᴉʇ øɹ dǝlǝʇǝ døsʇs, ɔlǝɐɹ ɟlɐƃs, ɔløsǝ øɹ ɹǝ-ødǝn ʇɥɹǝɐds, ɐnd ǝndøɹsǝ ɹǝsdønsǝs. Ŧɥǝᴉɹ døsʇs ɐɹǝ ɯɐɹʞǝd ɐs 'Ȼøɯɯnnᴉʇʎ ŦȺ'. Ønlʎ ǝnɹøllǝd lǝɐɹnǝɹs ɔɐn bǝ ɐddǝd ɐs Ȼøɯɯnnᴉʇʎ ŦȺs.

source: CCX Coaches are able to create their own Custom Courses based on this course, which they can use to provide personalized instruction to their own students based in this course material.
rtl: ذذط ذخشذاثس شقث شزمث فخ ذقثشفث فاثهق خصر ذعسفخو ذخعقسثس زشسثي خر فاهس ذخعقسث, صاهذا فاثغ ذشر عسث فخ حقخدهيث حثقسخرشمهظثي هرسفقعذفهخر فخ فاثهق خصر سفعيثرفس زشسثي هر فاهس ذخعقسث وشفثقهشم.

source: Add CCX Coach
rtl: شيي ذذط ذخشذا

source: Send to:
rtl: سثري فخ:

source: Myself
rtl: وغسثمب

source: Staff and Administrators
rtl: سفشبب شري شيوهرهسفقشفخقس

source: All Learners
rtl: شمم مثشقرثقس

source: Cohort:
rtl: ذخاخقف:

source: (Learners not explicitly assigned to a cohort)
rtl: (مثشقرثقس رخف ثطحمهذهفمغ شسسهلرثي فخ ش ذخاخقف)

source: Learners in the {track_name} Track
rtl: مثشقرثقس هر فاث {track_name} فقشذن

source: Subject:
rtl: سعزتثذف:

source: (Maximum 128 characters)
rtl: (وشطهوعو 128 ذاشقشذفثقس)

source: Message:
rtl: وثسسشلث:ȻȻX Ȼøɐɔɥǝs ɐɹǝ ɐblǝ ʇø ɔɹǝɐʇǝ ʇɥǝᴉɹ øʍn Ȼnsʇøɯ Ȼønɹsǝs bɐsǝd øn ʇɥᴉs ɔønɹsǝ, ʍɥᴉɔɥ ʇɥǝʎ ɔɐn nsǝ ʇø dɹøʌᴉdǝ dǝɹsønɐlᴉzǝd ᴉnsʇɹnɔʇᴉøn ʇø ʇɥǝᴉɹ øʍn sʇndǝnʇs bɐsǝd ᴉn ʇɥᴉs ɔønɹsǝ ɯɐʇǝɹᴉɐl.

source: To use the email tool, visit the
rtl: Ŧø nsǝ ʇɥǝ ǝɯɐᴉl ʇøøl, ʌᴉsᴉʇ ʇɥǝ

source: new experience
rtl: nǝʍ ǝxdǝɹᴉǝnɔǝ

source: We recommend sending learners no more than one email message per week. Before you send your email, review the text carefully and send it to yourself first, so that you can preview the formatting and make sure embedded images and links work correctly.
rtl: صث قثذخووثري سثريهرل مثشقرثقس رخ وخقث فاشر خرث ثوشهم وثسسشلث حثق صثثن. زثبخقث غخع سثري غخعق ثوشهم, قثدهثص فاث فثطف ذشقثبعممغ شري سثري هف فخ غخعقسثمب بهقسف, سخ فاشف غخع ذشر حقثدهثص فاث بخقوشففهرل شري وشنث سعقث ثوزثييثي هوشلثس شري مهرنس صخقن ذخققثذفمغ.

source: CAUTION!
rtl: ذشعفهخر!Wǝ ɹǝɔøɯɯǝnd sǝndᴉnƃ lǝɐɹnǝɹs nø ɯøɹǝ ʇɥɐn ønǝ ǝɯɐᴉl ɯǝssɐƃǝ dǝɹ ʍǝǝʞ. Ƀǝɟøɹǝ ʎøn sǝnd ʎønɹ ǝɯɐᴉl, ɹǝʌᴉǝʍ ʇɥǝ ʇǝxʇ ɔɐɹǝɟnllʎ ɐnd sǝnd ᴉʇ ʇø ʎønɹsǝlɟ ɟᴉɹsʇ, sø ʇɥɐʇ ʎøn ɔɐn dɹǝʌᴉǝʍ ʇɥǝ ɟøɹɯɐʇʇᴉnƃ ɐnd ɯɐʞǝ snɹǝ ǝɯbǝddǝd ᴉɯɐƃǝs ɐnd lᴉnʞs ʍøɹʞ ɔøɹɹǝɔʇlʎ.

source: When you select Send Email, your email message is added to the queue for sending, and cannot be cancelled.
rtl: صاثر غخع سثمثذف سثري ثوشهم, غخعق ثوشهم وثسسشلث هس شييثي فخ فاث ضعثعث بخق سثريهرل, شري ذشررخف زث ذشرذثممثي.

source: Send Email
rtl: سثري ثوشهمWɥǝn ʎøn sǝlǝɔʇ Sǝnd Ɇɯɐᴉl, ʎønɹ ǝɯɐᴉl ɯǝssɐƃǝ ᴉs ɐddǝd ʇø ʇɥǝ bnǝnǝ ɟøɹ sǝndᴉnƃ, ɐnd ɔɐnnøʇ bǝ ɔɐnɔǝllǝd.

source: Email actions run in the background. The status for any active tasks - including email tasks - appears in a table below.
rtl: ثوشهم شذفهخرس قعر هر فاث زشذنلقخعري. فاث سفشفعس بخق شرغ شذفهدث فشسنس - هرذمعيهرل ثوشهم فشسنس - شححثشقس هر ش فشزمث زثمخص.

source: Email Task History
rtl: ثوشهم فشسن اهسفخقغ

source: To see the content of previously sent emails, click this button:
rtl: فخ سثث فاث ذخرفثرف خب حقثدهخعسمغ سثرف ثوشهمس, ذمهذن فاهس زعففخر:

source: Show Sent Email History
rtl: ساخص سثرف ثوشهم اهسفخقغ

source: To read a sent email message, click its subject.
rtl: فخ قثشي ش سثرف ثوشهم وثسسشلث, ذمهذن هفس سعزتثذف.Ɇɯɐᴉl ɐɔʇᴉøns ɹnn ᴉn ʇɥǝ bɐɔʞƃɹønnd. Ŧɥǝ sʇɐʇns ɟøɹ ɐnʎ ɐɔʇᴉʌǝ ʇɐsʞs - ᴉnɔlndᴉnƃ ǝɯɐᴉl ʇɐsʞs - ɐddǝɐɹs ᴉn ɐ ʇɐblǝ bǝløʍ.

source: To see the status for all email tasks submitted for this course, click this button:
rtl: فخ سثث فاث سفشفعس بخق شمم ثوشهم فشسنس سعزوهففثي بخق فاهس ذخعقسث, ذمهذن فاهس زعففخر:

source: Show Email Task History
rtl: ساخص ثوشهم فشسن اهسفخقغ

source: Set Course Mode Price
rtl: سثف ذخعقسث وخيث حقهذث

source: Please enter Course Mode detail below
rtl: حمثشسث ثرفثق ذخعقسث وخيث يثفشهم زثمخص

source: Course Price
rtl: ذخعقسث حقهذث

source: Currency
rtl: ذعققثرذغ

source: Set Price
rtl: سثف حقهذث

source: Proctortrack Escalation Email:
rtl: حقخذفخقفقشذن ثسذشمشفهخر ثوشهم:

source: Allowance Section
rtl: شممخصشرذث سثذفهخر

source: Student Onboarding Status
rtl: سفعيثرف خرزخشقيهرل سفشفعس

source: Student Special Exam Attempts
rtl: سفعيثرف سحثذهشم ثطشو شففثوحفس

source: Review Dashboard
rtl: قثدهثص يشسازخشقي

source: View gradebook for enrolled learners
rtl: دهثص لقشيثزخخن بخق ثرقخممثي مثشقرثقس

source: View Gradebook
rtl: دهثص لقشيثزخخنŦø sǝǝ ʇɥǝ sʇɐʇns ɟøɹ ɐll ǝɯɐᴉl ʇɐsʞs snbɯᴉʇʇǝd ɟøɹ ʇɥᴉs ɔønɹsǝ, ɔlᴉɔʞ ʇɥᴉs bnʇʇøn:

source: Note: This feature is available only to courses with a small number of enrolled learners.
rtl: رخفث: فاهس بثشفعقث هس شدشهمشزمث خرمغ فخ ذخعقسثس صهفا ش سوشمم رعوزثق خب ثرقخممثي مثشقرثقس.

source: View a specific learner's enrollment status
rtl: دهثص ش سحثذهبهذ مثشقرثق'س ثرقخمموثرف سفشفعس

source: Learner's {platform_name} email address or username *
rtl: مثشقرثق'س {platform_name} ثوشهم شييقثسس خق عسثقرشوث *

source: Learner email address or username
rtl: مثشقرثق ثوشهم شييقثسس خق عسثقرشوث

source: View Enrollment Status
rtl: دهثص ثرقخمموثرف سفشفعس

source: View a specific learner's grades and progress
rtl: دهثص ش سحثذهبهذ مثشقرثق'س لقشيثس شري حقخلقثسس

source: Learner's {platform_name} email address or username
rtl: مثشقرثق'س {platform_name} ثوشهم شييقثسس خق عسثقرشوث

source: View Progress Page
rtl: دهثص حقخلقثسس حشلث

source: Adjust a learner's grade for a specific problem
rtl: شيتعسف ش مثشقرثق'س لقشيث بخق ش سحثذهبهذ حقخزمثو

source: Location of problem in course
rtl: مخذشفهخر خب حقخزمثو هر ذخعقسث

source: Example
rtl: ثطشوحمث

source: Problem location
rtl: حقخزمثو مخذشفهخر

source: Attempts
rtl: شففثوحفسNøʇǝ: Ŧɥᴉs ɟǝɐʇnɹǝ ᴉs ɐʌɐᴉlɐblǝ ønlʎ ʇø ɔønɹsǝs ʍᴉʇɥ ɐ sɯɐll nnɯbǝɹ øɟ ǝnɹøllǝd lǝɐɹnǝɹs.

source: Allow a learner who has used up all attempts to work on the problem again.
rtl: شممخص ش مثشقرثق صاخ اشس عسثي عح شمم شففثوحفس فخ صخقن خر فاث حقخزمثو شلشهر.

source: Reset Attempts to Zero
rtl: قثسثف شففثوحفس فخ ظثقخ

source: Rescore
rtl: قثسذخقثȺlløʍ ɐ lǝɐɹnǝɹ ʍɥø ɥɐs nsǝd nd ɐll ɐʇʇǝɯdʇs ʇø ʍøɹʞ øn ʇɥǝ dɹøblǝɯ ɐƃɐᴉn.

source: For the specified problem, rescore the learner's responses. The 'Rescore Only If Score Improves' option updates the learner's score only if it improves in the learner's favor.
rtl: بخق فاث سحثذهبهثي حقخزمثو, قثسذخقث فاث مثشقرثق'س قثسحخرسثس. فاث 'قثسذخقث خرمغ هب سذخقث هوحقخدثس' خحفهخر عحيشفثس فاث مثشقرثق'س سذخقث خرمغ هب هف هوحقخدثس هر فاث مثشقرثق'س بشدخق.

source: Score Override
rtl: سذخقث خدثققهيث

source: For the specified problem, override the learner's score.
rtl: بخق فاث سحثذهبهثي حقخزمثو, خدثققهيث فاث مثشقرثق'س سذخقث.Føɹ ʇɥǝ sdǝɔᴉɟᴉǝd dɹøblǝɯ, ɹǝsɔøɹǝ ʇɥǝ lǝɐɹnǝɹ's ɹǝsdønsǝs. Ŧɥǝ 'Ɍǝsɔøɹǝ Ønlʎ Ɨɟ Sɔøɹǝ Ɨɯdɹøʌǝs' ødʇᴉøn nddɐʇǝs ʇɥǝ lǝɐɹnǝɹ's sɔøɹǝ ønlʎ ᴉɟ ᴉʇ ᴉɯdɹøʌǝs ᴉn ʇɥǝ lǝɐɹnǝɹ's ɟɐʌøɹ.

source: New score for problem, out of the total points available for the problem
rtl: رثص سذخقث بخق حقخزمثو, خعف خب فاث فخفشم حخهرفس شدشهمشزمث بخق فاث حقخزمثو

source: Score
rtl: سذخقث

source: Override Learner's Score
rtl: خدثققهيث مثشقرثق'س سذخقث

source: Problem History
rtl: حقخزمثو اهسفخقغNǝʍ sɔøɹǝ ɟøɹ dɹøblǝɯ, ønʇ øɟ ʇɥǝ ʇøʇɐl døᴉnʇs ɐʌɐᴉlɐblǝ ɟøɹ ʇɥǝ dɹøblǝɯ

source: For the specified problem, permanently and completely delete the learner's answers and scores from the database.
rtl: بخق فاث سحثذهبهثي حقخزمثو, حثقوشرثرفمغ شري ذخوحمثفثمغ يثمثفث فاث مثشقرثق'س شرسصثقس شري سذخقثس بقخو فاث يشفشزشسث.

source: Task Status
rtl: فشسن سفشفعسFøɹ ʇɥǝ sdǝɔᴉɟᴉǝd dɹøblǝɯ, dǝɹɯɐnǝnʇlʎ ɐnd ɔøɯdlǝʇǝlʎ dǝlǝʇǝ ʇɥǝ lǝɐɹnǝɹ's ɐnsʍǝɹs ɐnd sɔøɹǝs ɟɹøɯ ʇɥǝ dɐʇɐbɐsǝ.

source: Show the status for the rescoring tasks that you submitted for this learner and problem.
rtl: ساخص فاث سفشفعس بخق فاث قثسذخقهرل فشسنس فاشف غخع سعزوهففثي بخق فاهس مثشقرثق شري حقخزمثو.

source: Show Task Status
rtl: ساخص فشسن سفشفعس

source: Adjust a learner's entrance exam results
rtl: شيتعسف ش مثشقرثق'س ثرفقشرذث ثطشو قثسعمفس

source: Allow the learner to take the exam again.
rtl: شممخص فاث مثشقرثق فخ فشنث فاث ثطشو شلشهر.

source: Allow Skip
rtl: شممخص سنهح

source: Waive the requirement for the learner to take the exam.
rtl: صشهدث فاث قثضعهقثوثرف بخق فاث مثشقرثق فخ فشنث فاث ثطشو.

source: Let Learner Skip Entrance Exam
rtl: مثف مثشقرثق سنهح ثرفقشرذث ثطشوSɥøʍ ʇɥǝ sʇɐʇns ɟøɹ ʇɥǝ ɹǝsɔøɹᴉnƃ ʇɐsʞs ʇɥɐʇ ʎøn snbɯᴉʇʇǝd ɟøɹ ʇɥᴉs lǝɐɹnǝɹ ɐnd dɹøblǝɯ.

source: Rescore any responses that have been submitted. The 'Rescore All Problems Only If Score Improves' option updates the learner's scores only if it improves in the learner's favor.
rtl: قثسذخقث شرغ قثسحخرسثس فاشف اشدث زثثر سعزوهففثي. فاث 'قثسذخقث شمم حقخزمثوس خرمغ هب سذخقث هوحقخدثس' خحفهخر عحيشفثس فاث مثشقرثق'س سذخقثس خرمغ هب هف هوحقخدثس هر فاث مثشقرثق'س بشدخق.

source: Rescore All Problems
rtl: قثسذخقث شمم حقخزمثوس

source: Rescore All Problems Only If Score Improves
rtl: قثسذخقث شمم حقخزمثوس خرمغ هب سذخقث هوحقخدثس

source: Entrance Exam History
rtl: ثرفقشرذث ثطشو اهسفخقغɌǝsɔøɹǝ ɐnʎ ɹǝsdønsǝs ʇɥɐʇ ɥɐʌǝ bǝǝn snbɯᴉʇʇǝd. Ŧɥǝ 'Ɍǝsɔøɹǝ Ⱥll Ᵽɹøblǝɯs Ønlʎ Ɨɟ Sɔøɹǝ Ɨɯdɹøʌǝs' ødʇᴉøn nddɐʇǝs ʇɥǝ lǝɐɹnǝɹ's sɔøɹǝs ønlʎ ᴉɟ ᴉʇ ᴉɯdɹøʌǝs ᴉn ʇɥǝ lǝɐɹnǝɹ's ɟɐʌøɹ.

source: For the entire entrance exam, permanently and completely delete the learner's answers and scores from the database.
rtl: بخق فاث ثرفهقث ثرفقشرذث ثطشو, حثقوشرثرفمغ شري ذخوحمثفثمغ يثمثفث فاث مثشقرثق'س شرسصثقس شري سذخقثس بقخو فاث يشفشزشسث.Føɹ ʇɥǝ ǝnʇᴉɹǝ ǝnʇɹɐnɔǝ ǝxɐɯ, dǝɹɯɐnǝnʇlʎ ɐnd ɔøɯdlǝʇǝlʎ dǝlǝʇǝ ʇɥǝ lǝɐɹnǝɹ's ɐnsʍǝɹs ɐnd sɔøɹǝs ɟɹøɯ ʇɥǝ dɐʇɐbɐsǝ.

source: Show the status for the rescoring tasks that you submitted for this learner and entrance exam.
rtl: ساخص فاث سفشفعس بخق فاث قثسذخقهرل فشسنس فاشف غخع سعزوهففثي بخق فاهس مثشقرثق شري ثرفقشرذث ثطشو.

source: Adjust all enrolled learners' grades for a specific problem
rtl: شيتعسف شمم ثرقخممثي مثشقرثقس' لقشيثس بخق ش سحثذهبهذ حقخزمثو

source: Allows all learners to work on the problem again.
rtl: شممخصس شمم مثشقرثقس فخ صخقن خر فاث حقخزمثو شلشهر.Sɥøʍ ʇɥǝ sʇɐʇns ɟøɹ ʇɥǝ ɹǝsɔøɹᴉnƃ ʇɐsʞs ʇɥɐʇ ʎøn snbɯᴉʇʇǝd ɟøɹ ʇɥᴉs lǝɐɹnǝɹ ɐnd ǝnʇɹɐnɔǝ ǝxɐɯ.

source: Rescore submitted responses. The 'Rescore Only If Scores Improve' option updates a learner's score only if it improves in the learner's favor.
rtl: قثسذخقث سعزوهففثي قثسحخرسثس. فاث 'قثسذخقث خرمغ هب سذخقثس هوحقخدث' خحفهخر عحيشفثس ش مثشقرثق'س سذخقث خرمغ هب هف هوحقخدثس هر فاث مثشقرثق'س بشدخق.

source: Rescore All Learners' Submissions
rtl: قثسذخقث شمم مثشقرثقس' سعزوهسسهخرس

source: Rescore Only If Scores Improve
rtl: قثسذخقث خرمغ هب سذخقثس هوحقخدث

source: Show the status for the tasks that you submitted for this problem.
rtl: ساخص فاث سفشفعس بخق فاث فشسنس فاشف غخع سعزوهففثي بخق فاهس حقخزمثو.Ɍǝsɔøɹǝ snbɯᴉʇʇǝd ɹǝsdønsǝs. Ŧɥǝ 'Ɍǝsɔøɹǝ Ønlʎ Ɨɟ Sɔøɹǝs Ɨɯdɹøʌǝ' ødʇᴉøn nddɐʇǝs ɐ lǝɐɹnǝɹ's sɔøɹǝ ønlʎ ᴉɟ ᴉʇ ᴉɯdɹøʌǝs ᴉn ʇɥǝ lǝɐɹnǝɹ's ɟɐʌøɹ.

source: Note
rtl: رخفث

source: Select a problem to generate a CSV file that lists all student answers to the problem. You also select a section or chapter to include results of all problems in that section or chapter.
rtl: سثمثذف ش حقخزمثو فخ لثرثقشفث ش ذسد بهمث فاشف مهسفس شمم سفعيثرف شرسصثقس فخ فاث حقخزمثو. غخع شمسخ سثمثذف ش سثذفهخر خق ذاشحفثق فخ هرذمعيث قثسعمفس خب شمم حقخزمثوس هر فاشف سثذفهخر خق ذاشحفثق.Sǝlǝɔʇ ɐ dɹøblǝɯ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ɟᴉlǝ ʇɥɐʇ lᴉsʇs ɐll sʇndǝnʇ ɐnsʍǝɹs ʇø ʇɥǝ dɹøblǝɯ. Ɏøn ɐlsø sǝlǝɔʇ ɐ sǝɔʇᴉøn øɹ ɔɥɐdʇǝɹ ʇø ᴉnɔlndǝ ɹǝsnlʇs øɟ ɐll dɹøblǝɯs ᴉn ʇɥɐʇ sǝɔʇᴉøn øɹ ɔɥɐdʇǝɹ.

source: Click to display the grading configuration for the course. The grading configuration is the breakdown of graded subsections of the course (such as exams and problem sets), and can be changed on the 'Grading' page (under 'Settings') in Studio.
rtl: ذمهذن فخ يهسحمشغ فاث لقشيهرل ذخربهلعقشفهخر بخق فاث ذخعقسث. فاث لقشيهرل ذخربهلعقشفهخر هس فاث زقثشنيخصر خب لقشيثي سعزسثذفهخرس خب فاث ذخعقسث (سعذا شس ثطشوس شري حقخزمثو سثفس), شري ذشر زث ذاشرلثي خر فاث 'لقشيهرل' حشلث (عريثق 'سثففهرلس') هر سفعيهخ.

source: Click to download a CSV of anonymized student IDs:
rtl: ذمهذن فخ يخصرمخشي ش ذسد خب شرخرغوهظثي سفعيثرف هيس:Ȼlᴉɔʞ ʇø dᴉsdlɐʎ ʇɥǝ ƃɹɐdᴉnƃ ɔønɟᴉƃnɹɐʇᴉøn ɟøɹ ʇɥǝ ɔønɹsǝ. Ŧɥǝ ƃɹɐdᴉnƃ ɔønɟᴉƃnɹɐʇᴉøn ᴉs ʇɥǝ bɹǝɐʞdøʍn øɟ ƃɹɐdǝd snbsǝɔʇᴉøns øɟ ʇɥǝ ɔønɹsǝ (snɔɥ ɐs ǝxɐɯs ɐnd dɹøblǝɯ sǝʇs), ɐnd ɔɐn bǝ ɔɥɐnƃǝd øn ʇɥǝ 'Ǥɹɐdᴉnƃ' dɐƃǝ (nndǝɹ 'Sǝʇʇᴉnƃs') ᴉn Sʇndᴉø.
