Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: For large courses, generating some reports can take several hours. When report generation is complete, a link that includes the date and time of generation appears in the table below. These reports are generated in the background, meaning it is OK to navigate away from this page while your report is generating.
rtl: بخق مشقلث ذخعقسثس, لثرثقشفهرل سخوث قثحخقفس ذشر فشنث سثدثقشم اخعقس. صاثر قثحخقف لثرثقشفهخر هس ذخوحمثفث, ش مهرن فاشف هرذمعيثس فاث يشفث شري فهوث خب لثرثقشفهخر شححثشقس هر فاث فشزمث زثمخص. فاثسث قثحخقفس شقث لثرثقشفثي هر فاث زشذنلقخعري, وثشرهرل هف هس خن فخ رشدهلشفث شصشغ بقخو فاهس حشلث صاهمث غخعق قثحخقف هس لثرثقشفهرل.Føɹ lɐɹƃǝ ɔønɹsǝs, ƃǝnǝɹɐʇᴉnƃ søɯǝ ɹǝdøɹʇs ɔɐn ʇɐʞǝ sǝʌǝɹɐl ɥønɹs. Wɥǝn ɹǝdøɹʇ ƃǝnǝɹɐʇᴉøn ᴉs ɔøɯdlǝʇǝ, ɐ lᴉnʞ ʇɥɐʇ ᴉnɔlndǝs ʇɥǝ dɐʇǝ ɐnd ʇᴉɯǝ øɟ ƃǝnǝɹɐʇᴉøn ɐddǝɐɹs ᴉn ʇɥǝ ʇɐblǝ bǝløʍ. Ŧɥǝsǝ ɹǝdøɹʇs ɐɹǝ ƃǝnǝɹɐʇǝd ᴉn ʇɥǝ bɐɔʞƃɹønnd, ɯǝɐnᴉnƃ ᴉʇ ᴉs ØꝀ ʇø nɐʌᴉƃɐʇǝ ɐʍɐʎ ɟɹøɯ ʇɥᴉs dɐƃǝ ʍɥᴉlǝ ʎønɹ ɹǝdøɹʇ ᴉs ƃǝnǝɹɐʇᴉnƃ.

source: Please be patient and do not click these buttons multiple times. Clicking these buttons multiple times will significantly slow the generation process.
rtl: حمثشسث زث حشفهثرف شري يخ رخف ذمهذن فاثسث زعففخرس وعمفهحمث فهوثس. ذمهذنهرل فاثسث زعففخرس وعمفهحمث فهوثس صهمم سهلرهبهذشرفمغ سمخص فاث لثرثقشفهخر حقخذثسس.Ᵽlǝɐsǝ bǝ dɐʇᴉǝnʇ ɐnd dø nøʇ ɔlᴉɔʞ ʇɥǝsǝ bnʇʇøns ɯnlʇᴉdlǝ ʇᴉɯǝs. Ȼlᴉɔʞᴉnƃ ʇɥǝsǝ bnʇʇøns ɯnlʇᴉdlǝ ʇᴉɯǝs ʍᴉll sᴉƃnᴉɟᴉɔɐnʇlʎ sløʍ ʇɥǝ ƃǝnǝɹɐʇᴉøn dɹøɔǝss.

source: For smaller courses, click to list profile information for enrolled students directly on this page:
rtl: بخق سوشممثق ذخعقسثس, ذمهذن فخ مهسف حقخبهمث هربخقوشفهخر بخق ثرقخممثي سفعيثرفس يهقثذفمغ خر فاهس حشلث:Føɹ sɯɐllǝɹ ɔønɹsǝs, ɔlᴉɔʞ ʇø lᴉsʇ dɹøɟᴉlǝ ᴉnɟøɹɯɐʇᴉøn ɟøɹ ǝnɹøllǝd sʇndǝnʇs dᴉɹǝɔʇlʎ øn ʇɥᴉs dɐƃǝ:

source: Click to generate a CSV file of all students enrolled in this course, along with profile information such as email address and username:
rtl: ذمهذن فخ لثرثقشفث ش ذسد بهمث خب شمم سفعيثرفس ثرقخممثي هر فاهس ذخعقسث, شمخرل صهفا حقخبهمث هربخقوشفهخر سعذا شس ثوشهم شييقثسس شري عسثقرشوث:Ȼlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ɟᴉlǝ øɟ ɐll sʇndǝnʇs ǝnɹøllǝd ᴉn ʇɥᴉs ɔønɹsǝ, ɐlønƃ ʍᴉʇɥ dɹøɟᴉlǝ ᴉnɟøɹɯɐʇᴉøn snɔɥ ɐs ǝɯɐᴉl ɐddɹǝss ɐnd nsǝɹnɐɯǝ:

source: Click to generate a CSV file that lists learners who can enroll in the course but have not yet done so.
rtl: ذمهذن فخ لثرثقشفث ش ذسد بهمث فاشف مهسفس مثشقرثقس صاخ ذشر ثرقخمم هر فاث ذخعقسث زعف اشدث رخف غثف يخرث سخ.Ȼlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ɟᴉlǝ ʇɥɐʇ lᴉsʇs lǝɐɹnǝɹs ʍɥø ɔɐn ǝnɹøll ᴉn ʇɥǝ ɔønɹsǝ bnʇ ɥɐʌǝ nøʇ ʎǝʇ dønǝ sø.

source: Click to generate a CSV file of all proctored exam results in this course.
rtl: ذمهذن فخ لثرثقشفث ش ذسد بهمث خب شمم حقخذفخقثي ثطشو قثسعمفس هر فاهس ذخعقسث.Ȼlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ɟᴉlǝ øɟ ɐll dɹøɔʇøɹǝd ǝxɐɯ ɹǝsnlʇs ᴉn ʇɥᴉs ɔønɹsǝ.

source: Click to generate a CSV file of survey results for this course.
rtl: ذمهذن فخ لثرثقشفث ش ذسد بهمث خب سعقدثغ قثسعمفس بخق فاهس ذخعقسث.Ȼlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ɟᴉlǝ øɟ snɹʌǝʎ ɹǝsnlʇs ɟøɹ ʇɥᴉs ɔønɹsǝ.

source: Click to generate a CSV ORA grade report for all currently enrolled students.
rtl: ذمهذن فخ لثرثقشفث ش ذسد خقش لقشيث قثحخقف بخق شمم ذعققثرفمغ ثرقخممثي سفعيثرفس.Ȼlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ØɌȺ ƃɹɐdǝ ɹǝdøɹʇ ɟøɹ ɐll ɔnɹɹǝnʇlʎ ǝnɹøllǝd sʇndǝnʇs.

source: Click to generate a CSV problem grade report for all currently enrolled students.
rtl: ذمهذن فخ لثرثقشفث ش ذسد حقخزمثو لقشيث قثحخقف بخق شمم ذعققثرفمغ ثرقخممثي سفعيثرفس.

source: My Courses
rtl: وغ ذخعقسثس

source: Change Preferred Language
rtl: ذاشرلث حقثبثققثي مشرلعشلث

source: Please choose your preferred language
rtl: حمثشسث ذاخخسث غخعق حقثبثققثي مشرلعشلث

source: Save Language Settings
rtl: سشدث مشرلعشلث سثففهرلسȻlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV dɹøblǝɯ ƃɹɐdǝ ɹǝdøɹʇ ɟøɹ ɐll ɔnɹɹǝnʇlʎ ǝnɹøllǝd sʇndǝnʇs.

source: Don't see your preferred language? {link_start}Volunteer to become a translator!{link_end}
rtl: يخر'ف سثث غخعق حقثبثققثي مشرلعشلث? {link_start}دخمعرفثثق فخ زثذخوث ش فقشرسمشفخق!{link_end}

source: Explore Courses
rtl: ثطحمخقث ذخعقسثس

source: Global
rtl: لمخزشمĐøn'ʇ sǝǝ ʎønɹ dɹǝɟǝɹɹǝd lɐnƃnɐƃǝ? {link_start}Vølnnʇǝǝɹ ʇø bǝɔøɯǝ ɐ ʇɹɐnslɐʇøɹ!{link_end}

source: {p_tag}You currently do not have any peer grading to do. In order to have peer grading to do: {ul_tag} {li_tag}You need to have submitted a response to a peer grading problem.{end_li_tag} {li_tag}The course team needs to score the essays that are used to help you better understand the grading criteria.{end_li_tag} {li_tag}There must be submissions that are waiting for grading.{end_li_tag} {end_ul_tag} {end_p_tag}
rtl: {p_tag}غخع ذعققثرفمغ يخ رخف اشدث شرغ حثثق لقشيهرل فخ يخ. هر خقيثق فخ اشدث حثثق لقشيهرل فخ يخ: {ul_tag} {li_tag}غخع رثثي فخ اشدث سعزوهففثي ش قثسحخرسث فخ ش حثثق لقشيهرل حقخزمثو.{end_li_tag} {li_tag}فاث ذخعقسث فثشو رثثيس فخ سذخقث فاث ثسسشغس فاشف شقث عسثي فخ اثمح غخع زثففثق عريثقسفشري فاث لقشيهرل ذقهفثقهش.{end_li_tag} {li_tag}فاثقث وعسف زث سعزوهسسهخرس فاشف شقث صشهفهرل بخق لقشيهرل.{end_li_tag} {p_tag}Ɏøn ɔnɹɹǝnʇlʎ dø nøʇ ɥɐʌǝ ɐnʎ dǝǝɹ ƃɹɐdᴉnƃ ʇø dø. Ɨn øɹdǝɹ ʇø ɥɐʌǝ dǝǝɹ ƃɹɐdᴉnƃ ʇø dø: {ul_tag} {li_tag}Ɏøn nǝǝd ʇø ɥɐʌǝ snbɯᴉʇʇǝd ɐ ɹǝsdønsǝ ʇø ɐ dǝǝɹ ƃɹɐdᴉnƃ dɹøblǝɯ.{end_li_tag} {li_tag}Ŧɥǝ ɔønɹsǝ ʇǝɐɯ nǝǝds ʇø sɔøɹǝ ʇɥǝ ǝssɐʎs ʇɥɐʇ ɐɹǝ nsǝd ʇø ɥǝld ʎøn bǝʇʇǝɹ nndǝɹsʇɐnd ʇɥǝ ƃɹɐdᴉnƃ ɔɹᴉʇǝɹᴉɐ.{end_li_tag} {li_tag}Ŧɥǝɹǝ ɯnsʇ bǝ snbɯᴉssᴉøns ʇɥɐʇ ɐɹǝ ʍɐᴉʇᴉnƃ ɟøɹ ƃɹɐdᴉnƃ.{end_li_tag} {end_ul_tag} {end_p_tag}

source: Peer Grading
rtl: حثثق لقشيهرل

source: Here is a list of problems that need to be peer graded for this course.
rtl: اثقث هس ش مهسف خب حقخزمثوس فاشف رثثي فخ زث حثثق لقشيثي بخق فاهس ذخعقسث.

source: Problem Name
rtl: حقخزمثو رشوث

source: Due date
rtl: يعث يشفث

source: Graded
rtl: لقشيثي

source: Available
rtl: شدشهمشزمث

source: Required
rtl: قثضعهقثي

source: No due date
rtl: رخ يعث يشفثĦǝɹǝ ᴉs ɐ lᴉsʇ øɟ dɹøblǝɯs ʇɥɐʇ nǝǝd ʇø bǝ dǝǝɹ ƃɹɐdǝd ɟøɹ ʇɥᴉs ɔønɹsǝ.

source: The due date has passed, and peer grading for this problem is closed at this time.
rtl: فاث يعث يشفث اشس حشسسثي, شري حثثق لقشيهرل بخق فاهس حقخزمثو هس ذمخسثي شف فاهس فهوث.

source: The due date has passed, and peer grading is closed at this time.
rtl: فاث يعث يشفث اشس حشسسثي, شري حثثق لقشيهرل هس ذمخسثي شف فاهس فهوث.

source: Learning to Grade
rtl: مثشقرهرل فخ لقشيث

source: Hide Question
rtl: اهيث ضعثسفهخر

source: Student Response
rtl: سفعيثرف قثسحخرسث

source: Written Feedback
rtl: صقهففثر بثثيزشذن

source: Please include some written feedback as well.
rtl: حمثشسث هرذمعيث سخوث صقهففثر بثثيزشذن شس صثمم.Ŧɥǝ dnǝ dɐʇǝ ɥɐs dɐssǝd, ɐnd dǝǝɹ ƃɹɐdᴉnƃ ɟøɹ ʇɥᴉs dɹøblǝɯ ᴉs ɔløsǝd ɐʇ ʇɥᴉs ʇᴉɯǝ.

source: This submission has explicit, offensive, or (I suspect) plagiarized content.
rtl: فاهس سعزوهسسهخر اشس ثطحمهذهف, خببثرسهدث, خق (ه سعسحثذف) حمشلهشقهظثي ذخرفثرف.Ŧɥᴉs snbɯᴉssᴉøn ɥɐs ǝxdlᴉɔᴉʇ, øɟɟǝnsᴉʌǝ, øɹ (Ɨ snsdǝɔʇ) dlɐƃᴉɐɹᴉzǝd ɔønʇǝnʇ.

source: How did I do?
rtl: اخص يهي ه يخ?

source: Ready to grade!
rtl: قثشيغ فخ لقشيث!

source: You have finished learning to grade, which means that you are now ready to start grading.
rtl: غخع اشدث بهرهساثي مثشقرهرل فخ لقشيث, صاهذا وثشرس فاشف غخع شقث رخص قثشيغ فخ سفشقف لقشيهرل.

source: Start Grading!
rtl: سفشقف لقشيهرل!

source: Learning to grade
rtl: مثشقرهرل فخ لقشيث

source: You have not yet finished learning to grade this problem.
rtl: غخع اشدث رخف غثف بهرهساثي مثشقرهرل فخ لقشيث فاهس حقخزمثو.Ɏøn ɥɐʌǝ ɟᴉnᴉsɥǝd lǝɐɹnᴉnƃ ʇø ƃɹɐdǝ, ʍɥᴉɔɥ ɯǝɐns ʇɥɐʇ ʎøn ɐɹǝ nøʍ ɹǝɐdʎ ʇø sʇɐɹʇ ƃɹɐdᴉnƃ.

source: You will now be shown a series of instructor-scored essays, and will be asked to score them yourself.
rtl: غخع صهمم رخص زث ساخصر ش سثقهثس خب هرسفقعذفخق-سذخقثي ثسسشغس, شري صهمم زث شسنثي فخ سذخقث فاثو غخعقسثمب.Ɏøn ʍᴉll nøʍ bǝ sɥøʍn ɐ sǝɹᴉǝs øɟ ᴉnsʇɹnɔʇøɹ-sɔøɹǝd ǝssɐʎs, ɐnd ʍᴉll bǝ ɐsʞǝd ʇø sɔøɹǝ ʇɥǝɯ ʎønɹsǝlɟ.

source: Once you can score the essays similarly to an instructor, you will be ready to grade your peers.
rtl: خرذث غخع ذشر سذخقث فاث ثسسشغس سهوهمشقمغ فخ شر هرسفقعذفخق, غخع صهمم زث قثشيغ فخ لقشيث غخعق حثثقس.

source: Start learning to grade
rtl: سفشقف مثشقرهرل فخ لقشيث

source: Are you sure that you want to flag this submission?
rtl: شقث غخع سعقث فاشف غخع صشرف فخ بمشل فاهس سعزوهسسهخر?Ønɔǝ ʎøn ɔɐn sɔøɹǝ ʇɥǝ ǝssɐʎs sᴉɯᴉlɐɹlʎ ʇø ɐn ᴉnsʇɹnɔʇøɹ, ʎøn ʍᴉll bǝ ɹǝɐdʎ ʇø ƃɹɐdǝ ʎønɹ dǝǝɹs.

source: You are about to flag a submission. You should only flag a submission that contains explicit, offensive, or (suspected) plagiarized content. If the submission is not addressed to the question or is incorrect, you should give it a score of zero and accompanying feedback instead of flagging it.
rtl: غخع شقث شزخعف فخ بمشل ش سعزوهسسهخر. غخع ساخعمي خرمغ بمشل ش سعزوهسسهخر فاشف ذخرفشهرس ثطحمهذهف, خببثرسهدث, خق (سعسحثذفثي) حمشلهشقهظثي ذخرفثرف. هب فاث سعزوهسسهخر هس رخف شييقثسسثي فخ فاث ضعثسفهخر خق هس هرذخققثذف, غخع ساخعمي لهدث هف ش سذخقث خب ظثقخ شري شذذخوحشرغهرل بثثيزشذن هرسفثشي خب بمشللهرل هف.

source: Remove Flag
rtl: قثوخدث بمشل

source: Keep Flag
rtl: نثثح بمشل

source: Go Back
rtl: لخ زشذن

source: Account Activation Info
rtl: شذذخعرف شذفهدشفهخر هربخ

source: Your Password Reset is Complete
rtl: غخعق حشسسصخقي قثسثف هس ذخوحمثفث

source: Password Reset Complete
rtl: حشسسصخقي قثسثف ذخوحمثفثɎøn ɐɹǝ ɐbønʇ ʇø ɟlɐƃ ɐ snbɯᴉssᴉøn. Ɏøn sɥønld ønlʎ ɟlɐƃ ɐ snbɯᴉssᴉøn ʇɥɐʇ ɔønʇɐᴉns ǝxdlᴉɔᴉʇ, øɟɟǝnsᴉʌǝ, øɹ (snsdǝɔʇǝd) dlɐƃᴉɐɹᴉzǝd ɔønʇǝnʇ. Ɨɟ ʇɥǝ snbɯᴉssᴉøn ᴉs nøʇ ɐddɹǝssǝd ʇø ʇɥǝ bnǝsʇᴉøn øɹ ᴉs ᴉnɔøɹɹǝɔʇ, ʎøn sɥønld ƃᴉʌǝ ᴉʇ ɐ sɔøɹǝ øɟ zǝɹø ɐnd ɐɔɔøɯdɐnʎᴉnƃ ɟǝǝdbɐɔʞ ᴉnsʇǝɐd øɟ ɟlɐƃƃᴉnƃ ᴉʇ.

source: Your password has been reset. {start_link}Sign-in to your account.{end_link}
rtl: غخعق حشسسصخقي اشس زثثر قثسثف. {start_link}سهلر-هر فخ غخعق شذذخعرف.{end_link}

source: Reset Your {platform_name} Password
rtl: قثسثف غخعق {platform_name} حشسسصخقي

source: Invalid Password Reset Link
rtl: هردشمهي حشسسصخقي قثسثف مهرنɎønɹ dɐssʍøɹd ɥɐs bǝǝn ɹǝsǝʇ. {start_link}Sᴉƃn-ᴉn ʇø ʎønɹ ɐɔɔønnʇ.{end_link}

source: This password reset link is invalid. It may have been used already. To reset your password, go to the {start_link}sign-in{end_link} page and select {start_strong}Forgot password{end_strong}.
rtl: فاهس حشسسصخقي قثسثف مهرن هس هردشمهي. هف وشغ اشدث زثثر عسثي شمقثشيغ. فخ قثسثف غخعق حشسسصخقي, لخ فخ فاث {start_link}سهلر-هر{end_link} حشلث شري سثمثذف {start_strong}بخقلخف حشسسصخقي{end_strong}.

source: Password reset successful
rtl: حشسسصخقي قثسثف سعذذثسسبعمŦɥᴉs dɐssʍøɹd ɹǝsǝʇ lᴉnʞ ᴉs ᴉnʌɐlᴉd. Ɨʇ ɯɐʎ ɥɐʌǝ bǝǝn nsǝd ɐlɹǝɐdʎ. Ŧø ɹǝsǝʇ ʎønɹ dɐssʍøɹd, ƃø ʇø ʇɥǝ {start_link}sᴉƃn-ᴉn{end_link} dɐƃǝ ɐnd sǝlǝɔʇ {start_strong}Føɹƃøʇ dɐssʍøɹd{end_strong}.

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
rtl: صث'دث ث-وشهمثي غخع هرسفقعذفهخرس بخق سثففهرل غخعق حشسسصخقي فخ فاث ث-وشهم شييقثسس غخع سعزوهففثي. غخع ساخعمي زث قثذثهدهرل هف ساخقفمغ.Wǝ'ʌǝ ǝ-ɯɐᴉlǝd ʎøn ᴉnsʇɹnɔʇᴉøns ɟøɹ sǝʇʇᴉnƃ ʎønɹ dɐssʍøɹd ʇø ʇɥǝ ǝ-ɯɐᴉl ɐddɹǝss ʎøn snbɯᴉʇʇǝd. Ɏøn sɥønld bǝ ɹǝɔǝᴉʌᴉnƃ ᴉʇ sɥøɹʇlʎ.

source: The page that you were looking for was not found. Go back to the {link_start}homepage{link_end} .
rtl: فاث حشلث فاشف غخع صثقث مخخنهرل بخق صشس رخف بخعري. لخ زشذن فخ فاث {link_start}اخوثحشلث{link_end} .

source: Too Many Requests
rtl: فخخ وشرغ قثضعثسفس

source: Your request has been rate-limited. Please try again later.
rtl: غخعق قثضعثسف اشس زثثر قشفث-مهوهفثي. حمثشسث فقغ شلشهر مشفثق.Ŧɥǝ dɐƃǝ ʇɥɐʇ ʎøn ʍǝɹǝ løøʞᴉnƃ ɟøɹ ʍɐs nøʇ ɟønnd. Ǥø bɐɔʞ ʇø ʇɥǝ {link_start}ɥøɯǝdɐƃǝ{link_end} .

source: This page left intentionally blank. Feel free to add your own content.
rtl: فاهس حشلث مثبف هرفثرفهخرشممغ زمشرن. بثثم بقثث فخ شيي غخعق خصر ذخرفثرف.Ŧɥᴉs dɐƃǝ lǝɟʇ ᴉnʇǝnʇᴉønɐllʎ blɐnʞ. Fǝǝl ɟɹǝǝ ʇø ɐdd ʎønɹ øʍn ɔønʇǝnʇ.

source: Our system indicates that you are trying to access this {platform_name} course from a country or region currently subject to U.S. economic and trade sanctions. Unfortunately, because {platform_name} is required to comply with export controls, we cannot allow you to access this course at this time.
rtl: خعق سغسفثو هريهذشفثس فاشف غخع شقث فقغهرل فخ شذذثسس فاهس {platform_name} ذخعقسث بقخو ش ذخعرفقغ خق قثلهخر ذعققثرفمغ سعزتثذف فخ ع.س. ثذخرخوهذ شري فقشيث سشرذفهخرس. عربخقفعرشفثمغ, زثذشعسث {platform_name} هس قثضعهقثي فخ ذخوحمغ صهفا ثطحخقف ذخرفقخمس, صث ذشررخف شممخص غخع فخ شذذثسس فاهس ذخعقسث شف فاهس فهوث.Ønɹ sʎsʇǝɯ ᴉndᴉɔɐʇǝs ʇɥɐʇ ʎøn ɐɹǝ ʇɹʎᴉnƃ ʇø ɐɔɔǝss ʇɥᴉs {platform_name} ɔønɹsǝ ɟɹøɯ ɐ ɔønnʇɹʎ øɹ ɹǝƃᴉøn ɔnɹɹǝnʇlʎ snbɾǝɔʇ ʇø Ʉ.S. ǝɔønøɯᴉɔ ɐnd ʇɹɐdǝ sɐnɔʇᴉøns. Ʉnɟøɹʇnnɐʇǝlʎ, bǝɔɐnsǝ {platform_name} ᴉs ɹǝbnᴉɹǝd ʇø ɔøɯdlʎ ʍᴉʇɥ ǝxdøɹʇ ɔønʇɹøls, ʍǝ ɔɐnnøʇ ɐlløʍ ʎøn ʇø ɐɔɔǝss ʇɥᴉs ɔønɹsǝ ɐʇ ʇɥᴉs ʇᴉɯǝ.

source: FAQ
rtl: بشض

source: Jobs
rtl: تخزس

source: In the Press
rtl: هر فاث حقثسس

source: Currently the {platform_name} servers are down
rtl: ذعققثرفمغ فاث {platform_name} سثقدثقس شقث يخصر

source: Our staff is currently working to get the site back up as soon as possible.
rtl: خعق سفشبب هس ذعققثرفمغ صخقنهرل فخ لثف فاث سهفث زشذن عح شس سخخر شس حخسسهزمث.

source: There has been a 500 error on the {platform_name} servers
rtl: فاثقث اشس زثثر ش 500 ثققخق خر فاث {platform_name} سثقدثقس

source: Please wait a few seconds and then reload the page.
rtl: حمثشسث صشهف ش بثص سثذخريس شري فاثر قثمخشي فاث حشلث.

source: Currently the {platform_name} servers are overloaded
rtl: ذعققثرفمغ فاث {platform_name} سثقدثقس شقث خدثقمخشيثي

source: Account Settings
rtl: شذذخعرف سثففهرلسØnɹ sʇɐɟɟ ᴉs ɔnɹɹǝnʇlʎ ʍøɹʞᴉnƃ ʇø ƃǝʇ ʇɥǝ sᴉʇǝ bɐɔʞ nd ɐs søøn ɐs døssᴉblǝ.

source: and access to private sites offered by MIT Open Learning, Wharton Executive Education, and Harvard Medical School
rtl: شري شذذثسس فخ حقهدشفث سهفثس خببثقثي زغ وهف خحثر مثشقرهرل, صاشقفخر ثطثذعفهدث ثيعذشفهخر, شري اشقدشقي وثيهذشم سذاخخم

source: Please Wait
rtl: حمثشسث صشهف

source: Sign in or Register
rtl: سهلر هر خق قثلهسفثق

source: Student Support
rtl: سفعيثرف سعححخقف

source: Student Support: Certificates
rtl: سفعيثرف سعححخقف: ذثقفهبهذشفثس

source: Contact {platform_name} Support
rtl: ذخرفشذف {platform_name} سعححخقف

source: Student Support: Enrollment
rtl: سفعيثرف سعححخقف: ثرقخمموثرف

source: Student Support: Feature Based Enrollments
rtl: سفعيثرف سعححخقف: بثشفعقث زشسثي ثرقخمموثرفس

source: Content Type Gating
rtl: ذخرفثرف فغحث لشفهرل

source: Course Duration Limits
rtl: ذخعقسث يعقشفهخر مهوهفس

source: Is Enabled
rtl: هس ثرشزمثي

source: No results found
rtl: رخ قثسعمفس بخعري

source: Student Support: Manage User
rtl: سفعيثرف سعححخقف: وشرشلث عسثق

source: Program Enrollments Inspector
rtl: حقخلقشو ثرقخمموثرفس هرسحثذفخق

source: User Survey
rtl: عسثق سعقدثغ

source: Pre-Course Survey
rtl: حقث-ذخعقسث سعقدثغ ɐnd ɐɔɔǝss ʇø dɹᴉʌɐʇǝ sᴉʇǝs øɟɟǝɹǝd bʎ MƗŦ Ødǝn Łǝɐɹnᴉnƃ, Wɥɐɹʇøn Ɇxǝɔnʇᴉʌǝ Ɇdnɔɐʇᴉøn, ɐnd Ħɐɹʌɐɹd Mǝdᴉɔɐl Sɔɥøøl

source: You can begin your course as soon as you complete the following form. Required fields are marked with an asterisk (*). This information is for the use of {platform_name} only. It will not be linked to your public profile in any way.
rtl: غخع ذشر زثلهر غخعق ذخعقسث شس سخخر شس غخع ذخوحمثفث فاث بخممخصهرل بخقو. قثضعهقثي بهثميس شقث وشقنثي صهفا شر شسفثقهسن (*). فاهس هربخقوشفهخر هس بخق فاث عسث خب {platform_name} خرمغ. هف صهمم رخف زث مهرنثي فخ غخعق حعزمهذ حقخبهمث هر شرغ صشغ.

source: You are missing the following required fields:
rtl: غخع شقث وهسسهرل فاث بخممخصهرل قثضعهقثي بهثميس:

source: Cancel and Return to Dashboard
rtl: ذشرذثم شري قثفعقر فخ يشسازخشقي

source: Why do I need to complete this information?
rtl: صاغ يخ ه رثثي فخ ذخوحمثفث فاهس هربخقوشفهخر?Ɏøn ɔɐn bǝƃᴉn ʎønɹ ɔønɹsǝ ɐs søøn ɐs ʎøn ɔøɯdlǝʇǝ ʇɥǝ ɟølløʍᴉnƃ ɟøɹɯ. Ɍǝbnᴉɹǝd ɟᴉǝlds ɐɹǝ ɯɐɹʞǝd ʍᴉʇɥ ɐn ɐsʇǝɹᴉsʞ (*). Ŧɥᴉs ᴉnɟøɹɯɐʇᴉøn ᴉs ɟøɹ ʇɥǝ nsǝ øɟ {platform_name} ønlʎ. Ɨʇ ʍᴉll nøʇ bǝ lᴉnʞǝd ʇø ʎønɹ dnblᴉɔ dɹøɟᴉlǝ ᴉn ɐnʎ ʍɐʎ.

source: We use the information you provide to improve our course for both current and future students. The more we know about your specific needs, the better we can make your course experience.
rtl: صث عسث فاث هربخقوشفهخر غخع حقخدهيث فخ هوحقخدث خعق ذخعقسث بخق زخفا ذعققثرف شري بعفعقث سفعيثرفس. فاث وخقث صث نرخص شزخعف غخعق سحثذهبهذ رثثيس, فاث زثففثق صث ذشر وشنث غخعق ذخعقسث ثطحثقهثرذث.

source: Who can I contact if I have questions?
rtl: صاخ ذشر ه ذخرفشذف هب ه اشدث ضعثسفهخرس?Wǝ nsǝ ʇɥǝ ᴉnɟøɹɯɐʇᴉøn ʎøn dɹøʌᴉdǝ ʇø ᴉɯdɹøʌǝ ønɹ ɔønɹsǝ ɟøɹ bøʇɥ ɔnɹɹǝnʇ ɐnd ɟnʇnɹǝ sʇndǝnʇs. Ŧɥǝ ɯøɹǝ ʍǝ ʞnøʍ ɐbønʇ ʎønɹ sdǝɔᴉɟᴉɔ nǝǝds, ʇɥǝ bǝʇʇǝɹ ʍǝ ɔɐn ɯɐʞǝ ʎønɹ ɔønɹsǝ ǝxdǝɹᴉǝnɔǝ.

source: If you have any questions about this course or this form, you can contact {link_start}{mail_to_link}{link_end}.
rtl: هب غخع اشدث شرغ ضعثسفهخرس شزخعف فاهس ذخعقسث خق فاهس بخقو, غخع ذشر ذخرفشذف Ɨɟ ʎøn ɥɐʌǝ ɐnʎ bnǝsʇᴉøns ɐbønʇ ʇɥᴉs ɔønɹsǝ øɹ ʇɥᴉs ɟøɹɯ, ʎøn ɔɐn ɔønʇɐɔʇ {link_start}{mail_to_link}{link_end}.

source: Skeleton Page
rtl: سنثمثفخر حشلث

source: Search the course
rtl: سثشقذا فاث ذخعقسث

source: Start Course
rtl: سفشقف ذخعقسث

source: Have questions?
rtl: اشدث ضعثسفهخرس?

source: Please read {a_start}our FAQs to view common questions about our certificates{a_end}.
rtl: حمثشسث قثشي {a_start}خعق بشضس فخ دهثص ذخووخر ضعثسفهخرس شزخعف خعق ذثقفهبهذشفثس{a_end}.

source: Re-Verify for {course_name}
rtl: قث-دثقهبغ بخق {course_name}

source: Verification Deadline Has Passed
rtl: دثقهبهذشفهخر يثشيمهرث اشس حشسسثي

source: Upgrade Deadline Has Passed
rtl: عحلقشيث يثشيمهرث اشس حشسسثيⱣlǝɐsǝ ɹǝɐd {a_start}ønɹ FȺQs ʇø ʌᴉǝʍ ɔøɯɯøn bnǝsʇᴉøns ɐbønʇ ønɹ ɔǝɹʇᴉɟᴉɔɐʇǝs{a_end}.

source: The verification deadline for {course_name} was {{date}}. Verification is no longer available.
rtl: فاث دثقهبهذشفهخر يثشيمهرث بخق {course_name} صشس {{date}}. دثقهبهذشفهخر هس رخ مخرلثق شدشهمشزمث.Ŧɥǝ ʌǝɹᴉɟᴉɔɐʇᴉøn dǝɐdlᴉnǝ ɟøɹ {course_name} ʍɐs {{date}}. Vǝɹᴉɟᴉɔɐʇᴉøn ᴉs nø lønƃǝɹ ɐʌɐᴉlɐblǝ.

source: The deadline to upgrade to a verified certificate for this course has passed.
rtl: فاث يثشيمهرث فخ عحلقشيث فخ ش دثقهبهثي ذثقفهبهذشفث بخق فاهس ذخعقسث اشس حشسسثي.

source: Upgrade Your Enrollment For {course_name}.
rtl: عحلقشيث غخعق ثرقخمموثرف بخق {course_name}.

source: Verify For {course_name}
rtl: دثقهبغ بخق {course_name}

source: Enroll In {course_name}
rtl: ثرقخمم هر {course_name}

source: Technical Requirements
rtl: فثذارهذشم قثضعهقثوثرفسŦɥǝ dǝɐdlᴉnǝ ʇø ndƃɹɐdǝ ʇø ɐ ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ ɟøɹ ʇɥᴉs ɔønɹsǝ ɥɐs dɐssǝd.

source: Please make sure your browser is updated to the {strong_start}{a_start}most recent version possible{a_end}{strong_end}. Also, please make sure your {strong_start}webcam is plugged in, turned on, and allowed to function in your web browser (commonly adjustable in your browser settings).{strong_end}
rtl: حمثشسث وشنث سعقث غخعق زقخصسثق هس عحيشفثي فخ فاث {strong_start}{a_start}وخسف قثذثرف دثقسهخر حخسسهزمث{a_end}{strong_end}. شمسخ, حمثشسث وشنث سعقث غخعق {strong_start}صثزذشو هس حمعللثي هر, فعقرثي خر, شري شممخصثي فخ بعرذفهخر هر غخعق صثز زقخصسثق (ذخووخرمغ شيتعسفشزمث هر غخعق زقخصسثق سثففهرلس).{strong_end}

source: Re-Verification
rtl: قث-دثقهبهذشفهخر

source: Identity Verification
rtl: هيثرفهفغ دثقهبهذشفهخرⱣlǝɐsǝ ɯɐʞǝ snɹǝ ʎønɹ bɹøʍsǝɹ ᴉs nddɐʇǝd ʇø ʇɥǝ {strong_start}{a_start}ɯøsʇ ɹǝɔǝnʇ ʌǝɹsᴉøn døssᴉblǝ{a_end}{strong_end}. Ⱥlsø, dlǝɐsǝ ɯɐʞǝ snɹǝ ʎønɹ {strong_start}ʍǝbɔɐɯ ᴉs dlnƃƃǝd ᴉn, ʇnɹnǝd øn, ɐnd ɐlløʍǝd ʇø ɟnnɔʇᴉøn ᴉn ʎønɹ ʍǝb bɹøʍsǝɹ (ɔøɯɯønlʎ ɐdɾnsʇɐblǝ ᴉn ʎønɹ bɹøʍsǝɹ sǝʇʇᴉnƃs).{strong_end}

source: You have already submitted your verification information. You will see a message on your dashboard when the verification process is complete (usually within 5-7 days).
rtl: غخع اشدث شمقثشيغ سعزوهففثي غخعق دثقهبهذشفهخر هربخقوشفهخر. غخع صهمم سثث ش وثسسشلث خر غخعق يشسازخشقي صاثر فاث دثقهبهذشفهخر حقخذثسس هس ذخوحمثفث (عسعشممغ صهفاهر 5-7 يشغس).

source: You cannot verify your identity at this time.
rtl: غخع ذشررخف دثقهبغ غخعق هيثرفهفغ شف فاهس فهوث.

source: Return to Your Dashboard
rtl: قثفعقر فخ غخعق يشسازخشقيɎøn ɥɐʌǝ ɐlɹǝɐdʎ snbɯᴉʇʇǝd ʎønɹ ʌǝɹᴉɟᴉɔɐʇᴉøn ᴉnɟøɹɯɐʇᴉøn. Ɏøn ʍᴉll sǝǝ ɐ ɯǝssɐƃǝ øn ʎønɹ dɐsɥbøɐɹd ʍɥǝn ʇɥǝ ʌǝɹᴉɟᴉɔɐʇᴉøn dɹøɔǝss ᴉs ɔøɯdlǝʇǝ (nsnɐllʎ ʍᴉʇɥᴉn 5-7 dɐʎs).

source: This website uses cookies to ensure you get the best experience on our website. If you continue browsing this site, we understand that you accept the use of cookies.
rtl: فاهس صثزسهفث عسثس ذخخنهثس فخ ثرسعقث غخع لثف فاث زثسف ثطحثقهثرذث خر خعق صثزسهفث. هب غخع ذخرفهرعث زقخصسهرل فاهس سهفث, صث عريثقسفشري فاشف غخع شذذثحف فاث عسث خب ذخخنهثس.

source: Got it!
rtl: لخف هف!

source: Learn more
rtl: مثشقر وخقث

source: {span_start}(active){span_end}
rtl: {span_start}(شذفهدث){span_end}Ŧɥᴉs ʍǝbsᴉʇǝ nsǝs ɔøøʞᴉǝs ʇø ǝnsnɹǝ ʎøn ƃǝʇ ʇɥǝ bǝsʇ ǝxdǝɹᴉǝnɔǝ øn ønɹ ʍǝbsᴉʇǝ. Ɨɟ ʎøn ɔønʇᴉnnǝ bɹøʍsᴉnƃ ʇɥᴉs sᴉʇǝ, ʍǝ nndǝɹsʇɐnd ʇɥɐʇ ʎøn ɐɔɔǝdʇ ʇɥǝ nsǝ øɟ ɔøøʞᴉǝs.

source: Changes
rtl: ذاشرلثس

source: {span_start}active{span_end}
rtl: {span_start}شذفهدث{span_end}

source: Course Wiki
rtl: ذخعقسث صهنه

source: Add article
rtl: شيي شقفهذمث

source: Preview Language Setting
rtl: حقثدهثص مشرلعشلث سثففهرل

source: Language Code
rtl: مشرلعشلث ذخيث

source: e.g. en for English
rtl: ث.ل. ثر بخق ثرلمهسا

source: Preview Theme
rtl: حقثدهثص فاثوث

source: All Rights Reserved
rtl: شمم قهلافس قثسثقدثي

source: Attribution
rtl: شففقهزعفهخر

source: Noncommercial
rtl: رخرذخووثقذهشم

source: No Derivatives
rtl: رخ يثقهدشفهدثس

source: Share Alike
rtl: ساشقث شمهنث

source: Creative Commons licensed content, with terms as follow:
rtl: ذقثشفهدث ذخووخرس مهذثرسثي ذخرفثرف, صهفا فثقوس شس بخممخص:

source: Some Rights Reserved
rtl: سخوث قهلافس قثسثقدثي

source: Upcoming Dates
rtl: عحذخوهرل يشفثس

source: View all course dates
rtl: دهثص شمم ذخعقسث يشفثس

source: Goal:
rtl: لخشم:

source: Edit your course goal:
rtl: ثيهف غخعق ذخعقسث لخشم:

source: Pursue a verified certificate
rtl: حعقسعث ش دثقهبهثي ذثقفهبهذشفث

source: Sample verified certificate with your name, the course title, the logo of the institution and the signatures of the instructors for this course.
rtl: سشوحمث دثقهبهثي ذثقفهبهذشفث صهفا غخعق رشوث, فاث ذخعقسث فهفمث, فاث مخلخ خب فاث هرسفهفعفهخر شري فاث سهلرشفعقثس خب فاث هرسفقعذفخقس بخق فاهس ذخعقسث.

source: Upgrade ({price})
rtl: عحلقشيث ({price})

source: Expand All
rtl: ثطحشري شمم

source: Prerequisite:
rtl: حقثقثضعهسهفث:

source: Learn About Verified Certificates
rtl: مثشقر شزخعف دثقهبهثي ذثقفهبهذشفثس

source: {platform_name} Verified Certificate
rtl: {platform_name} دثقهبهثي ذثقفهبهذشفث

source: Why upgrade?
rtl: صاغ عحلقشيث?

source: Official proof of completion
rtl: خببهذهشم حقخخب خب ذخوحمثفهخر

source: Easily shareable certificate
rtl: ثشسهمغ ساشقثشزمث ذثقفهبهذشفث

source: Proven motivator to complete the course
rtl: حقخدثر وخفهدشفخق فخ ذخوحمثفث فاث ذخعقسث

source: Certificate purchases help {platform_name} continue to offer free courses
rtl: ذثقفهبهذشفث حعقذاشسثس اثمح {platform_name} ذخرفهرعث فخ خببثق بقثث ذخعقسثس

source: How it works
rtl: اخص هف صخقنس

source: Pay the Verified Certificate upgrade fee
rtl: حشغ فاث دثقهبهثي ذثقفهبهذشفث عحلقشيث بثث

source: Verify your identity with a webcam and government-issued ID
rtl: دثقهبغ غخعق هيثرفهفغ صهفا ش صثزذشو شري لخدثقروثرف-هسسعثي هي

source: Study hard and pass the course
rtl: سفعيغ اشقي شري حشسس فاث ذخعقسث

source: Share your certificate with friends, employers, and others
rtl: ساشقث غخعق ذثقفهبهذشفث صهفا بقهثريس, ثوحمخغثقس, شري خفاثقس

source: edX Learner Stories
rtl: ثيط مثشقرثق سفخقهثسȻǝɹʇᴉɟᴉɔɐʇǝ dnɹɔɥɐsǝs ɥǝld {platform_name} ɔønʇᴉnnǝ ʇø øɟɟǝɹ ɟɹǝǝ ɔønɹsǝs

source: My certificate has helped me showcase my knowledge on my resumé - I feel like this certificate could really help me land my dream job!
rtl: وغ ذثقفهبهذشفث اشس اثمحثي وث ساخصذشسث وغ نرخصمثيلث خر وغ قثسعوé - ه بثثم مهنث فاهس ذثقفهبهذشفث ذخعمي قثشممغ اثمح وث مشري وغ يقثشو تخز!

source: {learner_name}, edX Learner
rtl: {learner_name}, ثيط مثشقرثقMʎ ɔǝɹʇᴉɟᴉɔɐʇǝ ɥɐs ɥǝldǝd ɯǝ sɥøʍɔɐsǝ ɯʎ ʞnøʍlǝdƃǝ øn ɯʎ ɹǝsnɯé - Ɨ ɟǝǝl lᴉʞǝ ʇɥᴉs ɔǝɹʇᴉɟᴉɔɐʇǝ ɔønld ɹǝɐllʎ ɥǝld ɯǝ lɐnd ɯʎ dɹǝɐɯ ɾøb!

source: I wanted to include a verified certificate on my resumé and my profile to illustrate that I am working towards this goal I have and that I have achieved something while I was unemployed.
rtl: ه صشرفثي فخ هرذمعيث ش دثقهبهثي ذثقفهبهذشفث خر وغ قثسعوé شري وغ حقخبهمث فخ هممعسفقشفث فاشف ه شو صخقنهرل فخصشقيس فاهس لخشم ه اشدث شري فاشف ه اشدث شذاهثدثي سخوثفاهرل صاهمث ه صشس عرثوحمخغثي.
