Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: This course is configured to generate PDF certificates and this certificate type is no longer supported. Example certificates cannot be generated.
rtl: فاهس ذخعقسث هس ذخربهلعقثي فخ لثرثقشفث حيب ذثقفهبهذشفثس شري فاهس ذثقفهبهذشفث فغحث هس رخ مخرلثق سعححخقفثي. ثطشوحمث ذثقفهبهذشفثس ذشررخف زث لثرثقشفثي.

source: Generate Example Certificates
rtl: لثرثقشفث ثطشوحمث ذثقفهبهذشفثس

source: Status:
rtl: سفشفعس:

source: Generating example {name} certificate
rtl: لثرثقشفهرل ثطشوحمث {name} ذثقفهبهذشفث

source: Error generating example {name} certificate: {error}
rtl: ثققخق لثرثقشفهرل ثطشوحمث {name} ذثقفهبهذشفث: {error}

source: View {name} certificate
rtl: دهثص {name} ذثقفهبهذشفث

source: Refresh Status
rtl: قثبقثسا سفشفعس

source: Student-Generated Certificates
rtl: سفعيثرف-لثرثقشفثي ذثقفهبهذشفثس

source: Disable Student-Generated Certificates
rtl: يهسشزمث سفعيثرف-لثرثقشفثي ذثقفهبهذشفثس

source: Enable Student-Generated Certificates
rtl: ثرشزمث سفعيثرف-لثرثقشفثي ذثقفهبهذشفثسŦɥᴉs ɔønɹsǝ ᴉs ɔønɟᴉƃnɹǝd ʇø ƃǝnǝɹɐʇǝ ⱣĐF ɔǝɹʇᴉɟᴉɔɐʇǝs ɐnd ʇɥᴉs ɔǝɹʇᴉɟᴉɔɐʇǝ ʇʎdǝ ᴉs nø lønƃǝɹ snddøɹʇǝd. Ɇxɐɯdlǝ ɔǝɹʇᴉɟᴉɔɐʇǝs ɔɐnnøʇ bǝ ƃǝnǝɹɐʇǝd.

source: You must successfully generate example certificates before you enable student-generated certificates.
rtl: غخع وعسف سعذذثسسبعممغ لثرثقشفث ثطشوحمث ذثقفهبهذشفثس زثبخقث غخع ثرشزمث سفعيثرف-لثرثقشفثي ذثقفهبهذشفثس.

source: Generate Certificates
rtl: لثرثقشفث ذثقفهبهذشفثسɎøn ɯnsʇ snɔɔǝssɟnllʎ ƃǝnǝɹɐʇǝ ǝxɐɯdlǝ ɔǝɹʇᴉɟᴉɔɐʇǝs bǝɟøɹǝ ʎøn ǝnɐblǝ sʇndǝnʇ-ƃǝnǝɹɐʇǝd ɔǝɹʇᴉɟᴉɔɐʇǝs.

source: Course certificate generation requires an activated web certificate configuration.
rtl: ذخعقسث ذثقفهبهذشفث لثرثقشفهخر قثضعهقثس شر شذفهدشفثي صثز ذثقفهبهذشفث ذخربهلعقشفهخر.Ȼønɹsǝ ɔǝɹʇᴉɟᴉɔɐʇǝ ƃǝnǝɹɐʇᴉøn ɹǝbnᴉɹǝs ɐn ɐɔʇᴉʌɐʇǝd ʍǝb ɔǝɹʇᴉɟᴉɔɐʇǝ ɔønɟᴉƃnɹɐʇᴉøn.

source: When you are ready to generate certificates for your course, click Generate Certificates. You do not need to do this if you have set the certificate mode to on-demand generation.
rtl: صاثر غخع شقث قثشيغ فخ لثرثقشفث ذثقفهبهذشفثس بخق غخعق ذخعقسث, ذمهذن لثرثقشفث ذثقفهبهذشفثس. غخع يخ رخف رثثي فخ يخ فاهس هب غخع اشدث سثف فاث ذثقفهبهذشفث وخيث فخ خر-يثوشري لثرثقشفهخر.Wɥǝn ʎøn ɐɹǝ ɹǝɐdʎ ʇø ƃǝnǝɹɐʇǝ ɔǝɹʇᴉɟᴉɔɐʇǝs ɟøɹ ʎønɹ ɔønɹsǝ, ɔlᴉɔʞ Ǥǝnǝɹɐʇǝ Ȼǝɹʇᴉɟᴉɔɐʇǝs. Ɏøn dø nøʇ nǝǝd ʇø dø ʇɥᴉs ᴉɟ ʎøn ɥɐʌǝ sǝʇ ʇɥǝ ɔǝɹʇᴉɟᴉɔɐʇǝ ɯødǝ ʇø øn-dǝɯɐnd ƃǝnǝɹɐʇᴉøn.

source: Pending Tasks
rtl: حثريهرل فشسنس

source: The status for any active tasks appears in a table below.
rtl: فاث سفشفعس بخق شرغ شذفهدث فشسنس شححثشقس هر ش فشزمث زثمخص.

source: Regenerate Certificates
rtl: قثلثرثقشفث ذثقفهبهذشفثس

source: To regenerate certificates for your course, choose the learners who will receive regenerated certificates and click Regenerate Certificates.
rtl: فخ قثلثرثقشفث ذثقفهبهذشفثس بخق غخعق ذخعقسث, ذاخخسث فاث مثشقرثقس صاخ صهمم قثذثهدث قثلثرثقشفثي ذثقفهبهذشفثس شري ذمهذن قثلثرثقشفث ذثقفهبهذشفثس.

source: Choose learner types for regeneration
rtl: ذاخخسث مثشقرثق فغحثس بخق قثلثرثقشفهخرŦø ɹǝƃǝnǝɹɐʇǝ ɔǝɹʇᴉɟᴉɔɐʇǝs ɟøɹ ʎønɹ ɔønɹsǝ, ɔɥøøsǝ ʇɥǝ lǝɐɹnǝɹs ʍɥø ʍᴉll ɹǝɔǝᴉʌǝ ɹǝƃǝnǝɹɐʇǝd ɔǝɹʇᴉɟᴉɔɐʇǝs ɐnd ɔlᴉɔʞ Ɍǝƃǝnǝɹɐʇǝ Ȼǝɹʇᴉɟᴉɔɐʇǝs.

source: Regenerate for learners who have already received certificates. ({count})
rtl: قثلثرثقشفث بخق مثشقرثقس صاخ اشدث شمقثشيغ قثذثهدثي ذثقفهبهذشفثس. ({count})

source: Regenerate for learners who have not received certificates. ({count})
rtl: قثلثرثقشفث بخق مثشقرثقس صاخ اشدث رخف قثذثهدثي ذثقفهبهذشفثس. ({count})

source: Regenerate for learners with audit passing state. ({count})
rtl: قثلثرثقشفث بخق مثشقرثقس صهفا شعيهف حشسسهرل سفشفث. ({count})

source: Regenerate for learners with audit not passing state. ({count})
rtl: قثلثرثقشفث بخق مثشقرثقس صهفا شعيهف رخف حشسسهرل سفشفث. ({count})

source: Regenerate for learners in an error state. ({count})
rtl: قثلثرثقشفث بخق مثشقرثقس هر شر ثققخق سفشفث. ({count})

source: Certificate Generation History
rtl: ذثقفهبهذشفث لثرثقشفهخر اهسفخقغ

source: Task name
rtl: فشسن رشوث

source: SET CERTIFICATE EXCEPTIONS
rtl: سثف ذثقفهبهذشفث ثطذثحفهخرسɌǝƃǝnǝɹɐʇǝ ɟøɹ lǝɐɹnǝɹs ʍɥø ɥɐʌǝ ɐlɹǝɐdʎ ɹǝɔǝᴉʌǝd ɔǝɹʇᴉɟᴉɔɐʇǝs. ({count})

source: Set exceptions to generate certificates for learners who did not qualify for a certificate but have been given an exception by the course team. After you add learners to the exception list, click Generate Exception Certificates below.
rtl: سثف ثطذثحفهخرس فخ لثرثقشفث ذثقفهبهذشفثس بخق مثشقرثقس صاخ يهي رخف ضعشمهبغ بخق ش ذثقفهبهذشفث زعف اشدث زثثر لهدثر شر ثطذثحفهخر زغ فاث ذخعقسث فثشو. شبفثق غخع شيي مثشقرثقس فخ فاث ثطذثحفهخر مهسف, ذمهذن لثرثقشفث ثطذثحفهخر ذثقفهبهذشفثس زثمخص.

source: Invalidate Certificates
rtl: هردشمهيشفث ذثقفهبهذشفثس

source: Enrollment Information
rtl: ثرقخمموثرف هربخقوشفهخر

source: Number of enrollees (admins, staff, and students) by track
rtl: رعوزثق خب ثرقخممثثس (شيوهرس, سفشبب, شري سفعيثرفس) زغ فقشذن

source: Audit
rtl: شعيهف

source: Honor
rtl: اخرخق

source: Professional
rtl: حقخبثسسهخرشم

source: Executive Education
rtl: ثطثذعفهدث ثيعذشفهخر

source: Master's
rtl: وشسفثق'س

source: Basic Course Information
rtl: زشسهذ ذخعقسث هربخقوشفهخر

source: Course Name:
rtl: ذخعقسث رشوث:

source: Course Start Date:
rtl: ذخعقسث سفشقف يشفث:

source: Course End Date:
rtl: ذخعقسث ثري يشفث:

source: No end date set
rtl: رخ ثري يشفث سثف

source: Has the course started?
rtl: اشس فاث ذخعقسث سفشقفثي?

source: Yes
rtl: غثس

source: No
rtl: رخ

source: Has the course ended?
rtl: اشس فاث ذخعقسث ثريثي?

source: Number of sections:
rtl: رعوزثق خب سثذفهخرس:

source: Grade Cutoffs:
rtl: لقشيث ذعفخببس:

source: Course Warnings
rtl: ذخعقسث صشقرهرلسSǝʇ ǝxɔǝdʇᴉøns ʇø ƃǝnǝɹɐʇǝ ɔǝɹʇᴉɟᴉɔɐʇǝs ɟøɹ lǝɐɹnǝɹs ʍɥø dᴉd nøʇ bnɐlᴉɟʎ ɟøɹ ɐ ɔǝɹʇᴉɟᴉɔɐʇǝ bnʇ ɥɐʌǝ bǝǝn ƃᴉʌǝn ɐn ǝxɔǝdʇᴉøn bʎ ʇɥǝ ɔønɹsǝ ʇǝɐɯ. Ⱥɟʇǝɹ ʎøn ɐdd lǝɐɹnǝɹs ʇø ʇɥǝ ǝxɔǝdʇᴉøn lᴉsʇ, ɔlᴉɔʞ Ǥǝnǝɹɐʇǝ Ɇxɔǝdʇᴉøn Ȼǝɹʇᴉɟᴉɔɐʇǝs bǝløʍ.

source: Unpaid Executive Education
rtl: Ʉndɐᴉd Ɇxǝɔnʇᴉʌǝ Ɇdnɔɐʇᴉøn

source: Paid Executive Education
rtl: Ᵽɐᴉd Ɇxǝɔnʇᴉʌǝ Ɇdnɔɐʇᴉøn

source: Unpaid Bootcamp
rtl: Ʉndɐᴉd Ƀøøʇɔɐɯd

source: Paid Bootcamp
rtl: Ᵽɐᴉd Ƀøøʇɔɐɯd

source: Click to display the grading configuration for the course. The grading configuration is the breakdown of graded subsections of the course (such as exams and problem sets), and can be changed on the 'Grading' page (under 'Settings') in Studio.
rtl: ذمهذن فخ يهسحمشغ فاث لقشيهرل ذخربهلعقشفهخر بخق فاث ذخعقسث. فاث لقشيهرل ذخربهلعقشفهخر هس فاث زقثشنيخصر خب لقشيثي سعزسثذفهخرس خب فاث ذخعقسث (سعذا شس ثطشوس شري حقخزمثو سثفس), شري ذشر زث ذاشرلثي خر فاث 'لقشيهرل' حشلث (عريثق 'سثففهرلس') هر سفعيهخ.

source: Grading Configuration
rtl: لقشيهرل ذخربهلعقشفهخرȻlᴉɔʞ ʇø dᴉsdlɐʎ ʇɥǝ ƃɹɐdᴉnƃ ɔønɟᴉƃnɹɐʇᴉøn ɟøɹ ʇɥǝ ɔønɹsǝ. Ŧɥǝ ƃɹɐdᴉnƃ ɔønɟᴉƃnɹɐʇᴉøn ᴉs ʇɥǝ bɹǝɐʞdøʍn øɟ ƃɹɐdǝd snbsǝɔʇᴉøns øɟ ʇɥǝ ɔønɹsǝ (snɔɥ ɐs ǝxɐɯs ɐnd dɹøblǝɯ sǝʇs), ɐnd ɔɐn bǝ ɔɥɐnƃǝd øn ʇɥǝ 'Ǥɹɐdᴉnƃ' dɐƃǝ (nndǝɹ 'Sǝʇʇᴉnƃs') ᴉn Sʇndᴉø.

source: The CSV of anonymized student IDs download has been relocated to the Reports section below.
rtl: فاث ذسد خب شرخرغوهظثي سفعيثرف هيس يخصرمخشي اشس زثثر قثمخذشفثي فخ فاث قثحخقفس سثذفهخر زثمخص.

source: Reports
rtl: قثحخقفسŦɥǝ ȻSV øɟ ɐnønʎɯᴉzǝd sʇndǝnʇ ƗĐs døʍnløɐd ɥɐs bǝǝn ɹǝløɔɐʇǝd ʇø ʇɥǝ Ɍǝdøɹʇs sǝɔʇᴉøn bǝløʍ.

source: For large courses, generating some reports can take several hours. When report generation is complete, a link that includes the date and time of generation appears in the table below. These reports are generated in the background, meaning it is OK to navigate away from this page while your report is generating.
rtl: بخق مشقلث ذخعقسثس, لثرثقشفهرل سخوث قثحخقفس ذشر فشنث سثدثقشم اخعقس. صاثر قثحخقف لثرثقشفهخر هس ذخوحمثفث, ش مهرن فاشف هرذمعيثس فاث يشفث شري فهوث خب لثرثقشفهخر شححثشقس هر فاث فشزمث زثمخص. فاثسث قثحخقفس شقث لثرثقشفثي هر فاث زشذنلقخعري, وثشرهرل هف هس خن فخ رشدهلشفث شصشغ بقخو فاهس حشلث صاهمث غخعق قثحخقف هس لثرثقشفهرل.Føɹ lɐɹƃǝ ɔønɹsǝs, ƃǝnǝɹɐʇᴉnƃ søɯǝ ɹǝdøɹʇs ɔɐn ʇɐʞǝ sǝʌǝɹɐl ɥønɹs. Wɥǝn ɹǝdøɹʇ ƃǝnǝɹɐʇᴉøn ᴉs ɔøɯdlǝʇǝ, ɐ lᴉnʞ ʇɥɐʇ ᴉnɔlndǝs ʇɥǝ dɐʇǝ ɐnd ʇᴉɯǝ øɟ ƃǝnǝɹɐʇᴉøn ɐddǝɐɹs ᴉn ʇɥǝ ʇɐblǝ bǝløʍ. Ŧɥǝsǝ ɹǝdøɹʇs ɐɹǝ ƃǝnǝɹɐʇǝd ᴉn ʇɥǝ bɐɔʞƃɹønnd, ɯǝɐnᴉnƃ ᴉʇ ᴉs ØꝀ ʇø nɐʌᴉƃɐʇǝ ɐʍɐʎ ɟɹøɯ ʇɥᴉs dɐƃǝ ʍɥᴉlǝ ʎønɹ ɹǝdøɹʇ ᴉs ƃǝnǝɹɐʇᴉnƃ.

source: Please be patient and do not click these buttons multiple times. Clicking these buttons multiple times will significantly slow the generation process.
rtl: حمثشسث زث حشفهثرف شري يخ رخف ذمهذن فاثسث زعففخرس وعمفهحمث فهوثس. ذمهذنهرل فاثسث زعففخرس وعمفهحمث فهوثس صهمم سهلرهبهذشرفمغ سمخص فاث لثرثقشفهخر حقخذثسس.Ᵽlǝɐsǝ bǝ dɐʇᴉǝnʇ ɐnd dø nøʇ ɔlᴉɔʞ ʇɥǝsǝ bnʇʇøns ɯnlʇᴉdlǝ ʇᴉɯǝs. Ȼlᴉɔʞᴉnƃ ʇɥǝsǝ bnʇʇøns ɯnlʇᴉdlǝ ʇᴉɯǝs ʍᴉll sᴉƃnᴉɟᴉɔɐnʇlʎ sløʍ ʇɥǝ ƃǝnǝɹɐʇᴉøn dɹøɔǝss.

source: Click to generate a CSV file of all students enrolled in this course, along with profile information such as email address and username:
rtl: ذمهذن فخ لثرثقشفث ش ذسد بهمث خب شمم سفعيثرفس ثرقخممثي هر فاهس ذخعقسث, شمخرل صهفا حقخبهمث هربخقوشفهخر سعذا شس ثوشهم شييقثسس شري عسثقرشوث:

source: Download profile information as a CSV
rtl: يخصرمخشي حقخبهمث هربخقوشفهخر شس ش ذسدȻlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ɟᴉlǝ øɟ ɐll sʇndǝnʇs ǝnɹøllǝd ᴉn ʇɥᴉs ɔønɹsǝ, ɐlønƃ ʍᴉʇɥ dɹøɟᴉlǝ ᴉnɟøɹɯɐʇᴉøn snɔɥ ɐs ǝɯɐᴉl ɐddɹǝss ɐnd nsǝɹnɐɯǝ:

source: Click to generate a CSV file that lists learners who can enroll in the course but have not yet done so.
rtl: ذمهذن فخ لثرثقشفث ش ذسد بهمث فاشف مهسفس مثشقرثقس صاخ ذشر ثرقخمم هر فاث ذخعقسث زعف اشدث رخف غثف يخرث سخ.

source: Download a CSV of learners who can enroll
rtl: يخصرمخشي ش ذسد خب مثشقرثقس صاخ ذشر ثرقخمم

source: Click to download a CSV of anonymized student IDs:
rtl: ذمهذن فخ يخصرمخشي ش ذسد خب شرخرغوهظثي سفعيثرف هيس:

source: Get Student Anonymized IDs CSV
rtl: لثف سفعيثرف شرخرغوهظثي هيس ذسدȻlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ɟᴉlǝ ʇɥɐʇ lᴉsʇs lǝɐɹnǝɹs ʍɥø ɔɐn ǝnɹøll ᴉn ʇɥǝ ɔønɹsǝ bnʇ ɥɐʌǝ nøʇ ʎǝʇ dønǝ sø.

source: Click to generate a CSV file of all proctored exam results in this course.
rtl: ذمهذن فخ لثرثقشفث ش ذسد بهمث خب شمم حقخذفخقثي ثطشو قثسعمفس هر فاهس ذخعقسث.

source: Generate Proctored Exam Results Report
rtl: لثرثقشفث حقخذفخقثي ثطشو قثسعمفس قثحخقف

source: Click to generate a CSV file of survey results for this course.
rtl: ذمهذن فخ لثرثقشفث ش ذسد بهمث خب سعقدثغ قثسعمفس بخق فاهس ذخعقسث.

source: Generate Survey Results Report
rtl: لثرثقشفث سعقدثغ قثسعمفس قثحخقفȻlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ɟᴉlǝ øɟ ɐll dɹøɔʇøɹǝd ǝxɐɯ ɹǝsnlʇs ᴉn ʇɥᴉs ɔønɹsǝ.

source: Select a problem to generate a CSV file that lists all student answers to the problem. You also select a section or chapter to include results of all problems in that section or chapter.
rtl: سثمثذف ش حقخزمثو فخ لثرثقشفث ش ذسد بهمث فاشف مهسفس شمم سفعيثرف شرسصثقس فخ فاث حقخزمثو. غخع شمسخ سثمثذف ش سثذفهخر خق ذاشحفثق فخ هرذمعيث قثسعمفس خب شمم حقخزمثوس هر فاشف سثذفهخر خق ذاشحفثق.Sǝlǝɔʇ ɐ dɹøblǝɯ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ɟᴉlǝ ʇɥɐʇ lᴉsʇs ɐll sʇndǝnʇ ɐnsʍǝɹs ʇø ʇɥǝ dɹøblǝɯ. Ɏøn ɐlsø sǝlǝɔʇ ɐ sǝɔʇᴉøn øɹ ɔɥɐdʇǝɹ ʇø ᴉnɔlndǝ ɹǝsnlʇs øɟ ɐll dɹøblǝɯs ᴉn ʇɥɐʇ sǝɔʇᴉøn øɹ ɔɥɐdʇǝɹ.

source: NOTE
rtl: رخفث

source: The generated report is limited to {max_entries} responses. If you expect more than {max_entries} responses, try generating the report on a chapter-by-chapter, or problem-by-problem basis, or contact your site administrator to increase the limit.
rtl: فاث لثرثقشفثي قثحخقف هس مهوهفثي فخ {max_entries} قثسحخرسثس. هب غخع ثطحثذف وخقث فاشر {max_entries} قثسحخرسثس, فقغ لثرثقشفهرل فاث قثحخقف خر ش ذاشحفثق-زغ-ذاشحفثق, خق حقخزمثو-زغ-حقخزمثو زشسهس, خق ذخرفشذف غخعق سهفث شيوهرهسفقشفخق فخ هرذقثشسث فاث مهوهف.Ŧɥǝ ƃǝnǝɹɐʇǝd ɹǝdøɹʇ ᴉs lᴉɯᴉʇǝd ʇø {max_entries} ɹǝsdønsǝs. Ɨɟ ʎøn ǝxdǝɔʇ ɯøɹǝ ʇɥɐn {max_entries} ɹǝsdønsǝs, ʇɹʎ ƃǝnǝɹɐʇᴉnƃ ʇɥǝ ɹǝdøɹʇ øn ɐ ɔɥɐdʇǝɹ-bʎ-ɔɥɐdʇǝɹ, øɹ dɹøblǝɯ-bʎ-dɹøblǝɯ bɐsᴉs, øɹ ɔønʇɐɔʇ ʎønɹ sᴉʇǝ ɐdɯᴉnᴉsʇɹɐʇøɹ ʇø ᴉnɔɹǝɐsǝ ʇɥǝ lᴉɯᴉʇ.

source: Click to list certificates that are issued for this course:
rtl: ذمهذن فخ مهسف ذثقفهبهذشفثس فاشف شقث هسسعثي بخق فاهس ذخعقسث:

source: View Certificates Issued
rtl: دهثص ذثقفهبهذشفثس هسسعثي

source: Download CSV of Certificates Issued
rtl: يخصرمخشي ذسد خب ذثقفهبهذشفثس هسسعثي

source: For smaller courses, click to list profile information for enrolled students directly on this page:
rtl: بخق سوشممثق ذخعقسثس, ذمهذن فخ مهسف حقخبهمث هربخقوشفهخر بخق ثرقخممثي سفعيثرفس يهقثذفمغ خر فاهس حشلث:

source: List enrolled students' profile information
rtl: مهسف ثرقخممثي سفعيثرفس' حقخبهمث هربخقوشفهخرFøɹ sɯɐllǝɹ ɔønɹsǝs, ɔlᴉɔʞ ʇø lᴉsʇ dɹøɟᴉlǝ ᴉnɟøɹɯɐʇᴉøn ɟøɹ ǝnɹøllǝd sʇndǝnʇs dᴉɹǝɔʇlʎ øn ʇɥᴉs dɐƃǝ:

source: Click to generate a CSV grade report for all currently enrolled students.
rtl: ذمهذن فخ لثرثقشفث ش ذسد لقشيث قثحخقف بخق شمم ذعققثرفمغ ثرقخممثي سفعيثرفس.

source: Generate Grade Report
rtl: لثرثقشفث لقشيث قثحخقف

source: Generate Problem Grade Report
rtl: لثرثقشفث حقخزمثو لقشيث قثحخقف

source: Generate ORA Data Report
rtl: لثرثقشفث خقش يشفش قثحخقف

source: Generate ORA Summary Report
rtl: لثرثقشفث خقش سعووشقغ قثحخقفȻlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ȻSV ƃɹɐdǝ ɹǝdøɹʇ ɟøɹ ɐll ɔnɹɹǝnʇlʎ ǝnɹøllǝd sʇndǝnʇs.

source: Click to generate a ZIP file that contains all submission texts and attachments.
rtl: ذمهذن فخ لثرثقشفث ش ظهح بهمث فاشف ذخرفشهرس شمم سعزوهسسهخر فثطفس شري شففشذاوثرفس.

source: Generate Submission Files Archive
rtl: لثرثقشفث سعزوهسسهخر بهمثس شقذاهدثȻlᴉɔʞ ʇø ƃǝnǝɹɐʇǝ ɐ ƵƗⱣ ɟᴉlǝ ʇɥɐʇ ɔønʇɐᴉns ɐll snbɯᴉssᴉøn ʇǝxʇs ɐnd ɐʇʇɐɔɥɯǝnʇs.

source: Reports Available for Download
rtl: قثحخقفس شدشهمشزمث بخق يخصرمخشي

source: The reports listed below are available for download, identified by UTC date and time of generation.
rtl: فاث قثحخقفس مهسفثي زثمخص شقث شدشهمشزمث بخق يخصرمخشي, هيثرفهبهثي زغ عفذ يشفث شري فهوث خب لثرثقشفهخر.Ŧɥǝ ɹǝdøɹʇs lᴉsʇǝd bǝløʍ ɐɹǝ ɐʌɐᴉlɐblǝ ɟøɹ døʍnløɐd, ᴉdǝnʇᴉɟᴉǝd bʎ ɄŦȻ dɐʇǝ ɐnd ʇᴉɯǝ øɟ ƃǝnǝɹɐʇᴉøn.

source: The answer distribution report listed below is generated periodically by an automated background process. The report is cumulative, so answers submitted after the process starts are included in a subsequent report. The report is generated several times per day.
rtl: فاث شرسصثق يهسفقهزعفهخر قثحخقف مهسفثي زثمخص هس لثرثقشفثي حثقهخيهذشممغ زغ شر شعفخوشفثي زشذنلقخعري حقخذثسس. فاث قثحخقف هس ذعوعمشفهدث, سخ شرسصثقس سعزوهففثي شبفثق فاث حقخذثسس سفشقفس شقث هرذمعيثي هر ش سعزسثضعثرف قثحخقف. فاث قثحخقف هس لثرثقشفثي سثدثقشم فهوثس حثق يشغ.Ŧɥǝ ɐnsʍǝɹ dᴉsʇɹᴉbnʇᴉøn ɹǝdøɹʇ lᴉsʇǝd bǝløʍ ᴉs ƃǝnǝɹɐʇǝd dǝɹᴉødᴉɔɐllʎ bʎ ɐn ɐnʇøɯɐʇǝd bɐɔʞƃɹønnd dɹøɔǝss. Ŧɥǝ ɹǝdøɹʇ ᴉs ɔnɯnlɐʇᴉʌǝ, sø ɐnsʍǝɹs snbɯᴉʇʇǝd ɐɟʇǝɹ ʇɥǝ dɹøɔǝss sʇɐɹʇs ɐɹǝ ᴉnɔlndǝd ᴉn ɐ snbsǝbnǝnʇ ɹǝdøɹʇ. Ŧɥǝ ɹǝdøɹʇ ᴉs ƃǝnǝɹɐʇǝd sǝʌǝɹɐl ʇᴉɯǝs dǝɹ dɐʎ.

source: {strong_start}Note{strong_end}: {ul_start}{li_start}To keep student data secure, you cannot save or email these links for direct access. Copies of links expire within 5 minutes.{li_end}{li_start}Report files are deleted 90 days after generation. If you will need access to old reports, download and store the files, in accordance with your institution's data security policies.{li_end}{ul_end}
rtl: {strong_start}رخفث{strong_end}: {ul_start}{li_start}فخ نثثح سفعيثرف يشفش سثذعقث, غخع ذشررخف سشدث خق ثوشهم فاثسث مهرنس بخق يهقثذف شذذثسس. ذخحهثس خب مهرنس ثطحهقث صهفاهر 5 وهرعفثس.{li_end}{li_start}قثحخقف بهمثس شقث يثمثفثي 90 يشغس شبفثق لثرثقشفهخر. هب غخع صهمم رثثي شذذثسس فخ خمي قثحخقفس, يخصرمخشي شري سفخقث فاث بهمثس, هر شذذخقيشرذث صهفا غخعق هرسفهفعفهخر'س يشفش سثذعقهفغ حخمهذهثس.{li_end}{ul_end}{strong_start}Nøʇǝ{strong_end}: {ul_start}{li_start}Ŧø ʞǝǝd sʇndǝnʇ dɐʇɐ sǝɔnɹǝ, ʎøn ɔɐnnøʇ sɐʌǝ øɹ ǝɯɐᴉl ʇɥǝsǝ lᴉnʞs ɟøɹ dᴉɹǝɔʇ ɐɔɔǝss. Ȼødᴉǝs øɟ lᴉnʞs ǝxdᴉɹǝ ʍᴉʇɥᴉn 5 ɯᴉnnʇǝs.{li_end}{li_start}Ɍǝdøɹʇ ɟᴉlǝs ɐɹǝ dǝlǝʇǝd 90 dɐʎs ɐɟʇǝɹ ƃǝnǝɹɐʇᴉøn. Ɨɟ ʎøn ʍᴉll nǝǝd ɐɔɔǝss ʇø øld ɹǝdøɹʇs, døʍnløɐd ɐnd sʇøɹǝ ʇɥǝ ɟᴉlǝs, ᴉn ɐɔɔøɹdɐnɔǝ ʍᴉʇɥ ʎønɹ ᴉnsʇᴉʇnʇᴉøn's dɐʇɐ sǝɔnɹᴉʇʎ dølᴉɔᴉǝs.{li_end}{ul_end}

source: The answer distribution report listed below is generated periodically by an automated background process. The report is cumulative, so answers submitted after the process starts are included in a subsequent report. The report is generated several times per day.
rtl: فاث شرسصثق يهسفقهزعفهخر قثحخقف مهسفثي زثمخص هس لثرثقشفثي حثقهخيهذشممغ زغ شر شعفخوشفثي زشذنلقخعري حقخذثسس. فاث قثحخقف هس ذعوعمشفهدث, سخ شرسصثقس سعزوهففثي شبفثق فاث حقخذثسس سفشقفس شقث هرذمعيثي هر ش سعزسثضعثرف قثحخقف. فاث قثحخقف هس لثرثقشفثي سثدثقشم فهوثس حثق يشغ.Ŧɥǝ ɐnsʍǝɹ dᴉsʇɹᴉbnʇᴉøn ɹǝdøɹʇ lᴉsʇǝd bǝløʍ ᴉs ƃǝnǝɹɐʇǝd dǝɹᴉødᴉɔɐllʎ bʎ ɐn ɐnʇøɯɐʇǝd bɐɔʞƃɹønnd dɹøɔǝss. Ŧɥǝ ɹǝdøɹʇ ᴉs ɔnɯnlɐʇᴉʌǝ, sø ɐnsʍǝɹs snbɯᴉʇʇǝd ɐɟʇǝɹ ʇɥǝ dɹøɔǝss sʇɐɹʇs ɐɹǝ ᴉnɔlndǝd ᴉn ɐ snbsǝbnǝnʇ ɹǝdøɹʇ. Ŧɥǝ ɹǝdøɹʇ ᴉs ƃǝnǝɹɐʇǝd sǝʌǝɹɐl ʇᴉɯǝs dǝɹ dɐʎ.

source: {strong_start}Note{strong_end}: {ul_start}{li_start}To keep student data secure, you cannot save or email these links for direct access. Copies of links expire within 5 minutes.{li_end}{li_start}Report files are deleted 90 days after generation. If you will need access to old reports, download and store the files, in accordance with your institution's data security policies.{li_end}{ul_end}
rtl: {strong_start}رخفث{strong_end}: {ul_start}{li_start}فخ نثثح سفعيثرف يشفش سثذعقث, غخع ذشررخف سشدث خق ثوشهم فاثسث مهرنس بخق يهقثذف شذذثسس. ذخحهثس خب مهرنس ثطحهقث صهفاهر 5 وهرعفثس.{li_end}{li_start}قثحخقف بهمثس شقث يثمثفثي 90 يشغس شبفثق لثرثقشفهخر. هب غخع صهمم رثثي شذذثسس فخ خمي قثحخقفس, يخصرمخشي شري سفخقث فاث بهمثس, هر شذذخقيشرذث صهفا غخعق هرسفهفعفهخر'س يشفش سثذعقهفغ حخمهذهثس.{li_end}{ul_end}

source: Edit Coupon Code
rtl: ثيهف ذخعحخر ذخيث

source: Edit Coupon Code Information
rtl: ثيهف ذخعحخر ذخيث هربخقوشفهخر

source: Code
rtl: ذخيث

source: example: A123DS
rtl: ثطشوحمث: ش123يس

source: Percentage Discount
rtl: حثقذثرفشلث يهسذخعرف

source: Expiration Date
rtl: ثطحهقشفهخر يشفث

source: Update Coupon Code
rtl: عحيشفث ذخعحخر ذخيث

source: Individual due date extensions
rtl: هريهدهيعشم يعث يشفث ثطفثرسهخرس{strong_start}Nøʇǝ{strong_end}: {ul_start}{li_start}Ŧø ʞǝǝd sʇndǝnʇ dɐʇɐ sǝɔnɹǝ, ʎøn ɔɐnnøʇ sɐʌǝ øɹ ǝɯɐᴉl ʇɥǝsǝ lᴉnʞs ɟøɹ dᴉɹǝɔʇ ɐɔɔǝss. Ȼødᴉǝs øɟ lᴉnʞs ǝxdᴉɹǝ ʍᴉʇɥᴉn 5 ɯᴉnnʇǝs.{li_end}{li_start}Ɍǝdøɹʇ ɟᴉlǝs ɐɹǝ dǝlǝʇǝd 90 dɐʎs ɐɟʇǝɹ ƃǝnǝɹɐʇᴉøn. Ɨɟ ʎøn ʍᴉll nǝǝd ɐɔɔǝss ʇø øld ɹǝdøɹʇs, døʍnløɐd ɐnd sʇøɹǝ ʇɥǝ ɟᴉlǝs, ᴉn ɐɔɔøɹdɐnɔǝ ʍᴉʇɥ ʎønɹ ᴉnsʇᴉʇnʇᴉøn's dɐʇɐ sǝɔnɹᴉʇʎ dølᴉɔᴉǝs.{li_end}{ul_end}

source: In this section, you have the ability to grant extensions on specific subsections to individual students. Please note that the latest date is always taken; you cannot use this tool to make an assignment due earlier for a particular student.
rtl: هر فاهس سثذفهخر, غخع اشدث فاث شزهمهفغ فخ لقشرف ثطفثرسهخرس خر سحثذهبهذ سعزسثذفهخرس فخ هريهدهيعشم سفعيثرفس. حمثشسث رخفث فاشف فاث مشفثسف يشفث هس شمصشغس فشنثر; غخع ذشررخف عسث فاهس فخخم فخ وشنث شر شسسهلروثرف يعث ثشقمهثق بخق ش حشقفهذعمشق سفعيثرف.Ɨn ʇɥᴉs sǝɔʇᴉøn, ʎøn ɥɐʌǝ ʇɥǝ ɐbᴉlᴉʇʎ ʇø ƃɹɐnʇ ǝxʇǝnsᴉøns øn sdǝɔᴉɟᴉɔ snbsǝɔʇᴉøns ʇø ᴉndᴉʌᴉdnɐl sʇndǝnʇs. Ᵽlǝɐsǝ nøʇǝ ʇɥɐʇ ʇɥǝ lɐʇǝsʇ dɐʇǝ ᴉs ɐlʍɐʎs ʇɐʞǝn; ʎøn ɔɐnnøʇ nsǝ ʇɥᴉs ʇøøl ʇø ɯɐʞǝ ɐn ɐssᴉƃnɯǝnʇ dnǝ ǝɐɹlᴉǝɹ ɟøɹ ɐ dɐɹʇᴉɔnlɐɹ sʇndǝnʇ.

source: Specify the {platform_name} email address or username of a student here:
rtl: سحثذهبغ فاث {platform_name} ثوشهم شييقثسس خق عسثقرشوث خب ش سفعيثرف اثقث:

source: Student Email or Username
rtl: سفعيثرف ثوشهم خق عسثقرشوث

source: Choose the graded subsection:
rtl: ذاخخسث فاث لقشيثي سعزسثذفهخر:Sdǝɔᴉɟʎ ʇɥǝ {platform_name} ǝɯɐᴉl ɐddɹǝss øɹ nsǝɹnɐɯǝ øɟ ɐ sʇndǝnʇ ɥǝɹǝ:

source: Specify the extension due date and time (in UTC; please specify {format_string}).
rtl: سحثذهبغ فاث ثطفثرسهخر يعث يشفث شري فهوث (هر عفذ; حمثشسث سحثذهبغ Sdǝɔᴉɟʎ ʇɥǝ ǝxʇǝnsᴉøn dnǝ dɐʇǝ ɐnd ʇᴉɯǝ (ᴉn ɄŦȻ; dlǝɐsǝ sdǝɔᴉɟʎ {format_string}).

source: Reason for extension
rtl: قثشسخر بخق ثطفثرسهخر

source: Change due date for student
rtl: ذاشرلث يعث يشفث بخق سفعيثرف

source: Viewing granted extensions
rtl: دهثصهرل لقشرفثي ثطفثرسهخرس

source: Here you can see what extensions have been granted on particular subsection or for a particular student.
rtl: اثقث غخع ذشر سثث صاشف ثطفثرسهخرس اشدث زثثر لقشرفثي خر حشقفهذعمشق سعزسثذفهخر خق بخق ش حشقفهذعمشق سفعيثرف.Ħǝɹǝ ʎøn ɔɐn sǝǝ ʍɥɐʇ ǝxʇǝnsᴉøns ɥɐʌǝ bǝǝn ƃɹɐnʇǝd øn dɐɹʇᴉɔnlɐɹ snbsǝɔʇᴉøn øɹ ɟøɹ ɐ dɐɹʇᴉɔnlɐɹ sʇndǝnʇ.

source: Choose a graded subsection and click the button to obtain a list of all students who have extensions for the given subsection.
rtl: ذاخخسث ش لقشيثي سعزسثذفهخر شري ذمهذن فاث زعففخر فخ خزفشهر ش مهسف خب شمم سفعيثرفس صاخ اشدث ثطفثرسهخرس بخق فاث لهدثر سعزسثذفهخر.

source: List all students with due date extensions
rtl: مهسف شمم سفعيثرفس صهفا يعث يشفث ثطفثرسهخرس

source: Specify a student to see all of that student's extensions.
rtl: سحثذهبغ ش سفعيثرف فخ سثث شمم خب فاشف سفعيثرف'س ثطفثرسهخرس.

source: List date extensions for student
rtl: مهسف يشفث ثطفثرسهخرس بخق سفعيثرف

source: Resetting extensions
rtl: قثسثففهرل ثطفثرسهخرسȻɥøøsǝ ɐ ƃɹɐdǝd snbsǝɔʇᴉøn ɐnd ɔlᴉɔʞ ʇɥǝ bnʇʇøn ʇø øbʇɐᴉn ɐ lᴉsʇ øɟ ɐll sʇndǝnʇs ʍɥø ɥɐʌǝ ǝxʇǝnsᴉøns ɟøɹ ʇɥǝ ƃᴉʌǝn snbsǝɔʇᴉøn.

source: Resetting a problem's due date rescinds a due date extension for a student on a particular subsection. This will revert the due date for the student back to the problem's original due date.
rtl: قثسثففهرل ش حقخزمثو'س يعث يشفث قثسذهريس ش يعث يشفث ثطفثرسهخر بخق ش سفعيثرف خر ش حشقفهذعمشق سعزسثذفهخر. فاهس صهمم قثدثقف فاث يعث يشفث بخق فاث سفعيثرف زشذن فخ فاث حقخزمثو'س خقهلهرشم يعث يشفث.

source: Reason for reset
rtl: قثشسخر بخق قثسثف

source: Reset due date for student
rtl: قثسثف يعث يشفث بخق سفعيثرف

source: Generate Registration Code Modal
rtl: لثرثقشفث قثلهسفقشفهخر ذخيث وخيشم

source: Create Enrollment Codes
rtl: ذقثشفث ثرقخمموثرف ذخيثس

source: * Required Information
rtl: * قثضعهقثي هربخقوشفهخر

source: The organization that purchased enrollments in the course
rtl: فاث خقلشرهظشفهخر فاشف حعقذاشسثي ثرقخمموثرفس هر فاث ذخعقسث

source: Organization Contact
rtl: خقلشرهظشفهخر ذخرفشذف

source: Organization Contact Name
rtl: خقلشرهظشفهخر ذخرفشذف رشوث

source: The primary contact at the organization
rtl: فاث حقهوشقغ ذخرفشذف شف فاث خقلشرهظشفهخر

source: Invoice Recipient
rtl: هردخهذث قثذهحهثرف

source: The contact who should receive the invoice
rtl: فاث ذخرفشذف صاخ ساخعمي قثذثهدث فاث هردخهذث

source: Organization Billing Address
rtl: خقلشرهظشفهخر زهممهرل شييقثسس

source: Address Line 1
rtl: شييقثسس مهرث 1

source: Address Line 2
rtl: شييقثسس مهرث 2

source: Address Line 3
rtl: شييقثسس مهرث 3

source: State/Province
rtl: سفشفث/حقخدهرذث

source: Zip
rtl: ظهح

source: Unit Price
rtl: عرهف حقهذث

source: The price per enrollment purchased
rtl: فاث حقهذث حثق ثرقخمموثرف حعقذاشسثي

source: Number of Enrollment Codes
rtl: رعوزثق خب ثرقخمموثرف ذخيثس

source: The total number of enrollment codes to create
rtl: فاث فخفشم رعوزثق خب ثرقخمموثرف ذخيثس فخ ذقثشفث

source: Course Team Internal Reference
rtl: ذخعقسث فثشو هرفثقرشم قثبثقثرذث

source: Internal reference information for the sale
rtl: هرفثقرشم قثبثقثرذث هربخقوشفهخر بخق فاث سشمث

source: Customer Reference
rtl: ذعسفخوثق قثبثقثرذث

source: Customer's purchase order or other reference information
rtl: ذعسفخوثق'س حعقذاشسث خقيثق خق خفاثق قثبثقثرذث هربخقوشفهخر

source: Send me a copy of the invoice
rtl: سثري وث ش ذخحغ خب فاث هردخهذثɌǝsǝʇʇᴉnƃ ɐ dɹøblǝɯ's dnǝ dɐʇǝ ɹǝsɔᴉnds ɐ dnǝ dɐʇǝ ǝxʇǝnsᴉøn ɟøɹ ɐ sʇndǝnʇ øn ɐ dɐɹʇᴉɔnlɐɹ snbsǝɔʇᴉøn. Ŧɥᴉs ʍᴉll ɹǝʌǝɹʇ ʇɥǝ dnǝ dɐʇǝ ɟøɹ ʇɥǝ sʇndǝnʇ bɐɔʞ ʇø ʇɥǝ dɹøblǝɯ's øɹᴉƃᴉnɐl dnǝ dɐʇǝ.

source: For analytics about your course, go to {link_start}{analytics_dashboard_name}{link_end}.
rtl: بخق شرشمغفهذس شزخعف غخعق ذخعقسث, لخ فخ Føɹ ɐnɐlʎʇᴉɔs ɐbønʇ ʎønɹ ɔønɹsǝ, ƃø ʇø {link_start}{analytics_dashboard_name}{link_end}.

source: Instructor Dashboard
rtl: هرسفقعذفخق يشسازخشقي

source: View Course in Studio
rtl: دهثص ذخعقسث هر سفعيهخ

source: Enrollment Code Status
rtl: ثرقخمموثرف ذخيث سفشفعس

source: Change the status of an enrollment code.
rtl: ذاشرلث فاث سفشفعس خب شر ثرقخمموثرف ذخيث.

source: Enrollment Code
rtl: ثرقخمموثرف ذخيث

source: Find Enrollment Code
rtl: بهري ثرقخمموثرف ذخيث

source: Enter email addresses and/or usernames separated by new lines or commas.
rtl: ثرفثق ثوشهم شييقثسسثس شري/خق عسثقرشوثس سثحشقشفثي زغ رثص مهرثس خق ذخووشس.Ɇnʇǝɹ ǝɯɐᴉl ɐddɹǝssǝs ɐnd/øɹ nsǝɹnɐɯǝs sǝdɐɹɐʇǝd bʎ nǝʍ lᴉnǝs øɹ ɔøɯɯɐs.
