Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Enter your mailing address.
rtl: ثرفثق غخعق وشهمهرل شييقثسس.

source: Enter your first name.
rtl: Ɇnʇǝɹ ʎønɹ ɟᴉɹsʇ nɐɯǝ.

source: Enter your last name.
rtl: Ɇnʇǝɹ ʎønɹ lɐsʇ nɐɯǝ.

source: Enter your state.
rtl: Ɇnʇǝɹ ʎønɹ sʇɐʇǝ.

source: Select your year of birth
rtl: Sǝlǝɔʇ ʎønɹ ʎǝɐɹ øɟ bᴉɹʇɥ

source: Select your gender
rtl: Sǝlǝɔʇ ʎønɹ ƃǝndǝɹ

source: Our system detected that your password is vulnerable. Change your password so that your account stays secure.
rtl: Ønɹ sʎsʇǝɯ dǝʇǝɔʇǝd ʇɥɐʇ ʎønɹ dɐssʍøɹd ᴉs ʌnlnǝɹɐblǝ. Ȼɥɐnƃǝ ʎønɹ dɐssʍøɹd sø ʇɥɐʇ ʎønɹ ɐɔɔønnʇ sʇɐʎs sǝɔnɹǝ.

source: Our system detected that your password is vulnerable. We recommend you change it so that your account stays secure.
rtl: Ønɹ sʎsʇǝɯ dǝʇǝɔʇǝd ʇɥɐʇ ʎønɹ dɐssʍøɹd ᴉs ʌnlnǝɹɐblǝ. Wǝ ɹǝɔøɯɯǝnd ʎøn ɔɥɐnƃǝ ᴉʇ sø ʇɥɐʇ ʎønɹ ɐɔɔønnʇ sʇɐʎs sǝɔnɹǝ.

source: The '{field_name}' field cannot be edited.
rtl: فاث '{field_name}' بهثمي ذشررخف زث ثيهفثي.

source: First Name
rtl: بهقسف رشوث

source: Last Name
rtl: مشسف رشوث

source: Enter a valid name
rtl: Ɇnʇǝɹ ɐ ʌɐlᴉd nɐɯǝ

source: State/Province/Region
rtl: سفشفث/حقخدهرذث/قثلهخر

source: Company
rtl: ذخوحشرغ

source: Title
rtl: فهفمث

source: Job Title
rtl: تخز فهفمث

source: Mailing address
rtl: وشهمهرل شييقثسس

source: Tell us why you're interested in {platform_name}
rtl: فثمم عس صاغ غخع'قث هرفثقثسفثي هر {platform_name}

source: Profession
rtl: حقخبثسسهخر

source: Specialty
rtl: سحثذهشمفغ

source: Make sure that you are providing a valid username or a URL that contains "{url_stub}". To remove the link from your {platform_name} profile, leave this field blank.
rtl: وشنث سعقث فاشف غخع شقث حقخدهيهرل ش دشمهي عسثقرشوث خق ش عقم فاشف ذخرفشهرس "{url_stub}". فخ قثوخدث فاث مهرن بقخو غخعق {platform_name} حقخبهمث, مثشدث فاهس بهثمي زمشرن.Mɐʞǝ snɹǝ ʇɥɐʇ ʎøn ɐɹǝ dɹøʌᴉdᴉnƃ ɐ ʌɐlᴉd nsǝɹnɐɯǝ øɹ ɐ ɄɌŁ ʇɥɐʇ ɔønʇɐᴉns "{url_stub}". Ŧø ɹǝɯøʌǝ ʇɥǝ lᴉnʞ ɟɹøɯ ʎønɹ {platform_name} dɹøɟᴉlǝ, lǝɐʌǝ ʇɥᴉs ɟᴉǝld blɐnʞ.

source: This account has been temporarily locked due to excessive login failures. Try again later.
rtl: فاهس شذذخعرف اشس زثثر فثوحخقشقهمغ مخذنثي يعث فخ ثطذثسسهدث مخلهر بشهمعقثس. فقغ شلشهر مشفثق.Ŧɥᴉs ɐɔɔønnʇ ɥɐs bǝǝn ʇǝɯdøɹɐɹᴉlʎ løɔʞǝd dnǝ ʇø ǝxɔǝssᴉʌǝ løƃᴉn ɟɐᴉlnɹǝs. Ŧɹʎ ɐƃɐᴉn lɐʇǝɹ.

source: Email or password is incorrect.
rtl: ثوشهم خق حشسسصخقي هس هرذخققثذف.

source: Permission Denied
rtl: حثقوهسسهخر يثرهثي

source: Retirement does not exist!
rtl: قثفهقثوثرف يخثس رخف ثطهسف!

source: Success
rtl: سعذذثسس

source: Actions
rtl: شذفهخرس

source: Delete failed for user preference '{preference_key}'.
rtl: يثمثفث بشهمثي بخق عسثق حقثبثقثرذث '{preference_key}'.

source: Preference '{preference_key}' cannot be set to an empty value.
rtl: حقثبثقثرذث '{preference_key}' ذشررخف زث سثف فخ شر ثوحفغ دشمعث.

source: Invalid user preference key '{preference_key}'.
rtl: هردشمهي عسثق حقثبثقثرذث نثغ '{preference_key}'.

source: Value '{preference_value}' is not valid for user preference '{preference_key}'.
rtl: دشمعث '{preference_value}' هس رخف دشمهي بخق عسثق حقثبثقثرذث Vɐlnǝ '{preference_value}' ᴉs nøʇ ʌɐlᴉd ɟøɹ nsǝɹ dɹǝɟǝɹǝnɔǝ '{preference_key}'.

source: Value '{preference_value}' not valid for preference '{preference_key}': Not in timezone set.
rtl: دشمعث '{preference_value}' رخف دشمهي بخق حقثبثقثرذث '{preference_key}': رخف هر فهوثظخرث سثف.Vɐlnǝ '{preference_value}' nøʇ ʌɐlᴉd ɟøɹ dɹǝɟǝɹǝnɔǝ '{preference_key}': Nøʇ ᴉn ʇᴉɯǝzønǝ sǝʇ.

source: Value '{preference_value}' is not a valid time zone selection.
rtl: دشمعث '{preference_value}' هس رخف ش دشمهي فهوث ظخرث سثمثذفهخر.

source: Save failed for user preference '{key}' with value '{value}'.
rtl: سشدث بشهمثي بخق عسثق حقثبثقثرذث '{key}' صهفا دشمعث '{value}'.

source: No data provided for user preference update
rtl: رخ يشفش حقخدهيثي بخق عسثق حقثبثقثرذث عحيشفث

source: We received a deletion request for your account on %(platform_name)s. We're sorry to see you go!
rtl: صث قثذثهدثي ش يثمثفهخر قثضعثسف بخق غخعق شذذخعرف خر %(platform_name)s. صث'قث سخققغ فخ سثث غخع لخ!Wǝ ɹǝɔǝᴉʌǝd ɐ dǝlǝʇᴉøn ɹǝbnǝsʇ ɟøɹ ʎønɹ ɐɔɔønnʇ øn %(platform_name)s. Wǝ'ɹǝ søɹɹʎ ʇø sǝǝ ʎøn ƃø!

source: Your account will be deleted shortly. Account deletion, including removal from email lists, may take a few weeks to fully process through our system. If you want to opt-out of emails before then, please unsubscribe from the footer of any email.
rtl: غخعق شذذخعرف صهمم زث يثمثفثي ساخقفمغ. شذذخعرف يثمثفهخر, هرذمعيهرل قثوخدشم بقخو ثوشهم مهسفس, وشغ فشنث ش بثص صثثنس فخ بعممغ حقخذثسس فاقخعلا خعق سغسفثو. هب غخع صشرف فخ خحف-خعف خب ثوشهمس زثبخقث فاثر, حمثشسث عرسعزسذقهزث بقخو فاث بخخفثق خب شرغ ثوشهم.Ɏønɹ ɐɔɔønnʇ ʍᴉll bǝ dǝlǝʇǝd sɥøɹʇlʎ. Ⱥɔɔønnʇ dǝlǝʇᴉøn, ᴉnɔlndᴉnƃ ɹǝɯøʌɐl ɟɹøɯ ǝɯɐᴉl lᴉsʇs, ɯɐʎ ʇɐʞǝ ɐ ɟǝʍ ʍǝǝʞs ʇø ɟnllʎ dɹøɔǝss ʇɥɹønƃɥ ønɹ sʎsʇǝɯ. Ɨɟ ʎøn ʍɐnʇ ʇø ødʇ-ønʇ øɟ ǝɯɐᴉls bǝɟøɹǝ ʇɥǝn, dlǝɐsǝ nnsnbsɔɹᴉbǝ ɟɹøɯ ʇɥǝ ɟøøʇǝɹ øɟ ɐnʎ ǝɯɐᴉl.

source: This is an informational email only. If you did not initiate this request, please contact %(contact_email)s.
rtl: فاهس هس شر هربخقوشفهخرشم ثوشهم خرمغ. هب غخع يهي رخف هرهفهشفث فاهس قثضعثسف, حمثشسث ذخرفشذف %(contact_email)s.Ŧɥᴉs ᴉs ɐn ᴉnɟøɹɯɐʇᴉønɐl ǝɯɐᴉl ønlʎ. Ɨɟ ʎøn dᴉd nøʇ ᴉnᴉʇᴉɐʇǝ ʇɥᴉs ɹǝbnǝsʇ, dlǝɐsǝ ɔønʇɐɔʇ %(contact_email)s.

source: Best, %(platform_name)s
rtl: زثسف, %(platform_name)s

source: Your Account Has Been Queued For Deletion
rtl: غخعق شذذخعرف اشس زثثر ضعثعثي بخق يثمثفهخر

source: Password reset
rtl: حشسسصخقي قثسثف

source: Highest level of education completed
rtl: Ħᴉƃɥǝsʇ lǝʌǝl øɟ ǝdnɔɐʇᴉøn ɔøɯdlǝʇǝd

source: Year of birth
rtl: Ɏǝɐɹ øɟ bᴉɹʇɥ

source: You're receiving this e-mail because you requested a password reset for your user account at %(platform_name)s.
rtl: غخع'قث قثذثهدهرل فاهس ث-وشهم زثذشعسث غخع قثضعثسفثي ش حشسسصخقي قثسثف بخق غخعق عسثق شذذخعرف شف %(platform_name)s.Ɏøn'ɹǝ ɹǝɔǝᴉʌᴉnƃ ʇɥᴉs ǝ-ɯɐᴉl bǝɔɐnsǝ ʎøn ɹǝbnǝsʇǝd ɐ dɐssʍøɹd ɹǝsǝʇ ɟøɹ ʎønɹ nsǝɹ ɐɔɔønnʇ ɐʇ %(platform_name)s.

source: However, there is currently no user account associated with your email address: %(email_address)s.
rtl: اخصثدثق, فاثقث هس ذعققثرفمغ رخ عسثق شذذخعرف شسسخذهشفثي صهفا غخعق ثوشهم شييقثسس: %(email_address)s.Ħøʍǝʌǝɹ, ʇɥǝɹǝ ᴉs ɔnɹɹǝnʇlʎ nø nsǝɹ ɐɔɔønnʇ ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʎønɹ ǝɯɐᴉl ɐddɹǝss: %(email_address)s.

source: If you did not request this change, you can ignore this email.
rtl: هب غخع يهي رخف قثضعثسف فاهس ذاشرلث, غخع ذشر هلرخقث فاهس ثوشهم.

source: Reset my password
rtl: قثسثف وغ حشسسصخقي

source: Please go to the following page and choose a new password:
rtl: حمثشسث لخ فخ فاث بخممخصهرل حشلث شري ذاخخسث ش رثص حشسسصخقي:

source: Password reset on %(platform_name)s
rtl: حشسسصخقي قثسثف خر %(platform_name)s

source: Password reset success
rtl: حشسسصخقي قثسثف سعذذثسس

source: Hello %(name)s,
rtl: اثممخ %(name)s,

source: This is to confirm that you have successfully changed your password associated with %(platform_name)s account. Please sign-in to your account.
rtl: فاهس هس فخ ذخربهقو فاشف غخع اشدث سعذذثسسبعممغ ذاشرلثي غخعق حشسسصخقي شسسخذهشفثي صهفا %(platform_name)s شذذخعرف. حمثشسث سهلر-هر فخ غخعق شذذخعرف.Ŧɥᴉs ᴉs ʇø ɔønɟᴉɹɯ ʇɥɐʇ ʎøn ɥɐʌǝ snɔɔǝssɟnllʎ ɔɥɐnƃǝd ʎønɹ dɐssʍøɹd ɐssøɔᴉɐʇǝd ʍᴉʇɥ %(platform_name)s ɐɔɔønnʇ. Ᵽlǝɐsǝ sᴉƃn-ᴉn ʇø ʎønɹ ɐɔɔønnʇ.

source: Hello %(name)s,
rtl: اثممخ %(name)s,

source: Password reset completed on %(platform_name)s
rtl: حشسسصخقي قثسثف ذخوحمثفثي خر %(platform_name)s

source: Superuser creation not allowed
rtl: سعحثقعسثق ذقثشفهخر رخف شممخصثي

source: Account modification not allowed.
rtl: شذذخعرف وخيهبهذشفهخر رخف شممخصثي.

source: Account creation not allowed.
rtl: شذذخعرف ذقثشفهخر رخف شممخصثي.

source: You've successfully signed in to your {provider_name} account, but this account isn't linked with your {platform_name} account yet. {blank_lines}Use your {platform_name} username and password to sign in to {platform_name} below, and then link your {platform_name} account with {provider_name} from your dashboard. {blank_lines}If you don't have an account on {platform_name} yet, click {register_label_strong} at the top of the page.
rtl: غخع'دث سعذذثسسبعممغ سهلرثي هر فخ غخعق {provider_name} شذذخعرف, زعف فاهس شذذخعرف هسر'ف مهرنثي صهفا غخعق {platform_name} شذذخعرف غثف. {blank_lines}عسث غخعق {platform_name} عسثقرشوث شري حشسسصخقي فخ سهلر هر فخ {platform_name} زثمخص, شري فاثر مهرن غخعق {platform_name} شذذخعرف صهفا {provider_name} بقخو غخعق يشسازخشقي. {blank_lines}هب غخع يخر'ف اشدث شر شذذخعرف خر {platform_name} غثف, ذمهذن {register_label_strong} شف فاث فخح خب فاث حشلث.Ɏøn'ʌǝ snɔɔǝssɟnllʎ sᴉƃnǝd ᴉn ʇø ʎønɹ {provider_name} ɐɔɔønnʇ, bnʇ ʇɥᴉs ɐɔɔønnʇ ᴉsn'ʇ lᴉnʞǝd ʍᴉʇɥ ʎønɹ {platform_name} ɐɔɔønnʇ ʎǝʇ. {blank_lines}Ʉsǝ ʎønɹ {platform_name} nsǝɹnɐɯǝ ɐnd dɐssʍøɹd ʇø sᴉƃn ᴉn ʇø {platform_name} bǝløʍ, ɐnd ʇɥǝn lᴉnʞ ʎønɹ {platform_name} ɐɔɔønnʇ ʍᴉʇɥ {provider_name} ɟɹøɯ ʎønɹ dɐsɥbøɐɹd. {blank_lines}Ɨɟ ʎøn døn'ʇ ɥɐʌǝ ɐn ɐɔɔønnʇ øn {platform_name} ʎǝʇ, ɔlᴉɔʞ {register_label_strong} ɐʇ ʇɥǝ ʇød øɟ ʇɥǝ dɐƃǝ.

source: Register
rtl: قثلهسفثق

source: There was an error receiving your login information. Please email us.
rtl: فاثقث صشس شر ثققخق قثذثهدهرل غخعق مخلهر هربخقوشفهخر. حمثشسث ثوشهم عس.

source: To protect your account, it’s been temporarily locked. Try again in {locked_out_period} minutes.{li_start}To be on the safe side, you can reset your password {link_start}here{link_end} before you try again.
rtl: فخ حقخفثذف غخعق شذذخعرف, هف’س زثثر فثوحخقشقهمغ مخذنثي. فقغ شلشهر هر {locked_out_period} وهرعفثس.{li_start}فخ زث خر فاث سشبث سهيث, غخع ذشر قثسثف غخعق حشسسصخقي {link_start}اثقث{link_end} زثبخقث غخع فقغ شلشهر.

source: Too many failed login attempts. Try again later.
rtl: فخخ وشرغ بشهمثي مخلهر شففثوحفس. فقغ شلشهر مشفثق.Ŧø dɹøʇǝɔʇ ʎønɹ ɐɔɔønnʇ, ᴉʇ’s bǝǝn ʇǝɯdøɹɐɹᴉlʎ løɔʞǝd. Ŧɹʎ ɐƃɐᴉn ᴉn {locked_out_period} ɯᴉnnʇǝs.{li_start}Ŧø bǝ øn ʇɥǝ sɐɟǝ sᴉdǝ, ʎøn ɔɐn ɹǝsǝʇ ʎønɹ dɐssʍøɹd {link_start}ɥǝɹǝ{link_end} bǝɟøɹǝ ʎøn ʇɹʎ ɐƃɐᴉn.

source: Email or password is incorrect.{li_start}You have {remaining_attempts} more sign-in attempts before your account is temporarily locked.{li_end}{li_start}If you've forgotten your password, click {link_start}here{link_end} to reset.{li_end}
rtl: ثوشهم خق حشسسصخقي هس هرذخققثذف.{li_start}غخع اشدث {remaining_attempts} وخقث سهلر-هر شففثوحفس زثبخقث غخعق شذذخعرف هس فثوحخقشقهمغ مخذنثي.{li_end}{li_start}هب غخع'دث بخقلخففثر غخعق حشسسصخقي, ذمهذن {link_start}اثقث{link_end} فخ قثسثف.{li_end}Ɇɯɐᴉl øɹ dɐssʍøɹd ᴉs ᴉnɔøɹɹǝɔʇ.{li_start}Ɏøn ɥɐʌǝ {remaining_attempts} ɯøɹǝ sᴉƃn-ᴉn ɐʇʇǝɯdʇs bǝɟøɹǝ ʎønɹ ɐɔɔønnʇ ᴉs ʇǝɯdøɹɐɹᴉlʎ løɔʞǝd.{li_end}{li_start}Ɨɟ ʎøn'ʌǝ ɟøɹƃøʇʇǝn ʎønɹ dɐssʍøɹd, ɔlᴉɔʞ {link_start}ɥǝɹǝ{link_end} ʇø ɹǝsǝʇ.{li_end}

source: As {allowed_domain} user, You must login with your {allowed_domain} {link_start}{provider} account{link_end}.
rtl: شس {allowed_domain} عسثق, غخع وعسف مخلهر صهفا غخعق {allowed_domain} {link_start}{provider} شذذخعرف{link_end}.Ⱥs {allowed_domain} nsǝɹ, Ɏøn ɯnsʇ løƃᴉn ʍᴉʇɥ ʎønɹ {allowed_domain} {link_start}{provider} ɐɔɔønnʇ{link_end}.

source: The email address you used to register with {platform_name}
rtl: فاث ثوشهم شييقثسس غخع عسثي فخ قثلهسفثق صهفا {platform_name}

source: username@domain.com
rtl: عسثقرشوث@يخوشهر.ذخو

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
rtl: فاشف ث-وشهم شييقثسس يخثسر'ف اشدث شر شسسخذهشفثي عسثق شذذخعرف. شقث غخع سعقث غخع'دث قثلهسفثقثي?Ŧɥɐʇ ǝ-ɯɐᴉl ɐddɹǝss døǝsn'ʇ ɥɐʌǝ ɐn ɐssøɔᴉɐʇǝd nsǝɹ ɐɔɔønnʇ. Ⱥɹǝ ʎøn snɹǝ ʎøn'ʌǝ ɹǝƃᴉsʇǝɹǝd?

source: The user account associated with this e-mail address cannot reset the password.
rtl: فاث عسثق شذذخعرف شسسخذهشفثي صهفا فاهس ث-وشهم شييقثسس ذشررخف قثسثف فاث حشسسصخقي.Ŧɥǝ nsǝɹ ɐɔɔønnʇ ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʇɥᴉs ǝ-ɯɐᴉl ɐddɹǝss ɔɐnnøʇ ɹǝsǝʇ ʇɥǝ dɐssʍøɹd.

source: Your previous request is in progress, please try again in a few moments.
rtl: غخعق حقثدهخعس قثضعثسف هس هر حقخلقثسس, حمثشسث فقغ شلشهر هر ش بثص وخوثرفس.

source: Password reset unsuccessful
rtl: حشسسصخقي قثسثف عرسعذذثسسبعم

source: Error in resetting your password.
rtl: ثققخق هر قثسثففهرل غخعق حشسسصخقي.

source: Error in resetting your password. Please try again.
rtl: ثققخق هر قثسثففهرل غخعق حشسسصخقي. حمثشسث فقغ شلشهر.Ɏønɹ dɹǝʌᴉøns ɹǝbnǝsʇ ᴉs ᴉn dɹøƃɹǝss, dlǝɐsǝ ʇɹʎ ɐƃɐᴉn ᴉn ɐ ɟǝʍ ɯøɯǝnʇs.

source: {html_start}Password Creation Complete{html_end}Your password has been created. {bold_start}{email}{bold_end} is now your primary login email.
rtl: {html_start}حشسسصخقي ذقثشفهخر ذخوحمثفث{html_end}غخعق حشسسصخقي اشس زثثر ذقثشفثي. {bold_start}{email}{bold_end} هس رخص غخعق حقهوشقغ مخلهر ثوشهم.

source: Some error occurred during password change. Please try again
rtl: سخوث ثققخق خذذعققثي يعقهرل حشسسصخقي ذاشرلث. حمثشسث فقغ شلشهر

source: No email address provided.
rtl: رخ ثوشهم شييقثسس حقخدهيثي.{html_start}Ᵽɐssʍøɹd Ȼɹǝɐʇᴉøn Ȼøɯdlǝʇǝ{html_end}Ɏønɹ dɐssʍøɹd ɥɐs bǝǝn ɔɹǝɐʇǝd. {bold_start}{email}{bold_end} ᴉs nøʍ ʎønɹ dɹᴉɯɐɹʎ løƃᴉn ǝɯɐᴉl.

source: Registration using {provider} has timed out.
rtl: قثلهسفقشفهخر عسهرل {provider} اشس فهوثي خعف.

source: An access_token is required when passing value ({}) for provider.
rtl: شر شذذثسس_فخنثر هس قثضعهقثي صاثر حشسسهرل دشمعث ({}) بخق حقخدهيثق.

source: The provided access_token is already associated with another user.
rtl: فاث حقخدهيثي شذذثسس_فخنثر هس شمقثشيغ شسسخذهشفثي صهفا شرخفاثق عسثق.

source: The provided access_token is not valid.
rtl: فاث حقخدهيثي شذذثسس_فخنثر هس رخف دشمهي.

source: Full Name cannot contain the following characters: < >
rtl: بعمم رشوث ذشررخف ذخرفشهر فاث بخممخصهرل ذاشقشذفثقس: < >

source: A properly formatted e-mail is required
rtl: ش حقخحثقمغ بخقوشففثي ث-وشهم هس قثضعهقثي

source: Your legal name must be a minimum of one character long
rtl: غخعق مثلشم رشوث وعسف زث ش وهرهوعو خب خرث ذاشقشذفثق مخرل

source: Email cannot be more than %(limit_value)s characters long
rtl: ثوشهم ذشررخف زث وخقث فاشر %(limit_value)s ذاشقشذفثقس مخرل

source: You must accept the terms of service.
rtl: غخع وعسف شذذثحف فاث فثقوس خب سثقدهذث.

source: A level of education is required
rtl: ش مثدثم خب ثيعذشفهخر هس قثضعهقثي

source: Your gender is required
rtl: غخعق لثريثق هس قثضعهقثي

source: Your year of birth is required
rtl: غخعق غثشق خب زهقفا هس قثضعهقثي

source: Your mailing address is required
rtl: غخعق وشهمهرل شييقثسس هس قثضعهقثي

source: A description of your goals is required
rtl: ش يثسذقهحفهخر خب غخعق لخشمس هس قثضعهقثي

source: A city is required
rtl: ش ذهفغ هس قثضعهقثي

source: A country is required
rtl: ش ذخعرفقغ هس قثضعهقثي

source: To enroll, you must follow the honor code.
rtl: فخ ثرقخمم, غخع وعسف بخممخص فاث اخرخق ذخيث.

source: You are missing one or more required fields
rtl: غخع شقث وهسسهرل خرث خق وخقث قثضعهقثي بهثميس

source: Unauthorized email address.
rtl: عرشعفاخقهظثي ثوشهم شييقثسس.

source: It looks like {email} belongs to an existing account. Try again with a different email address.
rtl: هف مخخنس مهنث {email} زثمخرلس فخ شر ثطهسفهرل شذذخعرف. فقغ شلشهر صهفا ش يهببثقثرف ثوشهم شييقثسس.Ɨʇ løøʞs lᴉʞǝ {email} bǝlønƃs ʇø ɐn ǝxᴉsʇᴉnƃ ɐɔɔønnʇ. Ŧɹʎ ɐƃɐᴉn ʍᴉʇɥ ɐ dᴉɟɟǝɹǝnʇ ǝɯɐᴉl ɐddɹǝss.

source: This is what you will use to login.
rtl: فاهس هس صاشف غخع صهمم عسث فخ مخلهر.

source: This name will be used on any certificates that you earn.
rtl: فاهس رشوث صهمم زث عسثي خر شرغ ذثقفهبهذشفثس فاشف غخع ثشقر.

source: Public Username
rtl: حعزمهذ عسثقرشوث

source: The name that will identify you in your courses. It cannot be changed later.
rtl: فاث رشوث فاشف صهمم هيثرفهبغ غخع هر غخعق ذخعقسثس. هف ذشررخف زث ذاشرلثي مشفثق.

source: I agree that {platform_name} may send me marketing messages.
rtl: Ɨ ɐƃɹǝǝ ʇɥɐʇ {platform_name} ɯɐʎ sǝnd ɯǝ ɯɐɹʞǝʇᴉnƃ ɯǝssɐƃǝs.

source: Country or Region of Residence
rtl: ذخعرفقغ خق قثلهخر خب قثسهيثرذث

source: The country or region where you live.
rtl: فاث ذخعرفقغ خق قثلهخر صاثقث غخع مهدث.

source: Terms of Service and Honor Code
rtl: فثقوس خب سثقدهذث شري اخرخق ذخيث

source: I agree to the {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end}
rtl: ه شلقثث فخ فاث {platform_name} Ɨ ɐƃɹǝǝ ʇø ʇɥǝ {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end}

source: You must agree to the {platform_name} {terms_of_service}
rtl: غخع وعسف شلقثث فخ فاث {platform_name} {terms_of_service}

source: By creating an account, you agree to the {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end} and you acknowledge that {platform_name} and each Member process your personal data in accordance with the {privacy_policy_link_start}Privacy Policy{privacy_policy_link_end}.
rtl: زغ ذقثشفهرل شر شذذخعرف, غخع شلقثث فخ فاث {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end} شري غخع شذنرخصمثيلث فاشف {platform_name} شري ثشذا وثوزثق حقخذثسس غخعق حثقسخرشم يشفش هر شذذخقيشرذث صهفا فاث {privacy_policy_link_start}حقهدشذغ حخمهذغ{privacy_policy_link_end}.Ƀʎ ɔɹǝɐʇᴉnƃ ɐn ɐɔɔønnʇ, ʎøn ɐƃɹǝǝ ʇø ʇɥǝ {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end} ɐnd ʎøn ɐɔʞnøʍlǝdƃǝ ʇɥɐʇ {platform_name} ɐnd ǝɐɔɥ Mǝɯbǝɹ dɹøɔǝss ʎønɹ dǝɹsønɐl dɐʇɐ ᴉn ɐɔɔøɹdɐnɔǝ ʍᴉʇɥ ʇɥǝ {privacy_policy_link_start}Ᵽɹᴉʌɐɔʎ Ᵽølᴉɔʎ{privacy_policy_link_end}.

source: I agree to the {platform_name} {tos_link_start}{terms_of_service}{tos_link_end}
rtl: ه شلقثث فخ فاث {platform_name} Ɨ ɐƃɹǝǝ ʇø ʇɥǝ {platform_name} {tos_link_start}{terms_of_service}{tos_link_end}

source: Create Account
rtl: ذقثشفث شذذخعرف

source: Dismiss
rtl: يهسوهسس

source: The course key for the course we would like to be auto-cohorted.
rtl: فاث ذخعقسث نثغ بخق فاث ذخعقسث صث صخعمي مهنث فخ زث شعفخ-ذخاخقفثي.

source: Oauth client name of VEM service.
rtl: خشعفا ذمهثرف رشوث خب دثو سثقدهذث.

source: video encode manager API URL.
rtl: دهيثخ ثرذخيث وشرشلثق شحه عقم.

source: Username created for VEM Integration, e.g. vem_service_user.
rtl: عسثقرشوث ذقثشفثي بخق دثو هرفثلقشفهخر, ث.ل. دثو_سثقدهذث_عسثق.

source: Force On
rtl: بخقذث خر

source: Force Off
rtl: بخقذث خبب

source: This content is only accessible to registered learners. Sign in or register to view it.
rtl: فاهس ذخرفثرف هس خرمغ شذذثسسهزمث فخ قثلهسفثقثي مثشقرثقس. سهلر هر خق قثلهسفثق فخ دهثص هف.

source: This content is only accessible to enrolled learners.
rtl: فاهس ذخرفثرف هس خرمغ شذذثسسهزمث فخ ثرقخممثي مثشقرثقس. Ŧɥᴉs ɔønʇǝnʇ ᴉs ønlʎ ɐɔɔǝssᴉblǝ ʇø ɹǝƃᴉsʇǝɹǝd lǝɐɹnǝɹs. Sᴉƃn ᴉn øɹ ɹǝƃᴉsʇǝɹ ʇø ʌᴉǝʍ ᴉʇ.

source: The about me field must be at most {BIO_MAX_LENGTH} characters long.
rtl: فاث شزخعف وث بهثمي وعسف زث شف وخسف {BIO_MAX_LENGTH} ذاشقشذفثقس مخرل.

source: This value is invalid.
rtl: فاهس دشمعث هس هردشمهي.

source: This field is not editable
rtl: فاهس بهثمي هس رخف ثيهفشزمث

source: %(min_score)s is not a valid grade percentage
rtl: %(min_score)s هس رخف ش دشمهي لقشيث حثقذثرفشلث

source: Gating milestone for {usage_key}
rtl: لشفهرل وهمثسفخرث بخق {usage_key}

source: License
rtl: مهذثرسث

source: A license defines how the contents of this block can be shared and reused.
rtl: ش مهذثرسث يثبهرثس اخص فاث ذخرفثرفس خب فاهس زمخذن ذشر زث ساشقثي شري قثعسثي.

source: Category
rtl: ذشفثلخقغ

source: Week 1
rtl: صثثن 1Ⱥ lᴉɔǝnsǝ dǝɟᴉnǝs ɥøʍ ʇɥǝ ɔønʇǝnʇs øɟ ʇɥᴉs bløɔʞ ɔɐn bǝ sɥɐɹǝd ɐnd ɹǝnsǝd.

source: A category name for the discussion. This name appears in the left pane of the discussion forum for the course.
rtl: ش ذشفثلخقغ رشوث بخق فاث يهسذعسسهخر. فاهس رشوث شححثشقس هر فاث مثبف حشرث خب فاث يهسذعسسهخر بخقعو بخق فاث ذخعقسث.

source: Subcategory
rtl: سعزذشفثلخقغȺ ɔɐʇǝƃøɹʎ nɐɯǝ ɟøɹ ʇɥǝ dᴉsɔnssᴉøn. Ŧɥᴉs nɐɯǝ ɐddǝɐɹs ᴉn ʇɥǝ lǝɟʇ dɐnǝ øɟ ʇɥǝ dᴉsɔnssᴉøn ɟøɹnɯ ɟøɹ ʇɥǝ ɔønɹsǝ.

source: A subcategory name for the discussion. This name appears in the left pane of the discussion forum for the course.
rtl: ش سعزذشفثلخقغ رشوث بخق فاث يهسذعسسهخر. فاهس رشوث شححثشقس هر فاث مثبف حشرث خب فاث يهسذعسسهخر بخقعو بخق فاث ذخعقسث.Ⱥ snbɔɐʇǝƃøɹʎ nɐɯǝ ɟøɹ ʇɥǝ dᴉsɔnssᴉøn. Ŧɥᴉs nɐɯǝ ɐddǝɐɹs ᴉn ʇɥǝ lǝɟʇ dɐnǝ øɟ ʇɥǝ dᴉsɔnssᴉøn ɟøɹnɯ ɟøɹ ʇɥǝ ɔønɹsǝ.

source: You are not signed in. To view the discussion content, {sign_in_link} or {register_link}, and enroll in this course.
rtl: غخع شقث رخف سهلرثي هر. فخ دهثص فاث يهسذعسسهخر ذخرفثرف, {sign_in_link} خق {register_link}, شري ثرقخمم هر فاهس ذخعقسث.Ɏøn ɐɹǝ nøʇ sᴉƃnǝd ᴉn. Ŧø ʌᴉǝʍ ʇɥǝ dᴉsɔnssᴉøn ɔønʇǝnʇ, {sign_in_link} øɹ {register_link}, ɐnd ǝnɹøll ᴉn ʇɥᴉs ɔønɹsǝ.

source: {assignment} is due for {course}.
rtl: {assignment} هس يعث بخق {course}.

source: Calendar Sync
rtl: ذشمثريشق سغرذ

source: Unsubscribe from calendar updates
rtl: عرسعزسذقهزث بقخو ذشمثريشق عحيشفثس

source: Subscribe to calendar updates
rtl: سعزسذقهزث فخ ذشمثريشق عحيشفثس

source: Sync {course} to your calendar
rtl: سغرذ {course} فخ غخعق ذشمثريشق

source: Sticking to a schedule is the best way to ensure that you successfully complete your self-paced course. This schedule for {course} will help you stay on track!
rtl: سفهذنهرل فخ ش سذاثيعمث هس فاث زثسف صشغ فخ ثرسعقث فاشف غخع سعذذثسسبعممغ ذخوحمثفث غخعق سثمب-حشذثي ذخعقسث. فاهس سذاثيعمث بخق {course} صهمم اثمح غخع سفشغ خر فقشذن!Sʇᴉɔʞᴉnƃ ʇø ɐ sɔɥǝdnlǝ ᴉs ʇɥǝ bǝsʇ ʍɐʎ ʇø ǝnsnɹǝ ʇɥɐʇ ʎøn snɔɔǝssɟnllʎ ɔøɯdlǝʇǝ ʎønɹ sǝlɟ-dɐɔǝd ɔønɹsǝ. Ŧɥᴉs sɔɥǝdnlǝ ɟøɹ {course} ʍᴉll ɥǝld ʎøn sʇɐʎ øn ʇɹɐɔʞ!

source: Once you sync your course schedule to your calendar, any updates to the course from your instructor will be automatically reflected. You can remove the course from your calendar at any time.
rtl: خرذث غخع سغرذ غخعق ذخعقسث سذاثيعمث فخ غخعق ذشمثريشق, شرغ عحيشفثس فخ فاث ذخعقسث بقخو غخعق هرسفقعذفخق صهمم زث شعفخوشفهذشممغ قثبمثذفثي. غخع ذشر قثوخدث فاث ذخعقسث بقخو غخعق ذشمثريشق شف شرغ فهوث.Ønɔǝ ʎøn sʎnɔ ʎønɹ ɔønɹsǝ sɔɥǝdnlǝ ʇø ʎønɹ ɔɐlǝndɐɹ, ɐnʎ nddɐʇǝs ʇø ʇɥǝ ɔønɹsǝ ɟɹøɯ ʎønɹ ᴉnsʇɹnɔʇøɹ ʍᴉll bǝ ɐnʇøɯɐʇᴉɔɐllʎ ɹǝɟlǝɔʇǝd. Ɏøn ɔɐn ɹǝɯøʌǝ ʇɥǝ ɔønɹsǝ ɟɹøɯ ʎønɹ ɔɐlǝndɐɹ ɐʇ ɐnʎ ʇᴉɯǝ.

source: {course} dates have been updated on your calendar
rtl: {course} يشفثس اشدث زثثر عحيشفثي خر غخعق ذشمثريشق

source: You have successfully shifted your course schedule and your calendar is up to date.
rtl: غخع اشدث سعذذثسسبعممغ ساهبفثي غخعق ذخعقسث سذاثيعمث شري غخعق ذشمثريشق هس عح فخ يشفث.Ɏøn ɥɐʌǝ snɔɔǝssɟnllʎ sɥᴉɟʇǝd ʎønɹ ɔønɹsǝ sɔɥǝdnlǝ ɐnd ʎønɹ ɔɐlǝndɐɹ ᴉs nd ʇø dɐʇǝ.

source: Enabled As Of
rtl: ثرشزمثي شس خب

source: If the configuration is Enabled, then all enrollments created after this date and time (user local time) will be affected.
rtl: هب فاث ذخربهلعقشفهخر هس ثرشزمثي, فاثر شمم ثرقخمموثرفس ذقثشفثي شبفثق فاهس يشفث شري فهوث (عسثق مخذشم فهوث) صهمم زث شببثذفثي.

source: Studio Override Enabled
rtl: سفعيهخ خدثققهيث ثرشزمثيƗɟ ʇɥǝ ɔønɟᴉƃnɹɐʇᴉøn ᴉs Ɇnɐblǝd, ʇɥǝn ɐll ǝnɹøllɯǝnʇs ɔɹǝɐʇǝd ɐɟʇǝɹ ʇɥᴉs dɐʇǝ ɐnd ʇᴉɯǝ (nsǝɹ løɔɐl ʇᴉɯǝ) ʍᴉll bǝ ɐɟɟǝɔʇǝd.

source: Allow Feature Based Enrollment visibility to be overriden on a per-component basis in Studio.
rtl: شممخص بثشفعقث زشسثي ثرقخمموثرف دهسهزهمهفغ فخ زث خدثققهيثر خر ش حثق-ذخوحخرثرف زشسهس هر سفعيهخ.Ⱥlløʍ Fǝɐʇnɹǝ Ƀɐsǝd Ɇnɹøllɯǝnʇ ʌᴉsᴉbᴉlᴉʇʎ ʇø bǝ øʌǝɹɹᴉdǝn øn ɐ dǝɹ-ɔøɯdønǝnʇ bɐsᴉs ᴉn Sʇndᴉø.

source: enabled_as_of must be set when enabled is True
rtl: ثرشزمثي_شس_خب وعسف زث سثف صاثر ثرشزمثي هس فقعث

source: Partition for segmenting users by access to gated content types
rtl: حشقفهفهخر بخق سثلوثرفهرل عسثقس زغ شذذثسس فخ لشفثي ذخرفثرف فغحثس

source: Graded assessments are available to Verified Track learners.
rtl: لقشيثي شسسثسسوثرفس شقث شدشهمشزمث فخ دثقهبهثي فقشذن مثشقرثقس.

source: Graded assessments are available to Verified Track learners. Upgrade to Unlock.
rtl: لقشيثي شسسثسسوثرفس شقث شدشهمشزمث فخ دثقهبهثي فقشذن مثشقرثقس. عحلقشيث فخ عرمخذن.

source: Content available only to verified track learners
rtl: ذخرفثرف شدشهمشزمث خرمغ فخ دثقهبهثي فقشذن مثشقرثقس

source: Verified Track Access
rtl: دثقهبهثي فقشذن شذذثسس

source: Upgrade to unlock
rtl: عحلقشيث فخ عرمخذنǤɹɐdǝd ɐssǝssɯǝnʇs ɐɹǝ ɐʌɐᴉlɐblǝ ʇø Vǝɹᴉɟᴉǝd Ŧɹɐɔʞ lǝɐɹnǝɹs. Ʉdƃɹɐdǝ ʇø Ʉnløɔʞ.

source: Access expired on {expiration_date}
rtl: شذذثسس ثطحهقثي خر {expiration_date}

source: Access to {course_name} expired on {expiration_date}
rtl: شذذثسس فخ {course_name} ثطحهقثي خر {expiration_date}

source: Access to the course you were looking for expired on {expiration_date}
rtl: شذذثسس فخ فاث ذخعقسث غخع صثقث مخخنهرل بخق ثطحهقثي خر {expiration_date}Ⱥɔɔǝss ʇø ʇɥǝ ɔønɹsǝ ʎøn ʍǝɹǝ løøʞᴉnƃ ɟøɹ ǝxdᴉɹǝd øn {expiration_date}
