Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: IDPs with this set to True will be excluded from the dropdown IDP selection in the EnterpriseCustomer Django Admin form.
rtl: هيحس صهفا فاهس سثف فخ فقعث صهمم زث ثطذمعيثي بقخو فاث يقخحيخصر هيح سثمثذفهخر هر فاث ثرفثقحقهسثذعسفخوثق يتشرلخ شيوهر بخقو.

source: The Site that this SAML configuration belongs to.
rtl: فاث سهفث فاشف فاهس سشوم ذخربهلعقشفهخر زثمخرلس فخ.ƗĐⱣs ʍᴉʇɥ ʇɥᴉs sǝʇ ʇø Ŧɹnǝ ʍᴉll bǝ ǝxɔlndǝd ɟɹøɯ ʇɥǝ dɹøddøʍn ƗĐⱣ sǝlǝɔʇᴉøn ᴉn ʇɥǝ ɆnʇǝɹdɹᴉsǝȻnsʇøɯǝɹ Đɾɐnƃø Ⱥdɯᴉn ɟøɹɯ.

source: {platform_name} Support
rtl: {platform_name} سعححخقف

source: A configuration nickname.
rtl: Ⱥ ɔønɟᴉƃnɹɐʇᴉøn nᴉɔʞnɐɯǝ.

source: Please wait
rtl: حمثشسث صشهف

# am/pm indicator
source: AM
rtl: شو

# am/pm indicator
source: PM
rtl: حو

# weekday name
source: Monday
rtl: وخريشغ

# weekday name
source: Tuesday
rtl: فعثسيشغ

# weekday name
source: Wednesday
rtl: صثيرثسيشغ

# weekday name
source: Thursday
rtl: فاعقسيشغ

# weekday name
source: Friday
rtl: بقهيشغ

# weekday name
source: Saturday
rtl: سشفعقيشغ

# weekday name
source: Sunday
rtl: سعريشغ

# abbreviated weekday name
source: Mon
rtl: وخر

# abbreviated weekday name
source: Tue
rtl: فعث

# abbreviated weekday name
source: Wed
rtl: صثي

# abbreviated weekday name
source: Thu
rtl: فاع

# abbreviated weekday name
source: Fri
rtl: بقه

# abbreviated weekday name
source: Sat
rtl: سشف

# abbreviated weekday name
source: Sun
rtl: سعر

# abbreviated month name
source: Jan
rtl: تشر

# abbreviated month name
source: Feb
rtl: بثز

# abbreviated month name
source: Mar
rtl: وشق

# abbreviated month name
source: Apr
rtl: شحق

# abbreviated month name
source: May
rtl: وشغ

# abbreviated month name
source: Jun
rtl: تعر

# abbreviated month name
source: Jul
rtl: تعم

# abbreviated month name
source: Aug
rtl: شعل

# abbreviated month name
source: Sep
rtl: سثح

# abbreviated month name
source: Oct
rtl: خذف

# abbreviated month name
source: Nov
rtl: رخد

# abbreviated month name
source: Dec
rtl: يثذ

# month name
source: January
rtl: تشرعشقغ

# month name
source: February
rtl: بثزقعشقغ

# month name
source: March
rtl: وشقذا

# month name
source: April
rtl: شحقهم

# month name
source: May
rtl: وشغ

# month name
source: June
rtl: تعرث

# month name
source: July
rtl: تعمغ

# month name
source: August
rtl: شعلعسف

# month name
source: September
rtl: سثحفثوزثق

# month name
source: October
rtl: خذفخزثق

# month name
source: November
rtl: رخدثوزثق

# month name
source: December
rtl: يثذثوزثق

source: The file must end with the extension '{file_types}'.
rtl: فاث بهمث وعسف ثري صهفا فاث ثطفثرسهخر '{file_types}'.

source: Maximum upload file size is {file_size} bytes.
rtl: وشطهوعو عحمخشي بهمث سهظث هس {file_size} زغفثس.

source: Course {course_id} requires {prerequisite_course_id}
rtl: ذخعقسث {course_id} قثضعهقثس {prerequisite_course_id}

source: System defined milestone
rtl: سغسفثو يثبهرثي وهمثسفخرث

source: Your password must contain {length_instruction}, including {complexity_instructions}.
rtl: غخعق حشسسصخقي وعسف ذخرفشهر {length_instruction}, هرذمعيهرل Ɏønɹ dɐssʍøɹd ɯnsʇ ɔønʇɐᴉn {length_instruction}, ᴉnɔlndᴉnƃ {complexity_instructions}.

source: Your password must contain {length_instruction}.
rtl: غخعق حشسسصخقي وعسف ذخرفشهر {length_instruction}.

source: Invalid password.
rtl: هردشمهي حشسسصخقي.

source: at least %(min_length)d character
rtl: شف مثشسف %(min_length)d ذاشقشذفثق

source: This password is too long. It must contain no more than %(max_length)d character.
rtl: فاهس حشسسصخقي هس فخخ مخرل. هف وعسف ذخرفشهر رخ وخقث فاشر %(max_length)d ذاشقشذفثق.

source: Your password must contain no more than %(max_length)d character.
rtl: غخعق حشسسصخقي وعسف ذخرفشهر رخ وخقث فاشر %(max_length)d ذاشقشذفثق.

source: This password must contain at least %(min_alphabetic)d letter.
rtl: فاهس حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_alphabetic)d مثففثق.

source: Your password must contain at least %(min_alphabetic)d letter.
rtl: غخعق حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_alphabetic)d مثففثق.

source: %(num)d letter
rtl: %(num)d مثففثق

source: This password must contain at least %(min_numeric)d number.
rtl: فاهس حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_numeric)d رعوزثق.

source: Your password must contain at least %(min_numeric)d number.
rtl: غخعق حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_numeric)d رعوزثق.

source: %(num)d number
rtl: %(num)d رعوزثق

source: This password must contain at least %(min_upper)d uppercase letter.
rtl: فاهس حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_upper)d عححثقذشسث مثففثق.

source: Your password must contain at least %(min_upper)d uppercase letter.
rtl: غخعق حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_upper)d عححثقذشسث مثففثق.

source: %(num)d uppercase letter
rtl: %(num)d عححثقذشسث مثففثق

source: This password must contain at least %(min_lower)d lowercase letter.
rtl: فاهس حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_lower)d مخصثقذشسث مثففثق.

source: Your password must contain at least %(min_lower)d lowercase letter.
rtl: غخعق حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_lower)d مخصثقذشسث مثففثق.

source: %(num)d lowercase letter
rtl: %(num)d مخصثقذشسث مثففثق

source: This password must contain at least %(min_punctuation)d punctuation mark.
rtl: فاهس حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_punctuation)d حعرذفعشفهخر وشقن.

source: Your password must contain at least %(min_punctuation)d punctuation mark.
rtl: غخعق حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_punctuation)d حعرذفعشفهخر وشقن.

source: %(num)d punctuation mark
rtl: %(num)d حعرذفعشفهخر وشقن

source: This password must contain at least %(min_symbol)d symbol.
rtl: فاهس حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_symbol)d سغوزخم.

source: Your password must contain at least %(min_symbol)d symbol.
rtl: غخعق حشسسصخقي وعسف ذخرفشهر شف مثشسف %(min_symbol)d سغوزخم.

source: %(num)d symbol
rtl: %(num)d سغوزخم

source: To disable the XBlock and prevent rendering in the LMS, leave "Enabled" deselected; for clarity, update XBlockStudioConfiguration support state accordingly.
rtl: فخ يهسشزمث فاث طزمخذن شري حقثدثرف قثريثقهرل هر فاث موس, مثشدث "ثرشزمثي" يثسثمثذفثي; بخق ذمشقهفغ, عحيشفث طزمخذنسفعيهخذخربهلعقشفهخر سعححخقف سفشفث شذذخقيهرلمغ.Ŧø dᴉsɐblǝ ʇɥǝ XɃløɔʞ ɐnd dɹǝʌǝnʇ ɹǝndǝɹᴉnƃ ᴉn ʇɥǝ ŁMS, lǝɐʌǝ "Ɇnɐblǝd" dǝsǝlǝɔʇǝd; ɟøɹ ɔlɐɹᴉʇʎ, nddɐʇǝ XɃløɔʞSʇndᴉøȻønɟᴉƃnɹɐʇᴉøn snddøɹʇ sʇɐʇǝ ɐɔɔøɹdᴉnƃlʎ.

source: Only XBlocks listed in a course's Advanced Module List can be flagged as deprecated. Remember to update XBlockStudioConfiguration support state accordingly, as deprecated does not impact whether or not new XBlock instances can be created in Studio.
rtl: خرمغ طزمخذنس مهسفثي هر ش ذخعقسث'س شيدشرذثي وخيعمث مهسف ذشر زث بمشللثي شس يثحقثذشفثي. قثوثوزثق فخ عحيشفث طزمخذنسفعيهخذخربهلعقشفهخر سعححخقف سفشفث شذذخقيهرلمغ, شس يثحقثذشفثي يخثس رخف هوحشذف صاثفاثق خق رخف رثص طزمخذن هرسفشرذثس ذشر زث ذقثشفثي هر سفعيهخ.Ønlʎ XɃløɔʞs lᴉsʇǝd ᴉn ɐ ɔønɹsǝ's Ⱥdʌɐnɔǝd Mødnlǝ Łᴉsʇ ɔɐn bǝ ɟlɐƃƃǝd ɐs dǝdɹǝɔɐʇǝd. Ɍǝɯǝɯbǝɹ ʇø nddɐʇǝ XɃløɔʞSʇndᴉøȻønɟᴉƃnɹɐʇᴉøn snddøɹʇ sʇɐʇǝ ɐɔɔøɹdᴉnƃlʎ, ɐs dǝdɹǝɔɐʇǝd døǝs nøʇ ᴉɯdɐɔʇ ʍɥǝʇɥǝɹ øɹ nøʇ nǝʍ XɃløɔʞ ᴉnsʇɐnɔǝs ɔɐn bǝ ɔɹǝɐʇǝd ᴉn Sʇndᴉø.

source: XBlock/template combinations that are disabled cannot be edited in Studio, regardless of support level. Remember to also check if all instances of the XBlock are disabled in XBlockConfiguration.
rtl: طزمخذن/فثوحمشفث ذخوزهرشفهخرس فاشف شقث يهسشزمثي ذشررخف زث ثيهفثي هر سفعيهخ, قثلشقيمثسس خب سعححخقف مثدثم. قثوثوزثق فخ شمسخ ذاثذن هب شمم هرسفشرذثس خب فاث طزمخذن شقث يهسشزمثي هر طزمخذنذخربهلعقشفهخر.XɃløɔʞ/ʇǝɯdlɐʇǝ ɔøɯbᴉnɐʇᴉøns ʇɥɐʇ ɐɹǝ dᴉsɐblǝd ɔɐnnøʇ bǝ ǝdᴉʇǝd ᴉn Sʇndᴉø, ɹǝƃɐɹdlǝss øɟ snddøɹʇ lǝʌǝl. Ɍǝɯǝɯbǝɹ ʇø ɐlsø ɔɥǝɔʞ ᴉɟ ɐll ᴉnsʇɐnɔǝs øɟ ʇɥǝ XɃløɔʞ ɐɹǝ dᴉsɐblǝd ᴉn XɃløɔʞȻønɟᴉƃnɹɐʇᴉøn.

source: Enabled XBlock/template combinations with full or provisional support can always be created in Studio. Unsupported XBlock/template combinations require course author opt-in.
rtl: ثرشزمثي طزمخذن/فثوحمشفث ذخوزهرشفهخرس صهفا بعمم خق حقخدهسهخرشم سعححخقف ذشر شمصشغس زث ذقثشفثي هر سفعيهخ. عرسعححخقفثي طزمخذن/فثوحمشفث ذخوزهرشفهخرس قثضعهقث ذخعقسث شعفاخق خحف-هر.

source: show deprecation messaging in Studio
rtl: ساخص يثحقثذشفهخر وثسسشلهرل هر سفعيهخ

source: Fully Supported
rtl: بعممغ سعححخقفثي

source: Provisionally Supported
rtl: حقخدهسهخرشممغ سعححخقفثي

source: Unsupported
rtl: عرسعححخقفثي

source: Cannot rescore problems with possible file submissions
rtl: ذشررخف قثسذخقث حقخزمثوس صهفا حخسسهزمث بهمث سعزوهسسهخرس

source: Question {}
rtl: ضعثسفهخر {}Ɇnɐblǝd XɃløɔʞ/ʇǝɯdlɐʇǝ ɔøɯbᴉnɐʇᴉøns ʍᴉʇɥ ɟnll øɹ dɹøʌᴉsᴉønɐl snddøɹʇ ɔɐn ɐlʍɐʎs bǝ ɔɹǝɐʇǝd ᴉn Sʇndᴉø. Ʉnsnddøɹʇǝd XɃløɔʞ/ʇǝɯdlɐʇǝ ɔøɯbᴉnɐʇᴉøns ɹǝbnᴉɹǝ ɔønɹsǝ ɐnʇɥøɹ ødʇ-ᴉn.

source: Incorrect
rtl: هرذخققثذف

source: Correct
rtl: ذخققثذف

source: correct
rtl: ذخققثذف

source: incorrect
rtl: هرذخققثذف

source: partially correct
rtl: حشقفهشممغ ذخققثذف

source: incomplete
rtl: هرذخوحمثفث

source: unanswered
rtl: عرشرسصثقثي

source: submitted
rtl: سعزوهففثي

source: processing
rtl: حقخذثسسهرل

source: This answer is correct.
rtl: فاهس شرسصثق هس ذخققثذف.

source: This answer is incorrect.
rtl: فاهس شرسصثق هس هرذخققثذف.

source: This answer is partially correct.
rtl: فاهس شرسصثق هس حشقفهشممغ ذخققثذف.

source: This answer is being processed.
rtl: فاهس شرسصثق هس زثهرل حقخذثسسثي.

source: Not yet answered.
rtl: رخف غثف شرسصثقثي.

source: Select an option
rtl: سثمثذف شر خحفهخر

source: ChoiceGroup: unexpected tag {tag_name}
rtl: ذاخهذثلقخعح: عرثطحثذفثي فشل {tag_name}

source: Answer received.
rtl: شرسصثق قثذثهدثي.

source: Expected a <choice> or <compoundhint> tag; got {given_tag} instead
rtl: ثطحثذفثي ش <choice> خق <compoundhint> فشل; لخف {given_tag} هرسفثشي

source: Your files have been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
rtl: غخعق بهمثس اشدث زثثر سعزوهففثي. شس سخخر شس غخعق سعزوهسسهخر هس لقشيثي, فاهس وثسسشلث صهمم زث قثحمشذثي صهفا فاث لقشيثق'س بثثيزشذن.Ɏønɹ ɟᴉlǝs ɥɐʌǝ bǝǝn snbɯᴉʇʇǝd. Ⱥs søøn ɐs ʎønɹ snbɯᴉssᴉøn ᴉs ƃɹɐdǝd, ʇɥᴉs ɯǝssɐƃǝ ʍᴉll bǝ ɹǝdlɐɔǝd ʍᴉʇɥ ʇɥǝ ƃɹɐdǝɹ's ɟǝǝdbɐɔʞ.

source: Your answer has been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
rtl: غخعق شرسصثق اشس زثثر سعزوهففثي. شس سخخر شس غخعق سعزوهسسهخر هس لقشيثي, فاهس وثسسشلث صهمم زث قثحمشذثي صهفا فاث لقشيثق'س بثثيزشذن.Ɏønɹ ɐnsʍǝɹ ɥɐs bǝǝn snbɯᴉʇʇǝd. Ⱥs søøn ɐs ʎønɹ snbɯᴉssᴉøn ᴉs ƃɹɐdǝd, ʇɥᴉs ɯǝssɐƃǝ ʍᴉll bǝ ɹǝdlɐɔǝd ʍᴉʇɥ ʇɥǝ ƃɹɐdǝɹ's ɟǝǝdbɐɔʞ.

source: {programming_language} editor
rtl: {programming_language} ثيهفخق

source: Press ESC then TAB or click outside of the code editor to exit
rtl: حقثسس ثسذ فاثر فشز خق ذمهذن خعفسهيث خب فاث ذخيث ثيهفخق فخ ثطهف

source: Submitted. As soon as a response is returned, this message will be replaced by that feedback.
rtl: سعزوهففثي. شس سخخر شس ش قثسحخرسث هس قثفعقرثي, فاهس وثسسشلث صهمم زث قثحمشذثي زغ فاشف بثثيزشذن.Snbɯᴉʇʇǝd. Ⱥs søøn ɐs ɐ ɹǝsdønsǝ ᴉs ɹǝʇnɹnǝd, ʇɥᴉs ɯǝssɐƃǝ ʍᴉll bǝ ɹǝdlɐɔǝd bʎ ʇɥɐʇ ɟǝǝdbɐɔʞ.

source: No response from Xqueue within {xqueue_timeout} seconds. Aborted.
rtl: رخ قثسحخرسث بقخو طضعثعث صهفاهر {xqueue_timeout} سثذخريس. شزخقفثي.

source: Error running code.
rtl: ثققخق قعررهرل ذخيث.

source: Cannot connect to the queue
rtl: ذشررخف ذخررثذف فخ فاث ضعثعث

source: No formula specified.
rtl: رخ بخقوعمش سحثذهبهثي.

source: Couldn't parse formula: {error_msg}
rtl: ذخعمير'ف حشقسث بخقوعمش: {error_msg}

source: Error while rendering preview
rtl: ثققخق صاهمث قثريثقهرل حقثدهثص

source: Sorry, couldn't parse formula
rtl: سخققغ, ذخعمير'ف حشقسث بخقوعمش

source: {input_type}: unexpected tag {tag_name}
rtl: {input_type}: عرثطحثذفثي فشل {tag_name}

source: Expected a {expected_tag} tag; got {given_tag} instead
rtl: ثطحثذفثي ش {expected_tag} فشل; لخف {given_tag} هرسفثشي

source: Question {index}
rtl: ضعثسفهخر {index}

source: Correct:
rtl: ذخققثذف:

source: Incorrect:
rtl: هرذخققثذف:

source: Answer
rtl: شرسصثق

source: Error {err} in evaluating hint function {hintfn}.
rtl: ثققخق {err} هر ثدشمعشفهرل اهرف بعرذفهخر {hintfn}.

source: (Source code line unavailable)
rtl: (سخعقذث ذخيث مهرث عرشدشهمشزمث)

source: See XML source line {sourcenum}.
rtl: سثث طوم سخعقذث مهرث {sourcenum}.

source: Checkboxes
rtl: ذاثذنزخطثس

source: Multiple Choice
rtl: وعمفهحمث ذاخهذث

source: Do not use shuffle and answer-pool at the same time
rtl: يخ رخف عسث ساعببمث شري شرسصثق-حخخم شف فاث سشوث فهوث

source: answer-pool value should be an integer
rtl: شرسصثق-حخخم دشمعث ساخعمي زث شر هرفثلثق

source: Choicegroup must include at least 1 correct and 1 incorrect choice
rtl: ذاخهذثلقخعح وعسف هرذمعيث شف مثشسف 1 ذخققثذف شري 1 هرذخققثذف ذاخهذث

source: True/False Choice
rtl: فقعث/بشمسث ذاخهذث

source: Dropdown
rtl: يقخحيخصر

source: Numerical Input
rtl: رعوثقهذشم هرحعف

source: There was a problem with the staff answer to this problem.
rtl: فاثقث صشس ش حقخزمثو صهفا فاث سفشبب شرسصثق فخ فاهس حقخزمثو.

source: Could not interpret '{student_answer}' as a number.
rtl: ذخعمي رخف هرفثقحقثف '{student_answer}' شس ش رعوزثق.

source: Factorial function evaluated outside its domain:'{student_answer}'
rtl: بشذفخقهشم بعرذفهخر ثدشمعشفثي خعفسهيث هفس يخوشهر:'{student_answer}'

source: Invalid math syntax: '{student_answer}'
rtl: هردشمهي وشفا سغرفشط: '{student_answer}'

source: You may not use complex numbers in range tolerance problems
rtl: غخع وشغ رخف عسث ذخوحمثط رعوزثقس هر قشرلث فخمثقشرذث حقخزمثوس

source: There was a problem with the staff answer to this problem: complex boundary.
rtl: فاثقث صشس ش حقخزمثو صهفا فاث سفشبب شرسصثق فخ فاهس حقخزمثو: ذخوحمثط زخعريشقغ.Ŧɥǝɹǝ ʍɐs ɐ dɹøblǝɯ ʍᴉʇɥ ʇɥǝ sʇɐɟɟ ɐnsʍǝɹ ʇø ʇɥᴉs dɹøblǝɯ: ɔøɯdlǝx bønndɐɹʎ.

source: There was a problem with the staff answer to this problem: empty boundary.
rtl: فاثقث صشس ش حقخزمثو صهفا فاث سفشبب شرسصثق فخ فاهس حقخزمثو: ثوحفغ زخعريشقغ.Ŧɥǝɹǝ ʍɐs ɐ dɹøblǝɯ ʍᴉʇɥ ʇɥǝ sʇɐɟɟ ɐnsʍǝɹ ʇø ʇɥᴉs dɹøblǝɯ: ǝɯdʇʎ bønndɐɹʎ.

source: or
rtl: خق

source: Text Input
rtl: فثطف هرحعف

source: error
rtl: ثققخق

source: Custom Evaluated Script
rtl: ذعسفخو ثدشمعشفثي سذقهحف

source: error getting student answer from {student_answers}
rtl: ثققخق لثففهرل سفعيثرف شرسصثق بقخو {student_answers}

source: No answer entered!
rtl: رخ شرسصثق ثرفثقثي!

source: CustomResponse: check function returned an invalid dictionary!
rtl: ذعسفخوقثسحخرسث: ذاثذن بعرذفهخر قثفعقرثي شر هردشمهي يهذفهخرشقغ!

source: Symbolic Math Input
rtl: سغوزخمهذ وشفا هرحعف

source: An error occurred with SymbolicResponse. The error was: {error_msg}
rtl: شر ثققخق خذذعققثي صهفا سغوزخمهذقثسحخرسث. فاث ثققخق صشس: {error_msg}

source: Code Input
rtl: ذخيث هرحعف

source: No answer provided.
rtl: رخ شرسصثق حقخدهيثي.

source: Error: No grader has been set up for this problem.
rtl: ثققخق: رخ لقشيثق اشس زثثر سثف عح بخق فاهس حقخزمثو.

source: Unable to deliver your submission to grader (Reason: {error_msg}). Please try again later.
rtl: عرشزمث فخ يثمهدثق غخعق سعزوهسسهخر فخ لقشيثق (قثشسخر: {error_msg}). حمثشسث فقغ شلشهر مشفثق.Ʉnɐblǝ ʇø dǝlᴉʌǝɹ ʎønɹ snbɯᴉssᴉøn ʇø ƃɹɐdǝɹ (Ɍǝɐsøn: {error_msg}). Ᵽlǝɐsǝ ʇɹʎ ɐƃɐᴉn lɐʇǝɹ.

source: Invalid grader reply. Please contact the course staff.
rtl: هردشمهي لقشيثق قثحمغ. حمثشسث ذخرفشذف فاث ذخعقسث سفشبب.

source: External Grader
rtl: ثطفثقرشم لقشيثق

source: Math Expression Input
rtl: وشفا ثطحقثسسهخر هرحعف

source: Factorial function not permitted in answer for this problem. Provided answer was: {bad_input}
rtl: بشذفخقهشم بعرذفهخر رخف حثقوهففثي هر شرسصثق بخق فاهس حقخزمثو. حقخدهيثي شرسصثق صشس: {bad_input}Fɐɔʇøɹᴉɐl ɟnnɔʇᴉøn nøʇ dǝɹɯᴉʇʇǝd ᴉn ɐnsʍǝɹ ɟøɹ ʇɥᴉs dɹøblǝɯ. Ᵽɹøʌᴉdǝd ɐnsʍǝɹ ʍɐs: {bad_input}

source: Invalid input: Could not parse '{bad_input}' as a formula.
rtl: هردشمهي هرحعف: ذخعمي رخف حشقسث '{bad_input}' شس ش بخقوعمش.

source: Invalid input: Could not parse '{bad_input}' as a formula
rtl: هردشمهي هرحعف: ذخعمي رخف حشقسث '{bad_input}' شس ش بخقوعمش

source: Circuit Schematic Builder
rtl: ذهقذعهف سذاثوشفهذ زعهميثق

source: Error in evaluating SchematicResponse. The error was: {error_msg}
rtl: ثققخق هر ثدشمعشفهرل سذاثوشفهذقثسحخرسث. فاث ثققخق صشس: {error_msg}

source: Image Mapped Input
rtl: هوشلث وشححثي هرحعف

source: error grading {image_input_id} (input={user_input})
rtl: ثققخق لقشيهرل {image_input_id} (هرحعف={user_input})

source: Error in problem specification! Cannot parse rectangle in {sr_coords}
rtl: ثققخق هر حقخزمثو سحثذهبهذشفهخر! ذشررخف حشقسث قثذفشرلمث هر {sr_coords}

source: Annotation Input
rtl: شررخفشفهخر هرحعف

source: Checkboxes With Text Input
rtl: ذاثذنزخطثس صهفا فثطف هرحعف

source: Answer not provided for {input_type}
rtl: شرسصثق رخف حقخدهيثي بخق {input_type}

source: The Staff answer could not be interpreted as a number.
rtl: فاث سفشبب شرسصثق ذخعمي رخف زث هرفثقحقثفثي شس ش رعوزثق.

source: Could not interpret '{given_answer}' as a number.
rtl: ذخعمي رخف هرفثقحقثف '{given_answer}' شس ش رعوزثق.

source: XML data for the annotation
rtl: طوم يشفش بخق فاث شررخفشفهخر

source: Codejail API Service is unavailable. Please try again in a few minutes.
rtl: Ȼødǝɾɐᴉl ȺⱣƗ Sǝɹʌᴉɔǝ ᴉs nnɐʌɐᴉlɐblǝ. Ᵽlǝɐsǝ ʇɹʎ ɐƃɐᴉn ᴉn ɐ ɟǝʍ ɯᴉnnʇǝs.

source: Codejail API Service invalid response.
rtl: Ȼødǝɾɐᴉl ȺⱣƗ Sǝɹʌᴉɔǝ ᴉnʌɐlᴉd ɹǝsdønsǝ.

source: Invalid JSON response received from codejail api service.
rtl: Ɨnʌɐlᴉd ɈSØN ɹǝsdønsǝ ɹǝɔǝᴉʌǝd ɟɹøɯ ɔødǝɾɐᴉl ɐdᴉ sǝɹʌᴉɔǝ.

source: The display name for this component.
rtl: فاث يهسحمشغ رشوث بخق فاهس ذخوحخرثرف.

source: Annotation
rtl: شررخفشفهخر

source: Blank Advanced Problem
rtl: زمشرن شيدشرذثي حقخزمثو

source: Number of attempts taken by the student on this problem
rtl: رعوزثق خب شففثوحفس فشنثر زغ فاث سفعيثرف خر فاهس حقخزمثو

source: Maximum Attempts
rtl: وشطهوعو شففثوحفس

source: Defines the number of times a student can try to answer this problem. If the value is not set, infinite attempts are allowed.
rtl: يثبهرثس فاث رعوزثق خب فهوثس ش سفعيثرف ذشر فقغ فخ شرسصثق فاهس حقخزمثو. هب فاث دشمعث هس رخف سثف, هربهرهفث شففثوحفس شقث شممخصثي.

source: Date that this problem is due by
rtl: يشفث فاشف فاهس حقخزمثو هس يعث زغ

source: Amount of time after the due date that submissions will be accepted
rtl: شوخعرف خب فهوث شبفثق فاث يعث يشفث فاشف سعزوهسسهخرس صهمم زث شذذثحفثيĐǝɟᴉnǝs ʇɥǝ nnɯbǝɹ øɟ ʇᴉɯǝs ɐ sʇndǝnʇ ɔɐn ʇɹʎ ʇø ɐnsʍǝɹ ʇɥᴉs dɹøblǝɯ. Ɨɟ ʇɥǝ ʌɐlnǝ ᴉs nøʇ sǝʇ, ᴉnɟᴉnᴉʇǝ ɐʇʇǝɯdʇs ɐɹǝ ɐlløʍǝd.

source: Show Results
rtl: ساخص قثسعمفس

source: Defines when to show whether a learner's answer to the problem is correct. Configured on the subsection.
rtl: يثبهرثس صاثر فخ ساخص صاثفاثق ش مثشقرثق'س شرسصثق فخ فاث حقخزمثو هس ذخققثذف. ذخربهلعقثي خر فاث سعزسثذفهخر.

source: Always
rtl: شمصشغس

source: Never
rtl: رثدثق

source: Past Due
rtl: حشسف يعثĐǝɟᴉnǝs ʍɥǝn ʇø sɥøʍ ʍɥǝʇɥǝɹ ɐ lǝɐɹnǝɹ's ɐnsʍǝɹ ʇø ʇɥǝ dɹøblǝɯ ᴉs ɔøɹɹǝɔʇ. Ȼønɟᴉƃnɹǝd øn ʇɥǝ snbsǝɔʇᴉøn.

source: Show Answer
rtl: ساخص شرسصثق

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
rtl: يثبهرثس صاثر فخ ساخص فاث شرسصثق فخ فاث حقخزمثو. ش يثبشعمف دشمعث ذشر زث سثف هر شيدشرذثي سثففهرلس.

source: Answered
rtl: شرسصثقثي

source: Attempted or Past Due
rtl: شففثوحفثي خق حشسف يعث

source: Closed
rtl: ذمخسثي

source: Finished
rtl: بهرهساثي

source: Correct or Past Due
rtl: ذخققثذف خق حشسف يعث

source: After Some Number of Attempts
rtl: شبفثق سخوث رعوزثق خب شففثوحفس

source: After All Attempts
rtl: شبفثق شمم شففثوحفس

source: After All Attempts or Correct
rtl: شبفثق شمم شففثوحفس خق ذخققثذف

source: Attempted
rtl: شففثوحفثي

source: Show Answer: Number of Attempts
rtl: ساخص شرسصثق: رعوزثق خب شففثوحفسĐǝɟᴉnǝs ʍɥǝn ʇø sɥøʍ ʇɥǝ ɐnsʍǝɹ ʇø ʇɥǝ dɹøblǝɯ. Ⱥ dǝɟɐnlʇ ʌɐlnǝ ɔɐn bǝ sǝʇ ᴉn Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs.

source: Number of times the student must attempt to answer the question before the Show Answer button appears.
rtl: رعوزثق خب فهوثس فاث سفعيثرف وعسف شففثوحف فخ شرسصثق فاث ضعثسفهخر زثبخقث فاث ساخص شرسصثق زعففخر شححثشقس.

source: Whether to force the save button to appear on the page
rtl: صاثفاثق فخ بخقذث فاث سشدث زعففخر فخ شححثشق خر فاث حشلث

source: Show Reset Button
rtl: ساخص قثسثف زعففخرNnɯbǝɹ øɟ ʇᴉɯǝs ʇɥǝ sʇndǝnʇ ɯnsʇ ɐʇʇǝɯdʇ ʇø ɐnsʍǝɹ ʇɥǝ bnǝsʇᴉøn bǝɟøɹǝ ʇɥǝ Sɥøʍ Ⱥnsʍǝɹ bnʇʇøn ɐddǝɐɹs.

source: Determines whether a 'Reset' button is shown so the user may reset their answer. A default value can be set in Advanced Settings.
rtl: يثفثقوهرثس صاثفاثق ش 'قثسثف' زعففخر هس ساخصر سخ فاث عسثق وشغ قثسثف فاثهق شرسصثق. ش يثبشعمف دشمعث ذشر زث سثف هر شيدشرذثي سثففهرلس.Đǝʇǝɹɯᴉnǝs ʍɥǝʇɥǝɹ ɐ 'Ɍǝsǝʇ' bnʇʇøn ᴉs sɥøʍn sø ʇɥǝ nsǝɹ ɯɐʎ ɹǝsǝʇ ʇɥǝᴉɹ ɐnsʍǝɹ. Ⱥ dǝɟɐnlʇ ʌɐlnǝ ɔɐn bǝ sǝʇ ᴉn Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs.

source: Randomization
rtl: قشريخوهظشفهخر

source: Defines when to randomize the variables specified in the associated Python script. For problems that do not randomize values, specify "Never".
rtl: يثبهرثس صاثر فخ قشريخوهظث فاث دشقهشزمثس سحثذهبهثي هر فاث شسسخذهشفثي حغفاخر سذقهحف. بخق حقخزمثوس فاشف يخ رخف قشريخوهظث دشمعثس, سحثذهبغ "رثدثق".

source: On Reset
rtl: خر قثسثف

source: Per Student
rtl: حثق سفعيثرف

source: XML data for the problem
rtl: طوم يشفش بخق فاث حقخزمثو

source: Dictionary with the correctness of current student answers
rtl: يهذفهخرشقغ صهفا فاث ذخققثذفرثسس خب ذعققثرف سفعيثرف شرسصثقس

source: Dictionary for maintaining the state of inputtypes
rtl: يهذفهخرشقغ بخق وشهرفشهرهرل فاث سفشفث خب هرحعففغحثس

source: Dictionary with the current student responses
rtl: يهذفهخرشقغ صهفا فاث ذعققثرف سفعيثرف قثسحخرسثس

source: Dictionary with the current student score
rtl: يهذفهخرشقغ صهفا فاث ذعققثرف سفعيثرف سذخقث

source: Whether or not the answers have been saved since last submit
rtl: صاثفاثق خق رخف فاث شرسصثقس اشدث زثثر سشدثي سهرذث مشسف سعزوهف

source: Whether the student has answered the problem
rtl: صاثفاثق فاث سفعيثرف اشس شرسصثقثي فاث حقخزمثو

source: Random seed for this student
rtl: قشريخو سثثي بخق فاهس سفعيثرف

source: Last submission time
rtl: مشسف سعزوهسسهخر فهوث

source: Timer Between Attempts
rtl: فهوثق زثفصثثر شففثوحفسĐǝɟᴉnǝs ʍɥǝn ʇø ɹɐndøɯᴉzǝ ʇɥǝ ʌɐɹᴉɐblǝs sdǝɔᴉɟᴉǝd ᴉn ʇɥǝ ɐssøɔᴉɐʇǝd Ᵽʎʇɥøn sɔɹᴉdʇ. Føɹ dɹøblǝɯs ʇɥɐʇ dø nøʇ ɹɐndøɯᴉzǝ ʌɐlnǝs, sdǝɔᴉɟʎ "Nǝʌǝɹ".

source: Seconds a student must wait between submissions for a problem with multiple attempts.
rtl: سثذخريس ش سفعيثرف وعسف صشهف زثفصثثر سعزوهسسهخرس بخق ش حقخزمثو صهفا وعمفهحمث شففثوحفس.

source: Problem Weight
rtl: حقخزمثو صثهلافSǝɔønds ɐ sʇndǝnʇ ɯnsʇ ʍɐᴉʇ bǝʇʍǝǝn snbɯᴉssᴉøns ɟøɹ ɐ dɹøblǝɯ ʍᴉʇɥ ɯnlʇᴉdlǝ ɐʇʇǝɯdʇs.

source: Defines the number of points each problem is worth. If the value is not set, each response field in the problem is worth one point.
rtl: يثبهرثس فاث رعوزثق خب حخهرفس ثشذا حقخزمثو هس صخقفا. هب فاث دشمعث هس رخف سثف, ثشذا قثسحخرسث بهثمي هر فاث حقخزمثو هس صخقفا خرث حخهرف.

source: Markdown source of this module
rtl: وشقنيخصر سخعقذث خب فاهس وخيعمثĐǝɟᴉnǝs ʇɥǝ nnɯbǝɹ øɟ døᴉnʇs ǝɐɔɥ dɹøblǝɯ ᴉs ʍøɹʇɥ. Ɨɟ ʇɥǝ ʌɐlnǝ ᴉs nøʇ sǝʇ, ǝɐɔɥ ɹǝsdønsǝ ɟᴉǝld ᴉn ʇɥǝ dɹøblǝɯ ᴉs ʍøɹʇɥ ønǝ døᴉnʇ.

source: Source code for LaTeX and Word problems. This feature is not well-supported.
rtl: سخعقذث ذخيث بخق مشفثط شري صخقي حقخزمثوس. فاهس بثشفعقث هس رخف صثمم-سعححخقفثي.Sønɹɔǝ ɔødǝ ɟøɹ ŁɐŦǝX ɐnd Wøɹd dɹøblǝɯs. Ŧɥᴉs ɟǝɐʇnɹǝ ᴉs nøʇ ʍǝll-snddøɹʇǝd.

source: Enable LaTeX templates?
rtl: ثرشزمث مشفثط فثوحمشفثس?

source: Matlab API key
rtl: وشفمشز شحه نثغ
