Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Discussion
rtl: يهسذعسسهخر

source: Text
rtl: Ŧǝxʇ

source: Problem
rtl: حقخزمثو

source: Video
rtl: دهيثخ

source: Advanced
rtl: شيدشرذثي

source: Entrance Exam
rtl: ثرفقشرذث ثطشو

source: Unit
rtl: عرهف

source: Empty
rtl: ثوحفغ

source: The following parameters are required: {missing}.
rtl: فاث بخممخصهرل حشقشوثفثقس شقث قثضعهقثي: {missing}.

source: There is a problem with this transcript file. Try to upload a different file.
rtl: فاثقث هس ش حقخزمثو صهفا فاهس فقشرسذقهحف بهمث. فقغ فخ عحمخشي ش يهببثقثرف بهمث.Ŧɥǝɹǝ ᴉs ɐ dɹøblǝɯ ʍᴉʇɥ ʇɥᴉs ʇɹɐnsɔɹᴉdʇ ɟᴉlǝ. Ŧɹʎ ʇø ndløɐd ɐ dᴉɟɟǝɹǝnʇ ɟᴉlǝ.

source: A transcript with the "{language_code}" language code already exists.
rtl: ش فقشرسذقهحف صهفا فاث "{language_code}" مشرلعشلث ذخيث شمقثشيغ ثطهسفس.

source: A transcript file is required.
rtl: ش فقشرسذقهحف بهمث هس قثضعهقثي.

source: Name
rtl: رشوث

source: Video ID
rtl: دهيثخ هي

source: Pending
rtl: حثريهرل

source: Django site admin
rtl: يتشرلخ سهفث شيوهر

source: Django administration
rtl: يتشرلخ شيوهرهسفقشفهخر

source: View site
rtl: دهثص سهفث

source: Documentation
rtl: يخذعوثرفشفهخر

source: Log out
rtl: مخل خعف

source: Mode
rtl: وخيث

source: Verification Deadline
rtl: دثقهبهذشفهخر يثشيمهرث

source: OPTIONAL: After this date/time, users will no longer be able to submit photos for verification. This appies ONLY to modes that require verification.
rtl: خحفهخرشم: شبفثق فاهس يشفث/فهوث, عسثقس صهمم رخ مخرلثق زث شزمث فخ سعزوهف حاخفخس بخق دثقهبهذشفهخر. فاهس شححهثس خرمغ فخ وخيثس فاشف قثضعهقث دثقهبهذشفهخر.

source: Your verification is pending
rtl: غخعق دثقهبهذشفهخر هس حثريهرل

source: Verified: Pending Verification
rtl: دثقهبهثي: حثريهرل دثقهبهذشفهخر

source: ID verification pending
rtl: هي دثقهبهذشفهخر حثريهرل

source: You're enrolled as a verified student
rtl: غخع'قث ثرقخممثي شس ش دثقهبهثي سفعيثرفØⱣŦƗØNȺŁ: Ⱥɟʇǝɹ ʇɥᴉs dɐʇǝ/ʇᴉɯǝ, nsǝɹs ʍᴉll nø lønƃǝɹ bǝ ɐblǝ ʇø snbɯᴉʇ dɥøʇøs ɟøɹ ʌǝɹᴉɟᴉɔɐʇᴉøn. Ŧɥᴉs ɐddᴉǝs ØNŁɎ ʇø ɯødǝs ʇɥɐʇ ɹǝbnᴉɹǝ ʌǝɹᴉɟᴉɔɐʇᴉøn.

source: Verified
rtl: دثقهبهثي

source: ID Verified Ribbon/Badge
rtl: هي دثقهبهثي قهززخر/زشيلث

source: You're enrolled as an honor code student
rtl: غخع'قث ثرقخممثي شس شر اخرخق ذخيث سفعيثرف

source: Honor Code
rtl: اخرخق ذخيث

source: You're enrolled as a professional education student
rtl: غخع'قث ثرقخممثي شس ش حقخبثسسهخرشم ثيعذشفهخر سفعيثرف

source: Professional Ed
rtl: حقخبثسسهخرشم ثي

source: Display Name
rtl: يهسحمشغ رشوث

source: Price
rtl: حقهذث

source: Upgrade Deadline
rtl: عحلقشيث يثشيمهرث

source: OPTIONAL: After this date/time, users will no longer be able to enroll in this mode. Leave this blank if users can enroll in this mode until enrollment closes for the course.
rtl: خحفهخرشم: شبفثق فاهس يشفث/فهوث, عسثقس صهمم رخ مخرلثق زث شزمث فخ ثرقخمم هر فاهس وخيث. مثشدث فاهس زمشرن هب عسثقس ذشر ثرقخمم هر فاهس وخيث عرفهم ثرقخمموثرف ذمخسثس بخق فاث ذخعقسث.ØⱣŦƗØNȺŁ: Ⱥɟʇǝɹ ʇɥᴉs dɐʇǝ/ʇᴉɯǝ, nsǝɹs ʍᴉll nø lønƃǝɹ bǝ ɐblǝ ʇø ǝnɹøll ᴉn ʇɥᴉs ɯødǝ. Łǝɐʌǝ ʇɥᴉs blɐnʞ ᴉɟ nsǝɹs ɔɐn ǝnɹøll ᴉn ʇɥᴉs ɯødǝ nnʇᴉl ǝnɹøllɯǝnʇ ɔløsǝs ɟøɹ ʇɥǝ ɔønɹsǝ.

source: OPTIONAL: This is the SKU (stock keeping unit) of this mode in the external ecommerce service. Leave this blank if the course has not yet been migrated to the ecommerce service.
rtl: خحفهخرشم: فاهس هس فاث سنع (سفخذن نثثحهرل عرهف) خب فاهس وخيث هر فاث ثطفثقرشم ثذخووثقذث سثقدهذث. مثشدث فاهس زمشرن هب فاث ذخعقسث اشس رخف غثف زثثر وهلقشفثي فخ فاث ثذخووثقذث سثقدهذث.ØⱣŦƗØNȺŁ: Ŧɥᴉs ᴉs ʇɥǝ SꝀɄ (sʇøɔʞ ʞǝǝdᴉnƃ nnᴉʇ) øɟ ʇɥᴉs ɯødǝ ᴉn ʇɥǝ ǝxʇǝɹnɐl ǝɔøɯɯǝɹɔǝ sǝɹʌᴉɔǝ. Łǝɐʌǝ ʇɥᴉs blɐnʞ ᴉɟ ʇɥǝ ɔønɹsǝ ɥɐs nøʇ ʎǝʇ bǝǝn ɯᴉƃɹɐʇǝd ʇø ʇɥǝ ǝɔøɯɯǝɹɔǝ sǝɹʌᴉɔǝ.

source: This is the bulk SKU (stock keeping unit) of this mode in the external ecommerce service.
rtl: فاهس هس فاث زعمن سنع (سفخذن نثثحهرل عرهف) خب فاهس وخيث هر فاث ثطفثقرشم ثذخووثقذث سثقدهذث.Ŧɥᴉs ᴉs ʇɥǝ bnlʞ SꝀɄ (sʇøɔʞ ʞǝǝdᴉnƃ nnᴉʇ) øɟ ʇɥᴉs ɯødǝ ᴉn ʇɥǝ ǝxʇǝɹnɐl ǝɔøɯɯǝɹɔǝ sǝɹʌᴉɔǝ.

source: Professional education modes are not allowed to have expiration_datetime set.
rtl: حقخبثسسهخرشم ثيعذشفهخر وخيثس شقث رخف شممخصثي فخ اشدث ثطحهقشفهخر_يشفثفهوث سثف.Ᵽɹøɟǝssᴉønɐl ǝdnɔɐʇᴉøn ɯødǝs ɐɹǝ nøʇ ɐlløʍǝd ʇø ɥɐʌǝ ǝxdᴉɹɐʇᴉøn_dɐʇǝʇᴉɯǝ sǝʇ.

source: The {course_mode} course mode has a minimum price of {min_price}. You must set a price greater than or equal to {min_price}.
rtl: فاث {course_mode} ذخعقسث وخيث اشس ش وهرهوعو حقهذث خب {min_price}. غخع وعسف سثف ش حقهذث لقثشفثق فاشر خق ثضعشم فخ {min_price}.Ŧɥǝ {course_mode} ɔønɹsǝ ɯødǝ ɥɐs ɐ ɯᴉnᴉɯnɯ dɹᴉɔǝ øɟ {min_price}. Ɏøn ɯnsʇ sǝʇ ɐ dɹᴉɔǝ ƃɹǝɐʇǝɹ ʇɥɐn øɹ ǝbnɐl ʇø {min_price}.

source: Free
rtl: بقثث

source: The time period before a course ends in which a course mode will expire
rtl: فاث فهوث حثقهخي زثبخقث ش ذخعقسث ثريس هر صاهذا ش ذخعقسث وخيث صهمم ثطحهقثŦɥǝ ʇᴉɯǝ dǝɹᴉød bǝɟøɹǝ ɐ ɔønɹsǝ ǝnds ᴉn ʍɥᴉɔɥ ɐ ɔønɹsǝ ɯødǝ ʍᴉll ǝxdᴉɹǝ

source: Congratulations! You are now enrolled in {course_name}
rtl: ذخرلقشفعمشفهخرس! غخع شقث رخص ثرقخممثي هر {course_name}

source: Enrollment is closed
rtl: ثرقخمموثرف هس ذمخسثي

source: Enrollment mode not supported
rtl: ثرقخمموثرف وخيث رخف سعححخقفثي

source: Invalid amount selected.
rtl: هردشمهي شوخعرف سثمثذفثي.

source: No selected price or selected price is too low.
rtl: رخ سثمثذفثي حقهذث خق سثمثذفثي حقهذث هس فخخ مخص.

source: User profile
rtl: عسثق حقخبهمث

source: Account recovery
rtl: شذذخعرف قثذخدثقغ

source: Password
rtl: حشسسصخقي

source: Raw passwords are not stored, so there is no way to see this user's password.
rtl: قشص حشسسصخقيس شقث رخف سفخقثي, سخ فاثقث هس رخ صشغ فخ سثث فاهس عسثق'س حشسسصخقي.Ɍɐʍ dɐssʍøɹds ɐɹǝ nøʇ sʇøɹǝd, sø ʇɥǝɹǝ ᴉs nø ʍɐʎ ʇø sǝǝ ʇɥᴉs nsǝɹ's dɐssʍøɹd.

source: %(count)d student account was unlocked.
rtl: %(count)d سفعيثرف شذذخعرف صشس عرمخذنثي.

source: Please add a key/value 'THIRD_PARTY_AUTH_ONLY_DOMAIN/{site_email_domain}' in SiteConfiguration model's site_values field.
rtl: حمثشسث شيي ش نثغ/دشمعث 'فاهقي_حشقفغ_شعفا_خرمغ_يخوشهر/{site_email_domain}' هر سهفثذخربهلعقشفهخر وخيثم'س سهفث_دشمعثس بهثمي.Ᵽlǝɐsǝ ɐdd ɐ ʞǝʎ/ʌɐlnǝ 'ŦĦƗɌĐ_ⱣȺɌŦɎ_ȺɄŦĦ_ØNŁɎ_ĐØMȺƗN/{site_email_domain}' ᴉn SᴉʇǝȻønɟᴉƃnɹɐʇᴉøn ɯødǝl's sᴉʇǝ_ʌɐlnǝs ɟᴉǝld.

source: Email doesn't have {allowed_site_email_domain} domain name.
rtl: ثوشهم يخثسر'ف اشدث {allowed_site_email_domain} يخوشهر رشوث.

source: User with this email doesn't exist in system.
rtl: عسثق صهفا فاهس ثوشهم يخثسر'ف ثطهسف هر سغسفثو.

source: An account with the Email '{email}' already exists.
rtl: شر شذذخعرف صهفا فاث ثوشهم '{email}' شمقثشيغ ثطهسفس.

source: An account with the Public Username '{username}' already exists.
rtl: شر شذذخعرف صهفا فاث حعزمهذ عسثقرشوث '{username}' شمقثشيغ ثطهسفس.

source: Your account has been disabled. If you believe this was done in error, please contact us at {support_email}
rtl: غخعق شذذخعرف اشس زثثر يهسشزمثي. هب غخع زثمهثدث فاهس صشس يخرث هر ثققخق, حمثشسث ذخرفشذف عس شف {support_email}

source: Disabled Account
rtl: يهسشزمثي شذذخعرف

source: Male
rtl: وشمث

source: Female
rtl: بثوشمثɎønɹ ɐɔɔønnʇ ɥɐs bǝǝn dᴉsɐblǝd. Ɨɟ ʎøn bǝlᴉǝʌǝ ʇɥᴉs ʍɐs dønǝ ᴉn ǝɹɹøɹ, dlǝɐsǝ ɔønʇɐɔʇ ns ɐʇ {support_email}

source: Other/Prefer Not to Say
rtl: خفاثق/حقثبثق رخف فخ سشغ

source: Doctorate
rtl: يخذفخقشفث

source: Master's or professional degree
rtl: وشسفثق'س خق حقخبثسسهخرشم يثلقثث

source: Bachelor's degree
rtl: زشذاثمخق'س يثلقثث

source: Associate degree
rtl: شسسخذهشفث يثلقثث

source: Secondary/high school
rtl: سثذخريشقغ/اهلا سذاخخم

source: Junior secondary/junior high/middle school
rtl: تعرهخق سثذخريشقغ/تعرهخق اهلا/وهييمث سذاخخم

source: Elementary/primary school
rtl: ثمثوثرفشقغ/حقهوشقغ سذاخخم

source: No formal education
rtl: رخ بخقوشم ثيعذشفهخر

source: Other education
rtl: خفاثق ثيعذشفهخر

source: {platform_name} Honor Code Certificate for {course_name}
rtl: {platform_name} اخرخق ذخيث ذثقفهبهذشفث بخق {course_name}

source: {platform_name} Verified Certificate for {course_name}
rtl: {platform_name} دثقهبهثي ذثقفهبهذشفث بخق {course_name}

source: {platform_name} Professional Certificate for {course_name}
rtl: {platform_name} حقخبثسسهخرشم ذثقفهبهذشفث بخق {course_name}

source: Your organization ID (if your organization has an existing page on LinkedIn) e.g 1337. If not provided, will default to sending Platform Name (e.g. edX) instead.
rtl: غخعق خقلشرهظشفهخر هي (هب غخعق خقلشرهظشفهخر اشس شر ثطهسفهرل حشلث خر مهرنثيهر) ث.ل 1337. هب رخف حقخدهيثي, صهمم يثبشعمف فخ سثريهرل حمشفبخقو رشوث (ث.ل. ثيط) هرسفثشي.Ɏønɹ øɹƃɐnᴉzɐʇᴉøn ƗĐ (ᴉɟ ʎønɹ øɹƃɐnᴉzɐʇᴉøn ɥɐs ɐn ǝxᴉsʇᴉnƃ dɐƃǝ øn ŁᴉnʞǝdƗn) ǝ.ƃ 1337. Ɨɟ nøʇ dɹøʌᴉdǝd, ʍᴉll dǝɟɐnlʇ ʇø sǝndᴉnƃ Ᵽlɐʇɟøɹɯ Nɐɯǝ (ǝ.ƃ. ǝdX) ᴉnsʇǝɐd.

source: {platform_name} Certificate for {course_name}
rtl: {platform_name} ذثقفهبهذشفث بخق {course_name}

source: The ISO 639-1 language code for this language.
rtl: فاث هسخ 639-1 مشرلعشلث ذخيث بخق فاهس مشرلعشلث.

source: Namespace of enrollment attribute
rtl: رشوثسحشذث خب ثرقخمموثرف شففقهزعفث

source: Name of the enrollment attribute
rtl: رشوث خب فاث ثرقخمموثرف شففقهزعفث

source: Value of the enrollment attribute
rtl: دشمعث خب فاث ثرقخمموثرف شففقهزعفث

source: The window of time after enrolling during which users can be granted a refund, represented in microseconds. The default is 14 days.
rtl: فاث صهريخص خب فهوث شبفثق ثرقخممهرل يعقهرل صاهذا عسثقس ذشر زث لقشرفثي ش قثبعري, قثحقثسثرفثي هر وهذقخسثذخريس. فاث يثبشعمف هس 14 يشغس.

source: Name of the UTM cookie
rtl: رشوث خب فاث عفو ذخخنهث

source: Name of the affiliate cookie
rtl: رشوث خب فاث شببهمهشفث ذخخنهثŦɥǝ ʍᴉndøʍ øɟ ʇᴉɯǝ ɐɟʇǝɹ ǝnɹøllᴉnƃ dnɹᴉnƃ ʍɥᴉɔɥ nsǝɹs ɔɐn bǝ ƃɹɐnʇǝd ɐ ɹǝɟnnd, ɹǝdɹǝsǝnʇǝd ᴉn ɯᴉɔɹøsǝɔønds. Ŧɥǝ dǝɟɐnlʇ ᴉs 14 dɐʎs.

source: It expect that the data will be provided in a csv file format with first row being the header and columns will be as follows: user_id, username, email, course_id, is_verified, verification_date
rtl: هف ثطحثذف فاشف فاث يشفش صهمم زث حقخدهيثي هر ش ذسد بهمث بخقوشف صهفا بهقسف قخص زثهرل فاث اثشيثق شري ذخمعورس صهمم زث شس بخممخصس: عسثق_هي, عسثقرشوث, ثوشهم, ذخعقسث_هي, هس_دثقهبهثي, دثقهبهذشفهخر_يشفثƗʇ ǝxdǝɔʇ ʇɥɐʇ ʇɥǝ dɐʇɐ ʍᴉll bǝ dɹøʌᴉdǝd ᴉn ɐ ɔsʌ ɟᴉlǝ ɟøɹɯɐʇ ʍᴉʇɥ ɟᴉɹsʇ ɹøʍ bǝᴉnƃ ʇɥǝ ɥǝɐdǝɹ ɐnd ɔølnɯns ʍᴉll bǝ ɐs ɟølløʍs: nsǝɹ_ᴉd, nsǝɹnɐɯǝ, ǝɯɐᴉl, ɔønɹsǝ_ᴉd, ᴉs_ʌǝɹᴉɟᴉǝd, ʌǝɹᴉɟᴉɔɐʇᴉøn_dɐʇǝ

source: It expect that the data will be provided in a csv file format with first row being the header and columns will be as follows: course_id, username, mode
rtl: هف ثطحثذف فاشف فاث يشفش صهمم زث حقخدهيثي هر ش ذسد بهمث بخقوشف صهفا بهقسف قخص زثهرل فاث اثشيثق شري ذخمعورس صهمم زث شس بخممخصس: ذخعقسث_هي, عسثقرشوث, وخيث

source: Name of this user attribute.
rtl: رشوث خب فاهس عسثق شففقهزعفث.

source: Value of this user attribute.
rtl: دشمعث خب فاهس عسثق شففقهزعفث.

source: Secondary email address
rtl: سثذخريشقغ ثوشهم شييقثسس

source: Secondary email address to recover linked account.
rtl: سثذخريشقغ ثوشهم شييقثسس فخ قثذخدثق مهرنثي شذذخعرف.Ɨʇ ǝxdǝɔʇ ʇɥɐʇ ʇɥǝ dɐʇɐ ʍᴉll bǝ dɹøʌᴉdǝd ᴉn ɐ ɔsʌ ɟᴉlǝ ɟøɹɯɐʇ ʍᴉʇɥ ɟᴉɹsʇ ɹøʍ bǝᴉnƃ ʇɥǝ ɥǝɐdǝɹ ɐnd ɔølnɯns ʍᴉll bǝ ɐs ɟølløʍs: ɔønɹsǝ_ᴉd, nsǝɹnɐɯǝ, ɯødǝ

source: An employee (a user whose email has current site's domain name) whose email exists in this model, can be able to login from login screen through email and password. And if any employee's email doesn't exist in this model then that employee can login via third party authentication backend only.
rtl: شر ثوحمخغثث (ش عسثق صاخسث ثوشهم اشس ذعققثرف سهفث'س يخوشهر رشوث) صاخسث ثوشهم ثطهسفس هر فاهس وخيثم, ذشر زث شزمث فخ مخلهر بقخو مخلهر سذقثثر فاقخعلا ثوشهم شري حشسسصخقي. شري هب شرغ ثوحمخغثث'س ثوشهم يخثسر'ف ثطهسف هر فاهس وخيثم فاثر فاشف ثوحمخغثث ذشر مخلهر دهش فاهقي حشقفغ شعفاثرفهذشفهخر زشذنثري خرمغ.Ⱥn ǝɯdløʎǝǝ (ɐ nsǝɹ ʍɥøsǝ ǝɯɐᴉl ɥɐs ɔnɹɹǝnʇ sᴉʇǝ's døɯɐᴉn nɐɯǝ) ʍɥøsǝ ǝɯɐᴉl ǝxᴉsʇs ᴉn ʇɥᴉs ɯødǝl, ɔɐn bǝ ɐblǝ ʇø løƃᴉn ɟɹøɯ løƃᴉn sɔɹǝǝn ʇɥɹønƃɥ ǝɯɐᴉl ɐnd dɐssʍøɹd. Ⱥnd ᴉɟ ɐnʎ ǝɯdløʎǝǝ's ǝɯɐᴉl døǝsn'ʇ ǝxᴉsʇ ᴉn ʇɥᴉs ɯødǝl ʇɥǝn ʇɥɐʇ ǝɯdløʎǝǝ ɔɐn løƃᴉn ʌᴉɐ ʇɥᴉɹd dɐɹʇʎ ɐnʇɥǝnʇᴉɔɐʇᴉøn bɐɔʞǝnd ønlʎ.

source: It expect that the data will be provided in a csv file format with first row being the header and columns will be as follows: username, current_email, desired_email
rtl: هف ثطحثذف فاشف فاث يشفش صهمم زث حقخدهيثي هر ش ذسد بهمث بخقوشف صهفا بهقسف قخص زثهرل فاث اثشيثق شري ذخمعورس صهمم زث شس بخممخصس: عسثقرشوث, ذعققثرف_ثوشهم, يثسهقثي_ثوشهم

source: Add a reason
rtl: شيي ش قثشسخر

source: and
rtl: شري

source: Photos are mismatched
rtl: حاخفخس شقث وهسوشفذاثي

source: Name missing from ID photo
rtl: رشوث وهسسهرل بقخو هي حاخفخ

source: ID photo not provided
rtl: هي حاخفخ رخف حقخدهيثي

source: ID is invalid
rtl: هي هس هردشمهي

source: Learner photo is blurry
rtl: مثشقرثق حاخفخ هس زمعققغ

source: Name on ID does not match name on account
rtl: رشوث خر هي يخثس رخف وشفذا رشوث خر شذذخعرف

source: Learner photo not provided
rtl: مثشقرثق حاخفخ رخف حقخدهيثي

source: ID photo is blurry
rtl: هي حاخفخ هس زمعققغƗʇ ǝxdǝɔʇ ʇɥɐʇ ʇɥǝ dɐʇɐ ʍᴉll bǝ dɹøʌᴉdǝd ᴉn ɐ ɔsʌ ɟᴉlǝ ɟøɹɯɐʇ ʍᴉʇɥ ɟᴉɹsʇ ɹøʍ bǝᴉnƃ ʇɥǝ ɥǝɐdǝɹ ɐnd ɔølnɯns ʍᴉll bǝ ɐs ɟølløʍs: nsǝɹnɐɯǝ, ɔnɹɹǝnʇ_ǝɯɐᴉl, dǝsᴉɹǝd_ǝɯɐᴉl

source: Check your {email_start}{email}{email_end} inbox for an account activation link from {platform_name}. If you need help, contact {link_start}{platform_name} Support{link_end}.
rtl: ذاثذن غخعق {email_start}{email}{email_end} هرزخط بخق شر شذذخعرف شذفهدشفهخر مهرن بقخو {platform_name}. هب غخع رثثي اثمح, ذخرفشذف {link_start}{platform_name} سعححخقف{link_end}.Ȼɥǝɔʞ ʎønɹ {email_start}{email}{email_end} ᴉnbøx ɟøɹ ɐn ɐɔɔønnʇ ɐɔʇᴉʌɐʇᴉøn lᴉnʞ ɟɹøɯ {platform_name}. Ɨɟ ʎøn nǝǝd ɥǝld, ɔønʇɐɔʇ {link_start}{platform_name} Snddøɹʇ{link_end}.

source: Add a recovery email to retain access when single-sign on is not available. Go to {link_start}your Account Settings{link_end}.
rtl: شيي ش قثذخدثقغ ثوشهم فخ قثفشهر شذذثسس صاثر سهرلمث-سهلر خر هس رخف شدشهمشزمث. لخ فخ {link_start}غخعق شذذخعرف سثففهرلس{link_end}.Ⱥdd ɐ ɹǝɔøʌǝɹʎ ǝɯɐᴉl ʇø ɹǝʇɐᴉn ɐɔɔǝss ʍɥǝn sᴉnƃlǝ-sᴉƃn øn ᴉs nøʇ ɐʌɐᴉlɐblǝ. Ǥø ʇø {link_start}ʎønɹ Ⱥɔɔønnʇ Sǝʇʇᴉnƃs{link_end}.

source: Recovery email is not activated yet. Kindly visit your email and follow the instructions to activate it.
rtl: قثذخدثقغ ثوشهم هس رخف شذفهدشفثي غثف. نهريمغ دهسهف غخعق ثوشهم شري بخممخص فاث هرسفقعذفهخرس فخ شذفهدشفث هف.Ɍǝɔøʌǝɹʎ ǝɯɐᴉl ᴉs nøʇ ɐɔʇᴉʌɐʇǝd ʎǝʇ. Ꝁᴉndlʎ ʌᴉsᴉʇ ʎønɹ ǝɯɐᴉl ɐnd ɟølløʍ ʇɥǝ ᴉnsʇɹnɔʇᴉøns ʇø ɐɔʇᴉʌɐʇǝ ᴉʇ.

source: The course you are looking for does not start until {date}.
rtl: فاث ذخعقسث غخع شقث مخخنهرل بخق يخثس رخف سفشقف عرفهم {date}.

source: The course you are looking for is closed for enrollment as of {date}.
rtl: فاث ذخعقسث غخع شقث مخخنهرل بخق هس ذمخسثي بخق ثرقخمموثرف شس خب {date}.

source: Course id not specified
rtl: ذخعقسث هي رخف سحثذهبهثي

source: Invalid course id
rtl: هردشمهي ذخعقسث هي

source: Course id is invalid
rtl: ذخعقسث هي هس هردشمهي

source: Could not enroll
rtl: ذخعمي رخف ثرقخمم

source: You are not enrolled in this course
rtl: غخع شقث رخف ثرقخممثي هر فاهس ذخعقسث

source: Your certificate prevents you from unenrolling from this course
rtl: غخعق ذثقفهبهذشفث حقثدثرفس غخع بقخو عرثرقخممهرل بقخو فاهس ذخعقسث

source: Enrollment action is invalid
rtl: ثرقخمموثرف شذفهخر هس هردشمهي

source: Please enter a username
rtl: حمثشسث ثرفثق ش عسثقرشوث

source: Please choose an option
rtl: حمثشسث ذاخخسث شر خحفهخر

source: User with username {} does not exist
rtl: عسثق صهفا عسثقرشوث {} يخثس رخف ثطهسف

source: Successfully disabled {}'s account
rtl: سعذذثسسبعممغ يهسشزمثي {}'س شذذخعرف

source: Successfully reenabled {}'s account
rtl: سعذذثسسبعممغ قثثرشزمثي {}'س شذذخعرف

source: Unexpected account status
rtl: عرثطحثذفثي شذذخعرف سفشفعس

source: Unenrollment is currently disabled
rtl: Ʉnǝnɹøllɯǝnʇ ᴉs ɔnɹɹǝnʇlʎ dᴉsɐblǝd

source: {html_start}Your account could not be activated{html_end}Something went wrong, please <a href="{support_url}">contact support</a> to resolve this issue.
rtl: {html_start}غخعق شذذخعرف ذخعمي رخف زث شذفهدشفثي{html_end}سخوثفاهرل صثرف صقخرل, حمثشسث <a href="{support_url}">ذخرفشذف سعححخقف</a> فخ قثسخمدث فاهس هسسعث.

source: {html_start}This account has already been activated.{html_end}
rtl: {html_start}فاهس شذذخعرف اشس شمقثشيغ زثثر شذفهدشفثي.{html_end}

source: {html_start}Success{html_end} You have activated your account.
rtl: {html_start}سعذذثسس{html_end} غخع اشدث شذفهدشفثي غخعق شذذخعرف.{html_start}Your {account_or_email} could not be {activated_or_confirmed}{html_end}Something went wrong, please <a href="{support_url}">contact support</a> to resolve this issue.

source: {html_start}Success! You have activated your account.{html_end}You will now receive email updates and alerts from us related to the courses you are enrolled in. Sign In to continue.
rtl: {html_start}سعذذثسس! غخع اشدث شذفهدشفثي غخعق شذذخعرف.{html_end}غخع صهمم رخص قثذثهدث ثوشهم عحيشفثس شري شمثقفس بقخو عس قثمشفثي فخ فاث ذخعقسثس غخع شقث ثرقخممثي هر. سهلر هر فخ ذخرفهرعث.

source: Valid e-mail address required.
rtl: دشمهي ث-وشهم شييقثسس قثضعهقثي.

source: Old email is the same as the new email.
rtl: خمي ثوشهم هس فاث سشوث شس فاث رثص ثوشهم.

source: Cannot be same as your sign in email address.
rtl: ذشررخف زث سشوث شس غخعق سهلر هر ثوشهم شييقثسس.

source: Unable to send email activation link. Please try again later.
rtl: عرشزمث فخ سثري ثوشهم شذفهدشفهخر مهرن. حمثشسث فقغ شلشهر مشفثق.

source: Deleted the selected configuration(s).
rtl: يثمثفثي فاث سثمثذفثي ذخربهلعقشفهخر(س).

source: Delete the selected configuration
rtl: يثمثفث فاث سثمثذفثي ذخربهلعقشفهخر

source: Unable to connect with the external provider, please try again
rtl: عرشزمث فخ ذخررثذف صهفا فاث ثطفثقرشم حقخدهيثق, حمثشسث فقغ شلشهر

source: Authentication with {} is currently unavailable.
rtl: شعفاثرفهذشفهخر صهفا {} هس ذعققثرفمغ عرشدشهمشزمث.{html_start}This {account_or_email} has already been {activated_or_confirmed}.{html_end}

source: {html_start}Success{html_end} You have {activated_or_confirmed} your {account_or_email}.
rtl: {html_start}Snɔɔǝss{html_end} Ɏøn ɥɐʌǝ {activated_or_confirmed} ʎønɹ {account_or_email}.

source: {html_start}Success! You have {activated_or_confirmed} your {account_or_email}.{html_end}You will now receive email updates and alerts from us related to the courses you are enrolled in. Sign In to continue.
rtl: {html_start}Snɔɔǝss! Ɏøn ɥɐʌǝ {activated_or_confirmed} ʎønɹ {account_or_email}.{html_end}Ɏøn ʍᴉll nøʍ ɹǝɔǝᴉʌǝ ǝɯɐᴉl nddɐʇǝs ɐnd ɐlǝɹʇs ɟɹøɯ ns ɹǝlɐʇǝd ʇø ʇɥǝ ɔønɹsǝs ʎøn ɐɹǝ ǝnɹøllǝd ᴉn. Sᴉƃn Ɨn ʇø ɔønʇᴉnnǝ.

source: Secondary providers are displayed less prominently, in a separate list of "Institution" login providers.
rtl: سثذخريشقغ حقخدهيثقس شقث يهسحمشغثي مثسس حقخوهرثرفمغ, هر ش سثحشقشفث مهسف خب "هرسفهفعفهخر" مخلهر حقخدهيثقس.Sǝɔøndɐɹʎ dɹøʌᴉdǝɹs ɐɹǝ dᴉsdlɐʎǝd lǝss dɹøɯᴉnǝnʇlʎ, ᴉn ɐ sǝdɐɹɐʇǝ lᴉsʇ øɟ "Ɨnsʇᴉʇnʇᴉøn" løƃᴉn dɹøʌᴉdǝɹs.

source: optional. If this provider is an Organization, this attribute can be used reference users in that Organization
rtl: خحفهخرشم. هب فاهس حقخدهيثق هس شر خقلشرهظشفهخر, فاهس شففقهزعفث ذشر زث عسثي قثبثقثرذث عسثقس هر فاشف خقلشرهظشفهخر

source: The Site that this provider configuration belongs to.
rtl: فاث سهفث فاشف فاهس حقخدهيثق ذخربهلعقشفهخر زثمخرلس فخ.ødʇᴉønɐl. Ɨɟ ʇɥᴉs dɹøʌᴉdǝɹ ᴉs ɐn Øɹƃɐnᴉzɐʇᴉøn, ʇɥᴉs ɐʇʇɹᴉbnʇǝ ɔɐn bǝ nsǝd ɹǝɟǝɹǝnɔǝ nsǝɹs ᴉn ʇɥɐʇ Øɹƃɐnᴉzɐʇᴉøn

source: If this option is enabled, users that visit a "TPA hinted" URL for this provider (e.g. a URL ending with `?tpa_hint=[provider_name]`) will be forwarded directly to the login URL of the provider instead of being first prompted with a login dialog.
rtl: هب فاهس خحفهخر هس ثرشزمثي, عسثقس فاشف دهسهف ش "فحش اهرفثي" عقم بخق فاهس حقخدهيثق (ث.ل. ش عقم ثريهرل صهفا `?فحش_اهرف=[حقخدهيثق_رشوث]`) صهمم زث بخقصشقيثي يهقثذفمغ فخ فاث مخلهر عقم خب فاث حقخدهيثق هرسفثشي خب زثهرل بهقسف حقخوحفثي صهفا ش مخلهر يهشمخل.Ɨɟ ʇɥᴉs ødʇᴉøn ᴉs ǝnɐblǝd, nsǝɹs ʇɥɐʇ ʌᴉsᴉʇ ɐ "ŦⱣȺ ɥᴉnʇǝd" ɄɌŁ ɟøɹ ʇɥᴉs dɹøʌᴉdǝɹ (ǝ.ƃ. ɐ ɄɌŁ ǝndᴉnƃ ʍᴉʇɥ `?ʇdɐ_ɥᴉnʇ=[dɹøʌᴉdǝɹ_nɐɯǝ]`) ʍᴉll bǝ ɟøɹʍɐɹdǝd dᴉɹǝɔʇlʎ ʇø ʇɥǝ løƃᴉn ɄɌŁ øɟ ʇɥǝ dɹøʌᴉdǝɹ ᴉnsʇǝɐd øɟ bǝᴉnƃ ɟᴉɹsʇ dɹøɯdʇǝd ʍᴉʇɥ ɐ løƃᴉn dᴉɐløƃ.

source: If this option is enabled, users will not be asked to confirm their details (name, email, etc.) during the registration process. Only select this option for trusted providers that are known to provide accurate user information.
rtl: هب فاهس خحفهخر هس ثرشزمثي, عسثقس صهمم رخف زث شسنثي فخ ذخربهقو فاثهق يثفشهمس (رشوث, ثوشهم, ثفذ.) يعقهرل فاث قثلهسفقشفهخر حقخذثسس. خرمغ سثمثذف فاهس خحفهخر بخق فقعسفثي حقخدهيثقس فاشف شقث نرخصر فخ حقخدهيث شذذعقشفث عسثق هربخقوشفهخر.Ɨɟ ʇɥᴉs ødʇᴉøn ᴉs ǝnɐblǝd, nsǝɹs ʍᴉll nøʇ bǝ ɐsʞǝd ʇø ɔønɟᴉɹɯ ʇɥǝᴉɹ dǝʇɐᴉls (nɐɯǝ, ǝɯɐᴉl, ǝʇɔ.) dnɹᴉnƃ ʇɥǝ ɹǝƃᴉsʇɹɐʇᴉøn dɹøɔǝss. Ønlʎ sǝlǝɔʇ ʇɥᴉs ødʇᴉøn ɟøɹ ʇɹnsʇǝd dɹøʌᴉdǝɹs ʇɥɐʇ ɐɹǝ ʞnøʍn ʇø dɹøʌᴉdǝ ɐɔɔnɹɐʇǝ nsǝɹ ᴉnɟøɹɯɐʇᴉøn.

source: If this option is selected, users will not be required to confirm their email, and their account will be activated immediately upon registration.
rtl: هب فاهس خحفهخر هس سثمثذفثي, عسثقس صهمم رخف زث قثضعهقثي فخ ذخربهقو فاثهق ثوشهم, شري فاثهق شذذخعرف صهمم زث شذفهدشفثي هووثيهشفثمغ عحخر قثلهسفقشفهخر.Ɨɟ ʇɥᴉs ødʇᴉøn ᴉs sǝlǝɔʇǝd, nsǝɹs ʍᴉll nøʇ bǝ ɹǝbnᴉɹǝd ʇø ɔønɟᴉɹɯ ʇɥǝᴉɹ ǝɯɐᴉl, ɐnd ʇɥǝᴉɹ ɐɔɔønnʇ ʍᴉll bǝ ɐɔʇᴉʌɐʇǝd ᴉɯɯǝdᴉɐʇǝlʎ ndøn ɹǝƃᴉsʇɹɐʇᴉøn.

source: If this option is selected, users will be sent a welcome email upon registration.
rtl: هب فاهس خحفهخر هس سثمثذفثي, عسثقس صهمم زث سثرف ش صثمذخوث ثوشهم عحخر قثلهسفقشفهخر.Ɨɟ ʇɥᴉs ødʇᴉøn ᴉs sǝlǝɔʇǝd, nsǝɹs ʍᴉll bǝ sǝnʇ ɐ ʍǝlɔøɯǝ ǝɯɐᴉl ndøn ɹǝƃᴉsʇɹɐʇᴉøn.

source: If this option is not selected, users will not be presented with the provider as an option to authenticate with on the login screen, but manual authentication using the correct link is still possible.
rtl: هب فاهس خحفهخر هس رخف سثمثذفثي, عسثقس صهمم رخف زث حقثسثرفثي صهفا فاث حقخدهيثق شس شر خحفهخر فخ شعفاثرفهذشفث صهفا خر فاث مخلهر سذقثثر, زعف وشرعشم شعفاثرفهذشفهخر عسهرل فاث ذخققثذف مهرن هس سفهمم حخسسهزمث.Ɨɟ ʇɥᴉs ødʇᴉøn ᴉs nøʇ sǝlǝɔʇǝd, nsǝɹs ʍᴉll nøʇ bǝ dɹǝsǝnʇǝd ʍᴉʇɥ ʇɥǝ dɹøʌᴉdǝɹ ɐs ɐn ødʇᴉøn ʇø ɐnʇɥǝnʇᴉɔɐʇǝ ʍᴉʇɥ øn ʇɥǝ løƃᴉn sɔɹǝǝn, bnʇ ɯɐnnɐl ɐnʇɥǝnʇᴉɔɐʇᴉøn nsᴉnƃ ʇɥǝ ɔøɹɹǝɔʇ lᴉnʞ ᴉs sʇᴉll døssᴉblǝ.

source: If this option is set, then users logging in using this SSO provider will have their session length limited to no longer than this value. If set to 0 (zero), the session will expire upon the user closing their browser. If left blank, the Django platform session default length will be used.
rtl: هب فاهس خحفهخر هس سثف, فاثر عسثقس مخللهرل هر عسهرل فاهس سسخ حقخدهيثق صهمم اشدث فاثهق سثسسهخر مثرلفا مهوهفثي فخ رخ مخرلثق فاشر فاهس دشمعث. هب سثف فخ 0 (ظثقخ), فاث سثسسهخر صهمم ثطحهقث عحخر فاث عسثق ذمخسهرل فاثهق زقخصسثق. هب مثبف زمشرن, فاث يتشرلخ حمشفبخقو سثسسهخر يثبشعمف مثرلفا صهمم زث عسثي.Ɨɟ ʇɥᴉs ødʇᴉøn ᴉs sǝʇ, ʇɥǝn nsǝɹs løƃƃᴉnƃ ᴉn nsᴉnƃ ʇɥᴉs SSØ dɹøʌᴉdǝɹ ʍᴉll ɥɐʌǝ ʇɥǝᴉɹ sǝssᴉøn lǝnƃʇɥ lᴉɯᴉʇǝd ʇø nø lønƃǝɹ ʇɥɐn ʇɥᴉs ʌɐlnǝ. Ɨɟ sǝʇ ʇø 0 (zǝɹø), ʇɥǝ sǝssᴉøn ʍᴉll ǝxdᴉɹǝ ndøn ʇɥǝ nsǝɹ ɔløsᴉnƃ ʇɥǝᴉɹ bɹøʍsǝɹ. Ɨɟ lǝɟʇ blɐnʞ, ʇɥǝ Đɾɐnƃø dlɐʇɟøɹɯ sǝssᴉøn dǝɟɐnlʇ lǝnƃʇɥ ʍᴉll bǝ nsǝd.

source: If this option is selected, users will be directed to the registration page immediately after authenticating with the third party instead of the login page.
rtl: هب فاهس خحفهخر هس سثمثذفثي, عسثقس صهمم زث يهقثذفثي فخ فاث قثلهسفقشفهخر حشلث هووثيهشفثمغ شبفثق شعفاثرفهذشفهرل صهفا فاث فاهقي حشقفغ هرسفثشي خب فاث مخلهر حشلث.Ɨɟ ʇɥᴉs ødʇᴉøn ᴉs sǝlǝɔʇǝd, nsǝɹs ʍᴉll bǝ dᴉɹǝɔʇǝd ʇø ʇɥǝ ɹǝƃᴉsʇɹɐʇᴉøn dɐƃǝ ᴉɯɯǝdᴉɐʇǝlʎ ɐɟʇǝɹ ɐnʇɥǝnʇᴉɔɐʇᴉnƃ ʍᴉʇɥ ʇɥǝ ʇɥᴉɹd dɐɹʇʎ ᴉnsʇǝɐd øɟ ʇɥǝ løƃᴉn dɐƃǝ.

source: Synchronize user profile data received from the identity provider with the edX user account on each SSO login. The user will be notified if the email address associated with their account is changed as a part of this synchronization.
rtl: سغرذاقخرهظث عسثق حقخبهمث يشفش قثذثهدثي بقخو فاث هيثرفهفغ حقخدهيثق صهفا فاث ثيط عسثق شذذخعرف خر ثشذا سسخ مخلهر. فاث عسثق صهمم زث رخفهبهثي هب فاث ثوشهم شييقثسس شسسخذهشفثي صهفا فاثهق شذذخعرف هس ذاشرلثي شس ش حشقف خب فاهس سغرذاقخرهظشفهخر.Sʎnɔɥɹønᴉzǝ nsǝɹ dɹøɟᴉlǝ dɐʇɐ ɹǝɔǝᴉʌǝd ɟɹøɯ ʇɥǝ ᴉdǝnʇᴉʇʎ dɹøʌᴉdǝɹ ʍᴉʇɥ ʇɥǝ ǝdX nsǝɹ ɐɔɔønnʇ øn ǝɐɔɥ SSØ løƃᴉn. Ŧɥǝ nsǝɹ ʍᴉll bǝ nøʇᴉɟᴉǝd ᴉɟ ʇɥǝ ǝɯɐᴉl ɐddɹǝss ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʇɥǝᴉɹ ɐɔɔønnʇ ᴉs ɔɥɐnƃǝd ɐs ɐ dɐɹʇ øɟ ʇɥᴉs sʎnɔɥɹønᴉzɐʇᴉøn.
