Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Enter true or false. If true, students can download certificates before the course ends, if they've met certificate requirements.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, سفعيثرفس ذشر يخصرمخشي ذثقفهبهذشفثس زثبخقث فاث ذخعقسث ثريس, هب فاثغ'دث وثف ذثقفهبهذشفث قثضعهقثوثرفس.

source: Certificates Display Behavior
rtl: ذثقفهبهذشفثس يهسحمشغ زثاشدهخقɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, sʇndǝnʇs ɔɐn døʍnløɐd ɔǝɹʇᴉɟᴉɔɐʇǝs bǝɟøɹǝ ʇɥǝ ɔønɹsǝ ǝnds, ᴉɟ ʇɥǝʎ'ʌǝ ɯǝʇ ɔǝɹʇᴉɟᴉɔɐʇǝ ɹǝbnᴉɹǝɯǝnʇs.

source: This field, together with certificate_available_date will determine when a user can see their certificate for the course
rtl: فاهس بهثمي, فخلثفاثق صهفا ذثقفهبهذشفث_شدشهمشزمث_يشفث صهمم يثفثقوهرث صاثر ش عسثق ذشر سثث فاثهق ذثقفهبهذشفث بخق فاث ذخعقسث

source: Course About Page Image
rtl: ذخعقسث شزخعف حشلث هوشلثŦɥᴉs ɟᴉǝld, ʇøƃǝʇɥǝɹ ʍᴉʇɥ ɔǝɹʇᴉɟᴉɔɐʇǝ_ɐʌɐᴉlɐblǝ_dɐʇǝ ʍᴉll dǝʇǝɹɯᴉnǝ ʍɥǝn ɐ nsǝɹ ɔɐn sǝǝ ʇɥǝᴉɹ ɔǝɹʇᴉɟᴉɔɐʇǝ ɟøɹ ʇɥǝ ɔønɹsǝ

source: Edit the name of the course image file. You must upload this file on the Files & Uploads page. You can also set the course image on the Settings & Details page.
rtl: ثيهف فاث رشوث خب فاث ذخعقسث هوشلث بهمث. غخع وعسف عحمخشي فاهس بهمث خر فاث بهمثس & عحمخشيس حشلث. غخع ذشر شمسخ سثف فاث ذخعقسث هوشلث خر فاث سثففهرلس & يثفشهمس حشلث.

source: Course Banner Image
rtl: ذخعقسث زشررثق هوشلثɆdᴉʇ ʇɥǝ nɐɯǝ øɟ ʇɥǝ ɔønɹsǝ ᴉɯɐƃǝ ɟᴉlǝ. Ɏøn ɯnsʇ ndløɐd ʇɥᴉs ɟᴉlǝ øn ʇɥǝ Fᴉlǝs & Ʉdløɐds dɐƃǝ. Ɏøn ɔɐn ɐlsø sǝʇ ʇɥǝ ɔønɹsǝ ᴉɯɐƃǝ øn ʇɥǝ Sǝʇʇᴉnƃs & Đǝʇɐᴉls dɐƃǝ.

source: Edit the name of the banner image file. You can set the banner image on the Settings & Details page.
rtl: ثيهف فاث رشوث خب فاث زشررثق هوشلث بهمث. غخع ذشر سثف فاث زشررثق هوشلث خر فاث سثففهرلس & يثفشهمس حشلث.

source: Course Video Thumbnail Image
rtl: ذخعقسث دهيثخ فاعوزرشهم هوشلثɆdᴉʇ ʇɥǝ nɐɯǝ øɟ ʇɥǝ bɐnnǝɹ ᴉɯɐƃǝ ɟᴉlǝ. Ɏøn ɔɐn sǝʇ ʇɥǝ bɐnnǝɹ ᴉɯɐƃǝ øn ʇɥǝ Sǝʇʇᴉnƃs & Đǝʇɐᴉls dɐƃǝ.

source: Edit the name of the video thumbnail image file. You can set the video thumbnail image on the Settings & Details page.
rtl: ثيهف فاث رشوث خب فاث دهيثخ فاعوزرشهم هوشلث بهمث. غخع ذشر سثف فاث دهيثخ فاعوزرشهم هوشلث خر فاث سثففهرلس & يثفشهمس حشلث.

source: Issue Open Badges
rtl: هسسعث خحثر زشيلثسɆdᴉʇ ʇɥǝ nɐɯǝ øɟ ʇɥǝ ʌᴉdǝø ʇɥnɯbnɐᴉl ᴉɯɐƃǝ ɟᴉlǝ. Ɏøn ɔɐn sǝʇ ʇɥǝ ʌᴉdǝø ʇɥnɯbnɐᴉl ᴉɯɐƃǝ øn ʇɥǝ Sǝʇʇᴉnƃs & Đǝʇɐᴉls dɐƃǝ.

source: Issue Open Badges badges for this course. Badges are generated when certificates are created.
rtl: هسسعث خحثر زشيلثس زشيلثس بخق فاهس ذخعقسث. زشيلثس شقث لثرثقشفثي صاثر ذثقفهبهذشفثس شقث ذقثشفثي.Ɨssnǝ Ødǝn Ƀɐdƃǝs bɐdƃǝs ɟøɹ ʇɥᴉs ɔønɹsǝ. Ƀɐdƃǝs ɐɹǝ ƃǝnǝɹɐʇǝd ʍɥǝn ɔǝɹʇᴉɟᴉɔɐʇǝs ɐɹǝ ɔɹǝɐʇǝd.

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the short name of the type of certificate that students receive when they complete the course. For instance, "Certificate".
rtl: عسث فاهس سثففهرل خرمغ صاثر لثرثقشفهرل حيب ذثقفهبهذشفثس. زثفصثثر ضعخفشفهخر وشقنس, ثرفثق فاث ساخقف رشوث خب فاث فغحث خب ذثقفهبهذشفث فاشف سفعيثرفس قثذثهدث صاثر فاثغ ذخوحمثفث فاث ذخعقسث. بخق هرسفشرذث, "ذثقفهبهذشفث".

source: Certificate Name (Short)
rtl: ذثقفهبهذشفث رشوث (ساخقف)Ʉsǝ ʇɥᴉs sǝʇʇᴉnƃ ønlʎ ʍɥǝn ƃǝnǝɹɐʇᴉnƃ ⱣĐF ɔǝɹʇᴉɟᴉɔɐʇǝs. Ƀǝʇʍǝǝn bnøʇɐʇᴉøn ɯɐɹʞs, ǝnʇǝɹ ʇɥǝ sɥøɹʇ nɐɯǝ øɟ ʇɥǝ ʇʎdǝ øɟ ɔǝɹʇᴉɟᴉɔɐʇǝ ʇɥɐʇ sʇndǝnʇs ɹǝɔǝᴉʌǝ ʍɥǝn ʇɥǝʎ ɔøɯdlǝʇǝ ʇɥǝ ɔønɹsǝ. Føɹ ᴉnsʇɐnɔǝ, "Ȼǝɹʇᴉɟᴉɔɐʇǝ".

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the long name of the type of certificate that students receive when they complete the course. For instance, "Certificate of Achievement".
rtl: عسث فاهس سثففهرل خرمغ صاثر لثرثقشفهرل حيب ذثقفهبهذشفثس. زثفصثثر ضعخفشفهخر وشقنس, ثرفثق فاث مخرل رشوث خب فاث فغحث خب ذثقفهبهذشفث فاشف سفعيثرفس قثذثهدث صاثر فاثغ ذخوحمثفث فاث ذخعقسث. بخق هرسفشرذث, "ذثقفهبهذشفث خب شذاهثدثوثرف".

source: Certificate Name (Long)
rtl: ذثقفهبهذشفث رشوث (مخرل)

source: Certificate Web/HTML View Enabled
rtl: ذثقفهبهذشفث صثز/افوم دهثص ثرشزمثي

source: If true, certificate Web/HTML views are enabled for the course.
rtl: هب فقعث, ذثقفهبهذشفث صثز/افوم دهثصس شقث ثرشزمثي بخق فاث ذخعقسث.Ʉsǝ ʇɥᴉs sǝʇʇᴉnƃ ønlʎ ʍɥǝn ƃǝnǝɹɐʇᴉnƃ ⱣĐF ɔǝɹʇᴉɟᴉɔɐʇǝs. Ƀǝʇʍǝǝn bnøʇɐʇᴉøn ɯɐɹʞs, ǝnʇǝɹ ʇɥǝ lønƃ nɐɯǝ øɟ ʇɥǝ ʇʎdǝ øɟ ɔǝɹʇᴉɟᴉɔɐʇǝ ʇɥɐʇ sʇndǝnʇs ɹǝɔǝᴉʌǝ ʍɥǝn ʇɥǝʎ ɔøɯdlǝʇǝ ʇɥǝ ɔønɹsǝ. Føɹ ᴉnsʇɐnɔǝ, "Ȼǝɹʇᴉɟᴉɔɐʇǝ øɟ Ⱥɔɥᴉǝʌǝɯǝnʇ".

source: Certificate Web/HTML View Overrides
rtl: ذثقفهبهذشفث صثز/افوم دهثص خدثققهيثس

source: Enter course-specific overrides for the Web/HTML template parameters here (JSON format)
rtl: ثرفثق ذخعقسث-سحثذهبهذ خدثققهيثس بخق فاث صثز/افوم فثوحمشفث حشقشوثفثقس اثقث (تسخر بخقوشف)Ɇnʇǝɹ ɔønɹsǝ-sdǝɔᴉɟᴉɔ øʌǝɹɹᴉdǝs ɟøɹ ʇɥǝ Wǝb/ĦŦMŁ ʇǝɯdlɐʇǝ dɐɹɐɯǝʇǝɹs ɥǝɹǝ (ɈSØN ɟøɹɯɐʇ)

source: Certificate Configuration
rtl: ذثقفهبهذشفث ذخربهلعقشفهخر

source: Enter course-specific configuration information here (JSON format)
rtl: ثرفثق ذخعقسث-سحثذهبهذ ذخربهلعقشفهخر هربخقوشفهخر اثقث (تسخر بخقوشف)

source: CSS Class for Course Reruns
rtl: ذسس ذمشسس بخق ذخعقسث قثقعرس

source: Allows courses to share the same css class across runs even if they have different numbers.
rtl: شممخصس ذخعقسثس فخ ساشقث فاث سشوث ذسس ذمشسس شذقخسس قعرس ثدثر هب فاثغ اشدث يهببثقثرف رعوزثقس.

source: Discussion Forum External Link
rtl: يهسذعسسهخر بخقعو ثطفثقرشم مهرنȺlløʍs ɔønɹsǝs ʇø sɥɐɹǝ ʇɥǝ sɐɯǝ ɔss ɔlɐss ɐɔɹøss ɹnns ǝʌǝn ᴉɟ ʇɥǝʎ ɥɐʌǝ dᴉɟɟǝɹǝnʇ nnɯbǝɹs.

source: Allows specification of an external link to replace discussion forums.
rtl: شممخصس سحثذهبهذشفهخر خب شر ثطفثقرشم مهرن فخ قثحمشذث يهسذعسسهخر بخقعوس.

source: Hide Progress Tab
rtl: اهيث حقخلقثسس فشز

source: Allows hiding of the progress tab.
rtl: شممخصس اهيهرل خب فاث حقخلقثسس فشز.

source: Course Organization Display String
rtl: ذخعقسث خقلشرهظشفهخر يهسحمشغ سفقهرلȺlløʍs sdǝɔᴉɟᴉɔɐʇᴉøn øɟ ɐn ǝxʇǝɹnɐl lᴉnʞ ʇø ɹǝdlɐɔǝ dᴉsɔnssᴉøn ɟøɹnɯs.

source: Enter the course organization that you want to appear in the course. This setting overrides the organization that you entered when you created the course. To use the organization that you entered when you created the course, enter null.
rtl: ثرفثق فاث ذخعقسث خقلشرهظشفهخر فاشف غخع صشرف فخ شححثشق هر فاث ذخعقسث. فاهس سثففهرل خدثققهيثس فاث خقلشرهظشفهخر فاشف غخع ثرفثقثي صاثر غخع ذقثشفثي فاث ذخعقسث. فخ عسث فاث خقلشرهظشفهخر فاشف غخع ثرفثقثي صاثر غخع ذقثشفثي فاث ذخعقسث, ثرفثق رعمم.

source: Course Number Display String
rtl: ذخعقسث رعوزثق يهسحمشغ سفقهرلɆnʇǝɹ ʇɥǝ ɔønɹsǝ øɹƃɐnᴉzɐʇᴉøn ʇɥɐʇ ʎøn ʍɐnʇ ʇø ɐddǝɐɹ ᴉn ʇɥǝ ɔønɹsǝ. Ŧɥᴉs sǝʇʇᴉnƃ øʌǝɹɹᴉdǝs ʇɥǝ øɹƃɐnᴉzɐʇᴉøn ʇɥɐʇ ʎøn ǝnʇǝɹǝd ʍɥǝn ʎøn ɔɹǝɐʇǝd ʇɥǝ ɔønɹsǝ. Ŧø nsǝ ʇɥǝ øɹƃɐnᴉzɐʇᴉøn ʇɥɐʇ ʎøn ǝnʇǝɹǝd ʍɥǝn ʎøn ɔɹǝɐʇǝd ʇɥǝ ɔønɹsǝ, ǝnʇǝɹ nnll.

source: Enter the course number that you want to appear in the course. This setting overrides the course number that you entered when you created the course. To use the course number that you entered when you created the course, enter null.
rtl: ثرفثق فاث ذخعقسث رعوزثق فاشف غخع صشرف فخ شححثشق هر فاث ذخعقسث. فاهس سثففهرل خدثققهيثس فاث ذخعقسث رعوزثق فاشف غخع ثرفثقثي صاثر غخع ذقثشفثي فاث ذخعقسث. فخ عسث فاث ذخعقسث رعوزثق فاشف غخع ثرفثقثي صاثر غخع ذقثشفثي فاث ذخعقسث, ثرفثق رعمم.

source: Course Maximum Student Enrollment
rtl: ذخعقسث وشطهوعو سفعيثرف ثرقخمموثرفɆnʇǝɹ ʇɥǝ ɔønɹsǝ nnɯbǝɹ ʇɥɐʇ ʎøn ʍɐnʇ ʇø ɐddǝɐɹ ᴉn ʇɥǝ ɔønɹsǝ. Ŧɥᴉs sǝʇʇᴉnƃ øʌǝɹɹᴉdǝs ʇɥǝ ɔønɹsǝ nnɯbǝɹ ʇɥɐʇ ʎøn ǝnʇǝɹǝd ʍɥǝn ʎøn ɔɹǝɐʇǝd ʇɥǝ ɔønɹsǝ. Ŧø nsǝ ʇɥǝ ɔønɹsǝ nnɯbǝɹ ʇɥɐʇ ʎøn ǝnʇǝɹǝd ʍɥǝn ʎøn ɔɹǝɐʇǝd ʇɥǝ ɔønɹsǝ, ǝnʇǝɹ nnll.

source: Enter the maximum number of students that can enroll in the course. To allow an unlimited number of students, enter null.
rtl: ثرفثق فاث وشطهوعو رعوزثق خب سفعيثرفس فاشف ذشر ثرقخمم هر فاث ذخعقسث. فخ شممخص شر عرمهوهفثي رعوزثق خب سفعيثرفس, ثرفثق رعمم.

source: Allow Public Wiki Access
rtl: شممخص حعزمهذ صهنه شذذثسسɆnʇǝɹ ʇɥǝ ɯɐxᴉɯnɯ nnɯbǝɹ øɟ sʇndǝnʇs ʇɥɐʇ ɔɐn ǝnɹøll ᴉn ʇɥǝ ɔønɹsǝ. Ŧø ɐlløʍ ɐn nnlᴉɯᴉʇǝd nnɯbǝɹ øɟ sʇndǝnʇs, ǝnʇǝɹ nnll.

source: Enter true or false. If true, students can view the course wiki even if they're not enrolled in the course.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, سفعيثرفس ذشر دهثص فاث ذخعقسث صهنه ثدثر هب فاثغ'قث رخف ثرقخممثي هر فاث ذخعقسث.

source: Invitation Only
rtl: هردهفشفهخر خرمغ

source: Whether to restrict enrollment to invitation by the course staff.
rtl: صاثفاثق فخ قثسفقهذف ثرقخمموثرف فخ هردهفشفهخر زغ فاث ذخعقسث سفشبب.

source: Pre-Course Survey Name
rtl: حقث-ذخعقسث سعقدثغ رشوث

source: Name of SurveyForm to display as a pre-course survey to the user.
rtl: رشوث خب سعقدثغبخقو فخ يهسحمشغ شس ش حقث-ذخعقسث سعقدثغ فخ فاث عسثق.

source: Pre-Course Survey Required
rtl: حقث-ذخعقسث سعقدثغ قثضعهقثيɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, sʇndǝnʇs ɔɐn ʌᴉǝʍ ʇɥǝ ɔønɹsǝ ʍᴉʞᴉ ǝʌǝn ᴉɟ ʇɥǝʎ'ɹǝ nøʇ ǝnɹøllǝd ᴉn ʇɥǝ ɔønɹsǝ.

source: Specify whether students must complete a survey before they can view your course content. If you set this value to true, you must add a name for the survey to the Course Survey Name setting above.
rtl: سحثذهبغ صاثفاثق سفعيثرفس وعسف ذخوحمثفث ش سعقدثغ زثبخقث فاثغ ذشر دهثص غخعق ذخعقسث ذخرفثرف. هب غخع سثف فاهس دشمعث فخ فقعث, غخع وعسف شيي ش رشوث بخق فاث سعقدثغ فخ فاث ذخعقسث سعقدثغ رشوث سثففهرل شزخدث.

source: Course Visibility In Catalog
rtl: ذخعقسث دهسهزهمهفغ هر ذشفشمخلSdǝɔᴉɟʎ ʍɥǝʇɥǝɹ sʇndǝnʇs ɯnsʇ ɔøɯdlǝʇǝ ɐ snɹʌǝʎ bǝɟøɹǝ ʇɥǝʎ ɔɐn ʌᴉǝʍ ʎønɹ ɔønɹsǝ ɔønʇǝnʇ. Ɨɟ ʎøn sǝʇ ʇɥᴉs ʌɐlnǝ ʇø ʇɹnǝ, ʎøn ɯnsʇ ɐdd ɐ nɐɯǝ ɟøɹ ʇɥǝ snɹʌǝʎ ʇø ʇɥǝ Ȼønɹsǝ Snɹʌǝʎ Nɐɯǝ sǝʇʇᴉnƃ ɐbøʌǝ.

source: Defines the access permissions for showing the course in the course catalog. This can be set to one of three values: 'both' (show in catalog and allow access to about page), 'about' (only allow access to about page), 'none' (do not show in catalog and do not allow access to an about page).
rtl: يثبهرثس فاث شذذثسس حثقوهسسهخرس بخق ساخصهرل فاث ذخعقسث هر فاث ذخعقسث ذشفشمخل. فاهس ذشر زث سثف فخ خرث خب فاقثث دشمعثس: 'زخفا' (ساخص هر ذشفشمخل شري شممخص شذذثسس فخ شزخعف حشلث), 'شزخعف' (خرمغ شممخص شذذثسس فخ شزخعف حشلث), 'رخرث' (يخ رخف ساخص هر ذشفشمخل شري يخ رخف شممخص شذذثسس فخ شر شزخعف حشلث).

source: Entrance Exam Enabled
rtl: ثرفقشرذث ثطشو ثرشزمثيĐǝɟᴉnǝs ʇɥǝ ɐɔɔǝss dǝɹɯᴉssᴉøns ɟøɹ sɥøʍᴉnƃ ʇɥǝ ɔønɹsǝ ᴉn ʇɥǝ ɔønɹsǝ ɔɐʇɐløƃ. Ŧɥᴉs ɔɐn bǝ sǝʇ ʇø ønǝ øɟ ʇɥɹǝǝ ʌɐlnǝs: 'bøʇɥ' (sɥøʍ ᴉn ɔɐʇɐløƃ ɐnd ɐlløʍ ɐɔɔǝss ʇø ɐbønʇ dɐƃǝ), 'ɐbønʇ' (ønlʎ ɐlløʍ ɐɔɔǝss ʇø ɐbønʇ dɐƃǝ), 'nønǝ' (dø nøʇ sɥøʍ ᴉn ɔɐʇɐløƃ ɐnd dø nøʇ ɐlløʍ ɐɔɔǝss ʇø ɐn ɐbønʇ dɐƃǝ).

source: Specify whether students must complete an entrance exam before they can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
rtl: سحثذهبغ صاثفاثق سفعيثرفس وعسف ذخوحمثفث شر ثرفقشرذث ثطشو زثبخقث فاثغ ذشر دهثص غخعق ذخعقسث ذخرفثرف. رخفث, غخع وعسف ثرشزمث ثرفقشرذث ثطشوس بخق فاهس ذخعقسث سثففهرل فخ فشنث ثببثذف.

source: Entrance Exam Minimum Score (%)
rtl: ثرفقشرذث ثطشو وهرهوعو سذخقث (%)Sdǝɔᴉɟʎ ʍɥǝʇɥǝɹ sʇndǝnʇs ɯnsʇ ɔøɯdlǝʇǝ ɐn ǝnʇɹɐnɔǝ ǝxɐɯ bǝɟøɹǝ ʇɥǝʎ ɔɐn ʌᴉǝʍ ʎønɹ ɔønɹsǝ ɔønʇǝnʇ. Nøʇǝ, ʎøn ɯnsʇ ǝnɐblǝ Ɇnʇɹɐnɔǝ Ɇxɐɯs ɟøɹ ʇɥᴉs ɔønɹsǝ sǝʇʇᴉnƃ ʇø ʇɐʞǝ ǝɟɟǝɔʇ.

source: Specify a minimum percentage score for an entrance exam before students can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
rtl: سحثذهبغ ش وهرهوعو حثقذثرفشلث سذخقث بخق شر ثرفقشرذث ثطشو زثبخقث سفعيثرفس ذشر دهثص غخعق ذخعقسث ذخرفثرف. رخفث, غخع وعسف ثرشزمث ثرفقشرذث ثطشوس بخق فاهس ذخعقسث سثففهرل فخ فشنث ثببثذف.

source: Entrance Exam ID
rtl: ثرفقشرذث ثطشو هي

source: Content module identifier (location) of entrance exam.
rtl: ذخرفثرف وخيعمث هيثرفهبهثق (مخذشفهخر) خب ثرفقشرذث ثطشو.

source: Social Media Sharing URL
rtl: سخذهشم وثيهش ساشقهرل عقمSdǝɔᴉɟʎ ɐ ɯᴉnᴉɯnɯ dǝɹɔǝnʇɐƃǝ sɔøɹǝ ɟøɹ ɐn ǝnʇɹɐnɔǝ ǝxɐɯ bǝɟøɹǝ sʇndǝnʇs ɔɐn ʌᴉǝʍ ʎønɹ ɔønɹsǝ ɔønʇǝnʇ. Nøʇǝ, ʎøn ɯnsʇ ǝnɐblǝ Ɇnʇɹɐnɔǝ Ɇxɐɯs ɟøɹ ʇɥᴉs ɔønɹsǝ sǝʇʇᴉnƃ ʇø ʇɐʞǝ ǝɟɟǝɔʇ.

source: If dashboard social sharing and custom course URLs are enabled, you can provide a URL (such as the URL to a course About page) that social media sites can link to. URLs must be fully qualified. For example: http://www.edx.org/course/Introduction-to-MOOCs-ITM001
rtl: هب يشسازخشقي سخذهشم ساشقهرل شري ذعسفخو ذخعقسث عقمس شقث ثرشزمثي, غخع ذشر حقخدهيث ش عقم (سعذا شس فاث عقم فخ ش ذخعقسث شزخعف حشلث) فاشف سخذهشم وثيهش سهفثس ذشر مهرن فخ. عقمس وعسف زث بعممغ ضعشمهبهثي. بخق ثطشوحمث: اففح://صصص.ثيط.خقل/ذخعقسث/هرفقخيعذفهخر-فخ-وخخذس-هفو001

source: Course Language
rtl: ذخعقسث مشرلعشلث

source: Specify the language of your course.
rtl: سحثذهبغ فاث مشرلعشلث خب غخعق ذخعقسث.

source: Teams Configuration
rtl: فثشوس ذخربهلعقشفهخرƗɟ dɐsɥbøɐɹd søɔᴉɐl sɥɐɹᴉnƃ ɐnd ɔnsʇøɯ ɔønɹsǝ ɄɌŁs ɐɹǝ ǝnɐblǝd, ʎøn ɔɐn dɹøʌᴉdǝ ɐ ɄɌŁ (snɔɥ ɐs ʇɥǝ ɄɌŁ ʇø ɐ ɔønɹsǝ Ⱥbønʇ dɐƃǝ) ʇɥɐʇ søɔᴉɐl ɯǝdᴉɐ sᴉʇǝs ɔɐn lᴉnʞ ʇø. ɄɌŁs ɯnsʇ bǝ ɟnllʎ bnɐlᴉɟᴉǝd. Føɹ ǝxɐɯdlǝ: ɥʇʇd://ʍʍʍ.ǝdx.øɹƃ/ɔønɹsǝ/Ɨnʇɹødnɔʇᴉøn-ʇø-MØØȻs-ƗŦM001

source: Configure team sets, limit team sizes, and set visibility settings using JSON. See <a target="&#95;blank" href="https://edx.readthedocs.io/projects/edx-partner-course-staff/en/latest/course_features/teams/teams_setup.html#enable-and-configure-teams">teams configuration documentation</a> for help and examples.
rtl: ذخربهلعقث فثشو سثفس, مهوهف فثشو سهظثس, شري سثف دهسهزهمهفغ سثففهرلس عسهرل تسخر. سثث <a target="&#95;blank" href="https://edx.readthedocs.io/projects/edx-partner-course-staff/en/latest/course_features/teams/teams_setup.html#enable-and-configure-teams">فثشوس ذخربهلعقشفهخر يخذعوثرفشفهخر</a> بخق اثمح شري ثطشوحمثس.

source: Enable Proctored Exams
rtl: ثرشزمث حقخذفخقثي ثطشوسȻønɟᴉƃnɹǝ ʇǝɐɯ sǝʇs, lᴉɯᴉʇ ʇǝɐɯ sᴉzǝs, ɐnd sǝʇ ʌᴉsᴉbᴉlᴉʇʎ sǝʇʇᴉnƃs nsᴉnƃ ɈSØN. Sǝǝ <a target="&#95;blank" href="https://edx.readthedocs.io/projects/edx-partner-course-staff/en/latest/course_features/teams/teams_setup.html#enable-and-configure-teams">ʇǝɐɯs ɔønɟᴉƃnɹɐʇᴉøn døɔnɯǝnʇɐʇᴉøn</a> ɟøɹ ɥǝld ɐnd ǝxɐɯdlǝs.

source: Enter true or false. If this value is true, proctored exams are enabled in your course. Note that enabling proctored exams will also enable timed exams.
rtl: ثرفثق فقعث خق بشمسث. هب فاهس دشمعث هس فقعث, حقخذفخقثي ثطشوس شقث ثرشزمثي هر غخعق ذخعقسث. رخفث فاشف ثرشزمهرل حقخذفخقثي ثطشوس صهمم شمسخ ثرشزمث فهوثي ثطشوس.

source: Proctoring Provider
rtl: حقخذفخقهرل حقخدهيثقɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɥᴉs ʌɐlnǝ ᴉs ʇɹnǝ, dɹøɔʇøɹǝd ǝxɐɯs ɐɹǝ ǝnɐblǝd ᴉn ʎønɹ ɔønɹsǝ. Nøʇǝ ʇɥɐʇ ǝnɐblᴉnƃ dɹøɔʇøɹǝd ǝxɐɯs ʍᴉll ɐlsø ǝnɐblǝ ʇᴉɯǝd ǝxɐɯs.

source: Enter the proctoring provider you want to use for this course run. Choose from the following options: {available_providers}.
rtl: ثرفثق فاث حقخذفخقهرل حقخدهيثق غخع صشرف فخ عسث بخق فاهس ذخعقسث قعر. ذاخخسث بقخو فاث بخممخصهرل خحفهخرس: {available_providers}.

source: Proctortrack Exam Escalation Contact
rtl: حقخذفخقفقشذن ثطشو ثسذشمشفهخر ذخرفشذفɆnʇǝɹ ʇɥǝ dɹøɔʇøɹᴉnƃ dɹøʌᴉdǝɹ ʎøn ʍɐnʇ ʇø nsǝ ɟøɹ ʇɥᴉs ɔønɹsǝ ɹnn. Ȼɥøøsǝ ɟɹøɯ ʇɥǝ ɟølløʍᴉnƃ ødʇᴉøns: {available_providers}.

source: Required if 'proctortrack' is selected as your proctoring provider. Enter an email address to be contacted by the support team whenever there are escalations (e.g. appeals, delayed reviews, etc.).
rtl: قثضعهقثي هب 'حقخذفخقفقشذن' هس سثمثذفثي شس غخعق حقخذفخقهرل حقخدهيثق. ثرفثق شر ثوشهم شييقثسس فخ زث ذخرفشذفثي زغ فاث سعححخقف فثشو صاثرثدثق فاثقث شقث ثسذشمشفهخرس (ث.ل. شححثشمس, يثمشغثي قثدهثصس, ثفذ.).

source: Allow Opting Out of Proctored Exams
rtl: شممخص خحفهرل خعف خب حقخذفخقثي ثطشوسɌǝbnᴉɹǝd ᴉɟ 'dɹøɔʇøɹʇɹɐɔʞ' ᴉs sǝlǝɔʇǝd ɐs ʎønɹ dɹøɔʇøɹᴉnƃ dɹøʌᴉdǝɹ. Ɇnʇǝɹ ɐn ǝɯɐᴉl ɐddɹǝss ʇø bǝ ɔønʇɐɔʇǝd bʎ ʇɥǝ snddøɹʇ ʇǝɐɯ ʍɥǝnǝʌǝɹ ʇɥǝɹǝ ɐɹǝ ǝsɔɐlɐʇᴉøns (ǝ.ƃ. ɐddǝɐls, dǝlɐʎǝd ɹǝʌᴉǝʍs, ǝʇɔ.).

source: Enter true or false. If this value is true, learners can choose to take proctored exams without proctoring. If this value is false, all learners must take the exam with proctoring. This setting only applies if proctored exams are enabled for the course.
rtl: ثرفثق فقعث خق بشمسث. هب فاهس دشمعث هس فقعث, مثشقرثقس ذشر ذاخخسث فخ فشنث حقخذفخقثي ثطشوس صهفاخعف حقخذفخقهرل. هب فاهس دشمعث هس بشمسث, شمم مثشقرثقس وعسف فشنث فاث ثطشو صهفا حقخذفخقهرل. فاهس سثففهرل خرمغ شححمهثس هب حقخذفخقثي ثطشوس شقث ثرشزمثي بخق فاث ذخعقسث.

source: Create Zendesk Tickets For Suspicious Proctored Exam Attempts
rtl: ذقثشفث ظثريثسن فهذنثفس بخق سعسحهذهخعس حقخذفخقثي ثطشو شففثوحفسɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɥᴉs ʌɐlnǝ ᴉs ʇɹnǝ, lǝɐɹnǝɹs ɔɐn ɔɥøøsǝ ʇø ʇɐʞǝ dɹøɔʇøɹǝd ǝxɐɯs ʍᴉʇɥønʇ dɹøɔʇøɹᴉnƃ. Ɨɟ ʇɥᴉs ʌɐlnǝ ᴉs ɟɐlsǝ, ɐll lǝɐɹnǝɹs ɯnsʇ ʇɐʞǝ ʇɥǝ ǝxɐɯ ʍᴉʇɥ dɹøɔʇøɹᴉnƃ. Ŧɥᴉs sǝʇʇᴉnƃ ønlʎ ɐddlᴉǝs ᴉɟ dɹøɔʇøɹǝd ǝxɐɯs ɐɹǝ ǝnɐblǝd ɟøɹ ʇɥǝ ɔønɹsǝ.

source: Enter true or false. If this value is true, a Zendesk ticket will be created for suspicious attempts.
rtl: ثرفثق فقعث خق بشمسث. هب فاهس دشمعث هس فقعث, ش ظثريثسن فهذنثف صهمم زث ذقثشفثي بخق سعسحهذهخعس شففثوحفس.

source: Enable Timed Exams
rtl: ثرشزمث فهوثي ثطشوسɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɥᴉs ʌɐlnǝ ᴉs ʇɹnǝ, ɐ Ƶǝndǝsʞ ʇᴉɔʞǝʇ ʍᴉll bǝ ɔɹǝɐʇǝd ɟøɹ snsdᴉɔᴉøns ɐʇʇǝɯdʇs.

source: Enter true or false. If this value is true, timed exams are enabled in your course. Regardless of this setting, timed exams are enabled if Enable Proctored Exams is set to true.
rtl: ثرفثق فقعث خق بشمسث. هب فاهس دشمعث هس فقعث, فهوثي ثطشوس شقث ثرشزمثي هر غخعق ذخعقسث. قثلشقيمثسس خب فاهس سثففهرل, فهوثي ثطشوس شقث ثرشزمثي هب ثرشزمث حقخذفخقثي ثطشوس هس سثف فخ فقعث.

source: Minimum Grade for Credit
rtl: وهرهوعو لقشيث بخق ذقثيهفɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɥᴉs ʌɐlnǝ ᴉs ʇɹnǝ, ʇᴉɯǝd ǝxɐɯs ɐɹǝ ǝnɐblǝd ᴉn ʎønɹ ɔønɹsǝ. Ɍǝƃɐɹdlǝss øɟ ʇɥᴉs sǝʇʇᴉnƃ, ʇᴉɯǝd ǝxɐɯs ɐɹǝ ǝnɐblǝd ᴉɟ Ɇnɐblǝ Ᵽɹøɔʇøɹǝd Ɇxɐɯs ᴉs sǝʇ ʇø ʇɹnǝ.

source: The minimum grade that a learner must earn to receive credit in the course, as a decimal between 0.0 and 1.0. For example, for 75%, enter 0.75.
rtl: فاث وهرهوعو لقشيث فاشف ش مثشقرثق وعسف ثشقر فخ قثذثهدث ذقثيهف هر فاث ذخعقسث, شس ش يثذهوشم زثفصثثر 0.0 شري 1.0. بخق ثطشوحمث, بخق 75%, ثرفثق 0.75.Ŧɥǝ ɯᴉnᴉɯnɯ ƃɹɐdǝ ʇɥɐʇ ɐ lǝɐɹnǝɹ ɯnsʇ ǝɐɹn ʇø ɹǝɔǝᴉʌǝ ɔɹǝdᴉʇ ᴉn ʇɥǝ ɔønɹsǝ, ɐs ɐ dǝɔᴉɯɐl bǝʇʍǝǝn 0.0 ɐnd 1.0. Føɹ ǝxɐɯdlǝ, ɟøɹ 75%, ǝnʇǝɹ 0.75.

source: Self Paced
rtl: سثمب حشذثي

source: Set this to "true" to mark this course as self-paced. Self-paced courses do not have due dates for assignments, and students can progress through the course at any rate before the course ends.
rtl: سثف فاهس فخ "فقعث" فخ وشقن فاهس ذخعقسث شس سثمب-حشذثي. سثمب-حشذثي ذخعقسثس يخ رخف اشدث يعث يشفثس بخق شسسهلروثرفس, شري سفعيثرفس ذشر حقخلقثسس فاقخعلا فاث ذخعقسث شف شرغ قشفث زثبخقث فاث ذخعقسث ثريس.

source: Enable Subsection Prerequisites
rtl: ثرشزمث سعزسثذفهخر حقثقثضعهسهفثسSǝʇ ʇɥᴉs ʇø "ʇɹnǝ" ʇø ɯɐɹʞ ʇɥᴉs ɔønɹsǝ ɐs sǝlɟ-dɐɔǝd. Sǝlɟ-dɐɔǝd ɔønɹsǝs dø nøʇ ɥɐʌǝ dnǝ dɐʇǝs ɟøɹ ɐssᴉƃnɯǝnʇs, ɐnd sʇndǝnʇs ɔɐn dɹøƃɹǝss ʇɥɹønƃɥ ʇɥǝ ɔønɹsǝ ɐʇ ɐnʎ ɹɐʇǝ bǝɟøɹǝ ʇɥǝ ɔønɹsǝ ǝnds.

source: Enter true or false. If this value is true, you can hide a subsection until learners earn a minimum score in another, prerequisite subsection.
rtl: ثرفثق فقعث خق بشمسث. هب فاهس دشمعث هس فقعث, غخع ذشر اهيث ش سعزسثذفهخر عرفهم مثشقرثقس ثشقر ش وهرهوعو سذخقث هر شرخفاثق, حقثقثضعهسهفث سعزسثذفهخر.

source: Course Learning Information
rtl: ذخعقسث مثشقرهرل هربخقوشفهخر

source: Specify what student can learn from the course.
rtl: سحثذهبغ صاشف سفعيثرف ذشر مثشقر بقخو فاث ذخعقسث.

source: Course Visibility For Unenrolled Learners
rtl: ذخعقسث دهسهزهمهفغ بخق عرثرقخممثي مثشقرثقسɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɥᴉs ʌɐlnǝ ᴉs ʇɹnǝ, ʎøn ɔɐn ɥᴉdǝ ɐ snbsǝɔʇᴉøn nnʇᴉl lǝɐɹnǝɹs ǝɐɹn ɐ ɯᴉnᴉɯnɯ sɔøɹǝ ᴉn ɐnøʇɥǝɹ, dɹǝɹǝbnᴉsᴉʇǝ snbsǝɔʇᴉøn.

source: Defines the access permissions for unenrolled learners. This can be set to one of three values: 'private' (default visibility, only allowed for enrolled students), 'public_outline' (allow access to course outline) and 'public' (allow access to both outline and course content).
rtl: يثبهرثس فاث شذذثسس حثقوهسسهخرس بخق عرثرقخممثي مثشقرثقس. فاهس ذشر زث سثف فخ خرث خب فاقثث دشمعثس: 'حقهدشفث' (يثبشعمف دهسهزهمهفغ, خرمغ شممخصثي بخق ثرقخممثي سفعيثرفس), 'حعزمهذ_خعفمهرث' (شممخص شذذثسس فخ ذخعقسث خعفمهرث) شري 'حعزمهذ' (شممخص شذذثسس فخ زخفا خعفمهرث شري ذخعقسث ذخرفثرف).

source: Course Instructor
rtl: ذخعقسث هرسفقعذفخق

source: Enter the details for Course Instructor
rtl: ثرفثق فاث يثفشهمس بخق ذخعقسث هرسفقعذفخق

source: Add Unsupported Problems and Tools
rtl: شيي عرسعححخقفثي حقخزمثوس شري فخخمسĐǝɟᴉnǝs ʇɥǝ ɐɔɔǝss dǝɹɯᴉssᴉøns ɟøɹ nnǝnɹøllǝd lǝɐɹnǝɹs. Ŧɥᴉs ɔɐn bǝ sǝʇ ʇø ønǝ øɟ ʇɥɹǝǝ ʌɐlnǝs: 'dɹᴉʌɐʇǝ' (dǝɟɐnlʇ ʌᴉsᴉbᴉlᴉʇʎ, ønlʎ ɐlløʍǝd ɟøɹ ǝnɹøllǝd sʇndǝnʇs), 'dnblᴉɔ_ønʇlᴉnǝ' (ɐlløʍ ɐɔɔǝss ʇø ɔønɹsǝ ønʇlᴉnǝ) ɐnd 'dnblᴉɔ' (ɐlløʍ ɐɔɔǝss ʇø bøʇɥ ønʇlᴉnǝ ɐnd ɔønɹsǝ ɔønʇǝnʇ).

source: Enter true or false. If true, you can add unsupported problems and tools to your course in Studio. Unsupported problems and tools are not recommended for use in courses due to non-compliance with one or more of the base requirements, such as testing, accessibility, internationalization, and documentation.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, غخع ذشر شيي عرسعححخقفثي حقخزمثوس شري فخخمس فخ غخعق ذخعقسث هر سفعيهخ. عرسعححخقفثي حقخزمثوس شري فخخمس شقث رخف قثذخووثريثي بخق عسث هر ذخعقسثس يعث فخ رخر-ذخوحمهشرذث صهفا خرث خق وخقث خب فاث زشسث قثضعهقثوثرفس, سعذا شس فثسفهرل, شذذثسسهزهمهفغ, هرفثقرشفهخرشمهظشفهخر, شري يخذعوثرفشفهخر.

source: Highlights Enabled for Messaging
rtl: اهلامهلافس ثرشزمثي بخق وثسسشلهرلɆnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, ʎøn ɔɐn ɐdd nnsnddøɹʇǝd dɹøblǝɯs ɐnd ʇøøls ʇø ʎønɹ ɔønɹsǝ ᴉn Sʇndᴉø. Ʉnsnddøɹʇǝd dɹøblǝɯs ɐnd ʇøøls ɐɹǝ nøʇ ɹǝɔøɯɯǝndǝd ɟøɹ nsǝ ᴉn ɔønɹsǝs dnǝ ʇø nøn-ɔøɯdlᴉɐnɔǝ ʍᴉʇɥ ønǝ øɹ ɯøɹǝ øɟ ʇɥǝ bɐsǝ ɹǝbnᴉɹǝɯǝnʇs, snɔɥ ɐs ʇǝsʇᴉnƃ, ɐɔɔǝssᴉbᴉlᴉʇʎ, ᴉnʇǝɹnɐʇᴉønɐlᴉzɐʇᴉøn, ɐnd døɔnɯǝnʇɐʇᴉøn.

source: Enter true or false. If true, any highlights associated with content in the course will be messaged to learners at their scheduled time.
rtl: ثرفثق فقعث خق بشمسث. هب فقعث, شرغ اهلامهلافس شسسخذهشفثي صهفا ذخرفثرف هر فاث ذخعقسث صهمم زث وثسسشلثي فخ مثشقرثقس شف فاثهق سذاثيعمثي فهوث.Ɇnʇǝɹ ʇɹnǝ øɹ ɟɐlsǝ. Ɨɟ ʇɹnǝ, ɐnʎ ɥᴉƃɥlᴉƃɥʇs ɐssøɔᴉɐʇǝd ʍᴉʇɥ ɔønʇǝnʇ ᴉn ʇɥǝ ɔønɹsǝ ʍᴉll bǝ ɯǝssɐƃǝd ʇø lǝɐɹnǝɹs ɐʇ ʇɥǝᴉɹ sɔɥǝdnlǝd ʇᴉɯǝ.

source: Course-wide Custom JS
rtl: Ȼønɹsǝ-ʍᴉdǝ Ȼnsʇøɯ ɈS

source: Enter Javascript resource URLs you want to be loaded globally throughout the course pages.
rtl: Ɇnʇǝɹ Ɉɐʌɐsɔɹᴉdʇ ɹǝsønɹɔǝ ɄɌŁs ʎøn ʍɐnʇ ʇø bǝ løɐdǝd ƃløbɐllʎ ʇɥɹønƃɥønʇ ʇɥǝ ɔønɹsǝ dɐƃǝs.

source: Course-wide Custom CSS
rtl: Ȼønɹsǝ-ʍᴉdǝ Ȼnsʇøɯ ȻSS

source: Enter CSS resource URLs you want to be loaded globally throughout the course pages.
rtl: Ɇnʇǝɹ ȻSS ɹǝsønɹɔǝ ɄɌŁs ʎøn ʍɐnʇ ʇø bǝ løɐdǝd ƃløbɐllʎ ʇɥɹønƃɥønʇ ʇɥǝ ɔønɹsǝ dɐƃǝs.

source: Other Course Settings
rtl: خفاثق ذخعقسث سثففهرلس

source: Any additional information about the course that the platform needs or that allows integration with external systems such as CRM software. Enter a dictionary of values in JSON format, such as { "my_custom_setting": "value", "other_setting": "value" }
rtl: شرغ شييهفهخرشم هربخقوشفهخر شزخعف فاث ذخعقسث فاشف فاث حمشفبخقو رثثيس خق فاشف شممخصس هرفثلقشفهخر صهفا ثطفثقرشم سغسفثوس سعذا شس ذقو سخبفصشقث. ثرفثق ش يهذفهخرشقغ خب دشمعثس هر تسخر بخقوشف, سعذا شس { "my_custom_setting": Ⱥnʎ ɐddᴉʇᴉønɐl ᴉnɟøɹɯɐʇᴉøn ɐbønʇ ʇɥǝ ɔønɹsǝ ʇɥɐʇ ʇɥǝ dlɐʇɟøɹɯ nǝǝds øɹ ʇɥɐʇ ɐlløʍs ᴉnʇǝƃɹɐʇᴉøn ʍᴉʇɥ ǝxʇǝɹnɐl sʎsʇǝɯs snɔɥ ɐs ȻɌM søɟʇʍɐɹǝ. Ɇnʇǝɹ ɐ dᴉɔʇᴉønɐɹʎ øɟ ʌɐlnǝs ᴉn ɈSØN ɟøɹɯɐʇ, snɔɥ ɐs { "my_custom_setting": "value", "other_setting": "value" }

source: General
rtl: لثرثقشم

source: {assignment_type} = {weighted_percent:.2%} of a possible {weight:.2%}
rtl: {assignment_type} = {weighted_percent:.2%} خب ش حخسسهزمث {weight:.2%}

source: Generated
rtl: لثرثقشفثي

source: {section_type} {index} Unreleased - 0% (?/?)
rtl: {section_type} {index} عرقثمثشسثي - 0% (?/?)

source: The lowest {drop_count} {section_type} scores are dropped.
rtl: فاث مخصثسف {drop_count} {section_type} سذخقثس شقث يقخححثي.

source: {section_type} Average = {percent:.0%}
rtl: {section_type} شدثقشلث = {percent:.0%}

source: {short_label} Avg
rtl: {short_label} شدل

source: ERROR: "{block_type}" is an unknown component type. This component will be hidden in LMS.
rtl: ثققخق: "{block_type}" هس شر عرنرخصر ذخوحخرثرف فغحث. فاهس ذخوحخرثرف صهمم زث اهييثر هر موس.

source: Html contents to display for this module
rtl: افوم ذخرفثرفس فخ يهسحمشغ بخق فاهس وخيعمث
