Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: You can not move {source_usage_key} at an invalid index ({target_index}).
rtl: غخع ذشر رخف وخدث {source_usage_key} شف شر هردشمهي هريثط ({target_index}).Ɏøn ɔɐn nøʇ ɯøʌǝ {source_usage_key} ɐʇ ɐn ᴉnʌɐlᴉd ᴉndǝx ({target_index}).

source: You must provide target_index ({target_index}) as an integer.
rtl: غخع وعسف حقخدهيث فشقلثف_هريثط ({target_index}) شس شر هرفثلثق.

source: Duplicate of {0}
rtl: يعحمهذشفث خب {0}

source: Duplicate of '{0}'
rtl: يعحمهذشفث خب '{0}'

source: Students must score {score}{pct_sign} or higher to access course materials.
rtl: سفعيثرفس وعسف سذخقث {score}{pct_sign} خق اهلاثق فخ شذذثسس ذخعقسث وشفثقهشمس.Sʇndǝnʇs ɯnsʇ sɔøɹǝ {score}{pct_sign} øɹ ɥᴉƃɥǝɹ ʇø ɐɔɔǝss ɔønɹsǝ ɯɐʇǝɹᴉɐls.

source: User does not have the permission to create library in this organization or course creation is disabled
rtl: عسثق يخثس رخف اشدث فاث حثقوهسسهخر فخ ذقثشفث مهزقشقغ هر فاهس خقلشرهظشفهخر خق ذخعقسث ذقثشفهخر هس يهسشزمثيɄsǝɹ døǝs nøʇ ɥɐʌǝ ʇɥǝ dǝɹɯᴉssᴉøn ʇø ɔɹǝɐʇǝ lᴉbɹɐɹʎ ᴉn ʇɥᴉs øɹƃɐnᴉzɐʇᴉøn øɹ ɔønɹsǝ ɔɹǝɐʇᴉøn ᴉs dᴉsɐblǝd

source: Unable to create library - missing required field '{field}'
rtl: عرشزمث فخ ذقثشفث مهزقشقغ - وهسسهرل قثضعهقثي بهثمي '{field}'

source: Unable to create library '{name}'. {err}
rtl: عرشزمث فخ ذقثشفث مهزقشقغ '{name}'. Ʉnɐblǝ ʇø ɔɹǝɐʇǝ lᴉbɹɐɹʎ '{name}'. {err}

source: There is already a library defined with the same organization and library code. Please change your library code so that it is unique within your organization.
rtl: فاثقث هس شمقثشيغ ش مهزقشقغ يثبهرثي صهفا فاث سشوث خقلشرهظشفهخر شري مهزقشقغ ذخيث. حمثشسث ذاشرلث غخعق مهزقشقغ ذخيث سخ فاشف هف هس عرهضعث صهفاهر غخعق خقلشرهظشفهخر.Ŧɥǝɹǝ ᴉs ɐlɹǝɐdʎ ɐ lᴉbɹɐɹʎ dǝɟᴉnǝd ʍᴉʇɥ ʇɥǝ sɐɯǝ øɹƃɐnᴉzɐʇᴉøn ɐnd lᴉbɹɐɹʎ ɔødǝ. Ᵽlǝɐsǝ ɔɥɐnƃǝ ʎønɹ lᴉbɹɐɹʎ ɔødǝ sø ʇɥɐʇ ᴉʇ ᴉs nnᴉbnǝ ʍᴉʇɥᴉn ʎønɹ øɹƃɐnᴉzɐʇᴉøn.

source: '{organization_key}' is not a valid organization identifier.
rtl: '{organization_key}' هس رخف ش دشمهي خقلشرهظشفهخر هيثرفهبهثق.

source: Access restricted to: {list_of_groups}
rtl: شذذثسس قثسفقهذفثي فخ: {list_of_groups}

source: The information you entered is incorrect.
rtl: فاث هربخقوشفهخر غخع ثرفثقثي هس هرذخققثذف.

source: Transcripts are supported only for "video" modules.
rtl: فقشرسذقهحفس شقث سعححخقفثي خرمغ بخق "دهيثخ" وخيعمثس.

source: Cannot find item by locator.
rtl: ذشررخف بهري هفثو زغ مخذشفخق.

source: Video locator is required.
rtl: دهيثخ مخذشفخق هس قثضعهقثي.

source: This transcript file type is not supported.
rtl: فاهس فقشرسذقهحف بهمث فغحث هس رخف سعححخقفثي.

source: Video ID is required.
rtl: دهيثخ هي هس قثضعهقثي.

source: Incoming video data is empty.
rtl: هرذخوهرل دهيثخ يشفش هس ثوحفغ.

source: Can't find item by locator.
rtl: ذشر'ف بهري هفثو زغ مخذشفخق.

source: No such transcript.
rtl: رخ سعذا فقشرسذقهحف.

source: There is a problem with the chosen transcript file.
rtl: فاثقث هس ش حقخزمثو صهفا فاث ذاخسثر فقشرسذقهحف بهمث.

source: There is a problem with the existing transcript file. Please upload a different file.
rtl: فاثقث هس ش حقخزمثو صهفا فاث ثطهسفهرل فقشرسذقهحف بهمث. حمثشسث عحمخشي ش يهببثقثرف بهمث.

source: YouTube ID is required.
rtl: غخعفعزث هي هس قثضعهقثي.

source: There is a problem with the YouTube transcript file.
rtl: فاثقث هس ش حقخزمثو صهفا فاث غخعفعزث فقشرسذقهحف بهمث.

source: Insufficient permissions
rtl: هرسعببهذهثرف حثقوهسسهخرسŦɥǝɹǝ ᴉs ɐ dɹøblǝɯ ʍᴉʇɥ ʇɥǝ ǝxᴉsʇᴉnƃ ʇɹɐnsɔɹᴉdʇ ɟᴉlǝ. Ᵽlǝɐsǝ ndløɐd ɐ dᴉɟɟǝɹǝnʇ ɟᴉlǝ.

source: Could not find user by email address '{email}'.
rtl: ذخعمي رخف بهري عسثق زغ ثوشهم شييقثسس '{email}'.

source: No `role` specified.
rtl: رخ `قخمث` سحثذهبهثي.

source: User {email} has registered but has not yet activated their account.
rtl: عسثق {email} اشس قثلهسفثقثي زعف اشس رخف غثف شذفهدشفثي فاثهق شذذخعرف.

source: Invalid `role` specified.
rtl: هردشمهي `قخمث` سحثذهبهثي.

source: You may not remove the last Admin. Add another Admin first.
rtl: غخع وشغ رخف قثوخدث فاث مشسف شيوهر. شيي شرخفاثق شيوهر بهقسف.

source: Uploading
rtl: عحمخشيهرل

source: In Progress
rtl: هر حقخلقثسس

source: Ready
rtl: قثشيغ

source: Uploaded
rtl: عحمخشيثي

source: Failed
rtl: بشهمثي

source: Cancelled
rtl: ذشرذثممثي

source: Failed Duplicate
rtl: بشهمثي يعحمهذشفث

source: YouTube Duplicate
rtl: غخعفعزث يعحمهذشفث

source: Invalid Token
rtl: هردشمهي فخنثر

source: Imported
rtl: هوحخقفثي

source: Unknown
rtl: عرنرخصر

source: Transcription in Progress
rtl: فقشرسذقهحفهخر هر حقخلقثسس

source: Transcript Ready
rtl: فقشرسذقهحف قثشيغ

source: Partial Failure
rtl: حشقفهشم بشهمعقث

source: Transcript Failed
rtl: فقشرسذقهحف بشهمثي

source: An image file is required.
rtl: شر هوشلث بهمث هس قثضعهقثي.

source: {profile_name} URL
rtl: {profile_name} عقم

source: Duration
rtl: يعقشفهخر

source: Date Added
rtl: يشفث شييثي

source: Status
rtl: سفشفعس

source: {course}_video_urls
rtl: {course}_دهيثخ_عقمس

source: A non zero positive integer is expected
rtl: ش رخر ظثقخ حخسهفهدث هرفثلثق هس ثطحثذفثي

source: unrequested
rtl: عرقثضعثسفثي

source: pending
rtl: حثريهرل

source: granted
rtl: لقشرفثي

source: denied
rtl: يثرهثي

source: Studio user
rtl: سفعيهخ عسثق

source: The date when state was last updated
rtl: فاث يشفث صاثر سفشفث صشس مشسف عحيشفثي

source: Current course creator state
rtl: ذعققثرف ذخعقسث ذقثشفخق سفشفث

source: Optional notes about this user (for example, why course creation access was denied)
rtl: خحفهخرشم رخفثس شزخعف فاهس عسثق (بخق ثطشوحمث, صاغ ذخعقسث ذقثشفهخر شذذثسس صشس يثرهثي)

source: Organizations under which the user is allowed to create courses.
rtl: خقلشرهظشفهخرس عريثق صاهذا فاث عسثق هس شممخصثي فخ ذقثشفث ذخعقسثس.

source: Grant the user the permission to create courses in ALL organizations
rtl: لقشرف فاث عسثق فاث حثقوهسسهخر فخ ذقثشفث ذخعقسثس هر شمم خقلشرهظشفهخرسØdʇᴉønɐl nøʇǝs ɐbønʇ ʇɥᴉs nsǝɹ (ɟøɹ ǝxɐɯdlǝ, ʍɥʎ ɔønɹsǝ ɔɹǝɐʇᴉøn ɐɔɔǝss ʍɐs dǝnᴉǝd)

source: Dump courses to CourseGraph (respect cache)
rtl: Đnɯd ɔønɹsǝs ʇø ȻønɹsǝǤɹɐdɥ (ɹǝsdǝɔʇ ɔɐɔɥǝ)

source: Error enqueueing dumps for {} course(s): {}
rtl: Ɇɹɹøɹ ǝnbnǝnǝᴉnƃ dnɯds ɟøɹ {} ɔønɹsǝ(s): {}

source: Enqueued dumps for {} course(s). Skipped {} unchanged course(s).
rtl: Ɇnbnǝnǝd dnɯds ɟøɹ {} ɔønɹsǝ(s). Sʞᴉddǝd {} nnɔɥɐnƃǝd ɔønɹsǝ(s).

source: Skipped all {} course(s), as they were unchanged.
rtl: Sʞᴉddǝd ɐll {} ɔønɹsǝ(s), ɐs ʇɥǝʎ ʍǝɹǝ nnɔɥɐnƃǝd.

source: Dump courses to CourseGraph (override cache)
rtl: Đnɯd ɔønɹsǝs ʇø ȻønɹsǝǤɹɐdɥ (øʌǝɹɹᴉdǝ ɔɐɔɥǝ)

source: Enqueued dumps for {} course(s).
rtl: Ɇnbnǝnǝd dnɯds ɟøɹ {} ɔønɹsǝ(s).

source: Force Publish Course
rtl: بخقذث حعزمهسا ذخعقسث

source: Sometimes the draft and published branches of a course can get out of sync. Force publish course command resets the published branch of a course to point to the draft branch, effectively force publishing the course. This view dry runs the force publish command
rtl: سخوثفهوثس فاث يقشبف شري حعزمهساثي زقشرذاثس خب ش ذخعقسث ذشر لثف خعف خب سغرذ. بخقذث حعزمهسا ذخعقسث ذخووشري قثسثفس فاث حعزمهساثي زقشرذا خب ش ذخعقسث فخ حخهرف فخ فاث يقشبف زقشرذا, ثببثذفهدثمغ بخقذث حعزمهساهرل فاث ذخعقسث. فاهس دهثص يقغ قعرس فاث بخقذث حعزمهسا ذخووشري

source: Edit Announcements
rtl: ثيهف شررخعرذثوثرفسSøɯǝʇᴉɯǝs ʇɥǝ dɹɐɟʇ ɐnd dnblᴉsɥǝd bɹɐnɔɥǝs øɟ ɐ ɔønɹsǝ ɔɐn ƃǝʇ ønʇ øɟ sʎnɔ. Føɹɔǝ dnblᴉsɥ ɔønɹsǝ ɔøɯɯɐnd ɹǝsǝʇs ʇɥǝ dnblᴉsɥǝd bɹɐnɔɥ øɟ ɐ ɔønɹsǝ ʇø døᴉnʇ ʇø ʇɥǝ dɹɐɟʇ bɹɐnɔɥ, ǝɟɟǝɔʇᴉʌǝlʎ ɟøɹɔǝ dnblᴉsɥᴉnƃ ʇɥǝ ɔønɹsǝ. Ŧɥᴉs ʌᴉǝʍ dɹʎ ɹnns ʇɥǝ ɟøɹɔǝ dnblᴉsɥ ɔøɯɯɐnd

source: This view shows the announcement editor to create or alter announcements that are shown on the rightside of the dashboard.
rtl: فاهس دهثص ساخصس فاث شررخعرذثوثرف ثيهفخق فخ ذقثشفث خق شمفثق شررخعرذثوثرفس فاشف شقث ساخصر خر فاث قهلافسهيث خب فاث يشسازخشقي.

source: Please provide course id.
rtl: حمثشسث حقخدهيث ذخعقسث هي.

source: Invalid course key.
rtl: هردشمهي ذخعقسث نثغ.

source: No matching course found.
rtl: رخ وشفذاهرل ذخعقسث بخعري.

source: Force publishing course is not supported with old mongo courses.
rtl: بخقذث حعزمهساهرل ذخعقسث هس رخف سعححخقفثي صهفا خمي وخرلخ ذخعقسثس.

source: Course is already in published state.
rtl: ذخعقسث هس شمقثشيغ هر حعزمهساثي سفشفث.Ŧɥᴉs ʌᴉǝʍ sɥøʍs ʇɥǝ ɐnnønnɔǝɯǝnʇ ǝdᴉʇøɹ ʇø ɔɹǝɐʇǝ øɹ ɐlʇǝɹ ɐnnønnɔǝɯǝnʇs ʇɥɐʇ ɐɹǝ sɥøʍn øn ʇɥǝ ɹᴉƃɥʇsᴉdǝ øɟ ʇɥǝ dɐsɥbøɐɹd.

source: Incorrect format for field '{name}'. {detailed_message}
rtl: هرذخققثذف بخقوشف بخق بهثمي '{name}'. {detailed_message}

source: Dictionary with the available tags
rtl: يهذفهخرشقغ صهفا فاث شدشهمشزمث فشلس

source: Studio Administration
rtl: سفعيهخ شيوهرهسفقشفهخر

source: Page Not Found
rtl: حشلث رخف بخعري

source: Page not found
rtl: حشلث رخف بخعري

source: Content
rtl: ذخرفثرف

source: Settings
rtl: سثففهرلس

source: Loading
rtl: مخشيهرل

source: Course Name
rtl: ذخعقسث رشوث

source: Course Number
rtl: ذخعقسث رعوزثق

source: Course Outline
rtl: ذخعقسث خعفمهرث

source: Warning
rtl: صشقرهرل

source: Error:
rtl: ثققخق:

source: Organization:
rtl: خقلشرهظشفهخر:

source: Course Number:
rtl: ذخعقسث رعوزثق:

source: Course Run:
rtl: ذخعقسث قعر:

source: example: username@domain.com
rtl: ثطشوحمث: عسثقرشوث@يخوشهر.ذخو

source: Instructors
rtl: هرسفقعذفخقس

source: Requirements
rtl: قثضعهقثوثرفس

source: Details
rtl: يثفشهمس

source: View
rtl: دهثص

source: Save
rtl: سشدث

source: Reset
rtl: قثسثف

source: Legal
rtl: مثلشم

source: edX, Open edX, and the edX and Open edX logos are registered trademarks of {link_start}edX Inc.{link_end}
rtl: ثيط, خحثر ثيط, شري فاث ثيط شري خحثر ثيط مخلخس شقث قثلهسفثقثي فقشيثوشقنس خب {link_start}ثيط هرذ.{link_end}ǝdX, Ødǝn ǝdX, ɐnd ʇɥǝ ǝdX ɐnd Ødǝn ǝdX løƃøs ɐɹǝ ɹǝƃᴉsʇǝɹǝd ʇɹɐdǝɯɐɹʞs øɟ {link_start}ǝdX Ɨnɔ.{link_end}

source: Choose Language
rtl: ذاخخسث مشرلعشلث

source: Account
rtl: شذذخعرف

source: Help
rtl: اثمح

source: Looking for help with {studio_name}?
rtl: مخخنهرل بخق اثمح صهفا {studio_name}?

source: Hide {studio_name} Help
rtl: اهيث {studio_name} اثمح

source: {studio_name} Documentation
rtl: {studio_name} يخذعوثرفشفهخر

source: Access documentation on http://docs.edx.org
rtl: شذذثسس يخذعوثرفشفهخر خر اففح://يخذس.ثيط.خقل

source: edX Documentation
rtl: ثيط يخذعوثرفشفهخر

source: Enroll in edX101: Overview of Creating an edX Course
rtl: ثرقخمم هر ثيط101: خدثقدهثص خب ذقثشفهرل شر ثيط ذخعقسث

source: Enroll in edX101
rtl: ثرقخمم هر ثيط101

source: Enroll in StudioX: Creating a Course with edX Studio
rtl: ثرقخمم هر سفعيهخط: ذقثشفهرل ش ذخعقسث صهفا ثيط سفعيهخ

source: Enroll in StudioX
rtl: ثرقخمم هر سفعيهخط

source: Send an email to {email}
rtl: سثري شر ثوشهم فخ {email}

source: name
rtl: رشوث

source: Sign Out
rtl: سهلر خعف

source: Code Editor
rtl: ذخيث ثيهفخق

source: Feedback Form
rtl: بثثيزشذن بخقو

source: Email: {email}
rtl: ثوشهم: {email}

source: Full Name: {realname}
rtl: بعمم رشوث: {realname}

source: Inquiry Type: {inquiry_type}
rtl: هرضعهقغ فغحث: {inquiry_type}

source: Message: {message}
rtl: وثسسشلث: {message}

source: Tags: {tags}
rtl: فشلس: {tags}

source: Additional Info:
rtl: شييهفهخرشم هربخ:

source: Feedback from user
rtl: بثثيزشذن بقخو عسثق

source: The email associated with your {platform_name} account has changed from {old_email} to {new_email}.
rtl: فاث ثوشهم شسسخذهشفثي صهفا غخعق {platform_name} شذذخعرف اشس ذاشرلثي بقخو {old_email} فخ {new_email}.

source: No action is needed on your part.
rtl: رخ شذفهخر هس رثثيثي خر غخعق حشقف.Ŧɥǝ ǝɯɐᴉl ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʎønɹ {platform_name} ɐɔɔønnʇ ɥɐs ɔɥɐnƃǝd ɟɹøɯ {old_email} ʇø {new_email}.

source: If this change is not correct, contact {link_start}{platform_name} Support{link_end} or your administrator.
rtl: هب فاهس ذاشرلث هس رخف ذخققثذف, ذخرفشذف {link_start}{platform_name} سعححخقف{link_end} خق غخعق شيوهرهسفقشفخق.

source: Your {platform_name} account email has been updated
rtl: غخعق {platform_name} شذذخعرف ثوشهم اشس زثثر عحيشفثي

source: Add a Post
rtl: شيي ش حخسف

source: New topic form
rtl: رثص فخحهذ بخقو

source: Discussion thread list
rtl: يهسذعسسهخر فاقثشي مهسف

source: Private Discussion
rtl: حقهدشفث يهسذعسسهخرƗɟ ʇɥᴉs ɔɥɐnƃǝ ᴉs nøʇ ɔøɹɹǝɔʇ, ɔønʇɐɔʇ {link_start}{platform_name} Snddøɹʇ{link_end} øɹ ʎønɹ ɐdɯᴉnᴉsʇɹɐʇøɹ.

source: This is a private discussion. You do not have permissions to view this discussion
rtl: فاهس هس ش حقهدشفث يهسذعسسهخر. غخع يخ رخف اشدث حثقوهسسهخرس فخ دهثص فاهس يهسذعسسهخرŦɥᴉs ᴉs ɐ dɹᴉʌɐʇǝ dᴉsɔnssᴉøn. Ɏøn dø nøʇ ɥɐʌǝ dǝɹɯᴉssᴉøns ʇø ʌᴉǝʍ ʇɥᴉs dᴉsɔnssᴉøn

source: %s discussion started
rtl: %s يهسذعسسهخر سفشقفثي

source: %s comment
rtl: %s ذخووثرف

source: Discussion unavailable
rtl: يهسذعسسهخر عرشدشهمشزمث

source: The discussions are currently undergoing maintenance. We'll have them back up shortly!
rtl: فاث يهسذعسسهخرس شقث ذعققثرفمغ عريثقلخهرل وشهرفثرشرذث. صث'مم اشدث فاثو زشذن عح ساخقفمغ!

source: Content Locked
rtl: ذخرفثرف مخذنثيŦɥǝ dᴉsɔnssᴉøns ɐɹǝ ɔnɹɹǝnʇlʎ nndǝɹƃøᴉnƃ ɯɐᴉnʇǝnɐnɔǝ. Wǝ'll ɥɐʌǝ ʇɥǝɯ bɐɔʞ nd sɥøɹʇlʎ!

source: You must complete the prerequisites for '{prereq_section_name}' to access this content.
rtl: غخع وعسف ذخوحمثفث فاث حقثقثضعهسهفثس بخق '{prereq_section_name}' فخ شذذثسس فاهس ذخرفثرف.

source: Go to Prerequisite Section
rtl: لخ فخ حقثقثضعهسهفث سثذفهخر

source: Collapse Instructions
rtl: ذخممشحسث هرسفقعذفهخرس

source: Guided Discussion
rtl: لعهيثي يهسذعسسهخر

source: Hide Annotations
rtl: اهيث شررخفشفهخرس

source: Bookmarked
rtl: زخخنوشقنثي

source: Bookmark this page
rtl: زخخنوشقن فاهس حشلث

source: You do not have access to this dependency module.
rtl: غخع يخ رخف اشدث شذذثسس فخ فاهس يثحثريثرذغ وخيعمث.

source: LEARN MORE
rtl: مثشقر وخقث

source: Starts
rtl: سفشقفس

source: Starts: {date}
rtl: سفشقفس: {date}

source: View all Courses
rtl: دهثص شمم ذخعقسثس

source: Dashboard
rtl: يشسازخشقي

source: results successfully populated,
rtl: قثسعمفس سعذذثسسبعممغ حخحعمشفثي,

source: Click to load all enrolled courses
rtl: ذمهذن فخ مخشي شمم ثرقخممثي ذخعقسثس

source: You are not enrolled in any courses yet.
rtl: غخع شقث رخف ثرقخممثي هر شرغ ذخعقسثس غثف.Ɏøn ɯnsʇ ɔøɯdlǝʇǝ ʇɥǝ dɹǝɹǝbnᴉsᴉʇǝs ɟøɹ '{prereq_section_name}' ʇø ɐɔɔǝss ʇɥᴉs ɔønʇǝnʇ.

source: Explore courses
rtl: ثطحمخقث ذخعقسثس

source: Activate your account!
rtl: شذفهدشفث غخعق شذذخعرف!

source: Course-loading errors
rtl: ذخعقسث-مخشيهرل ثققخقس

source: Search Your Courses
rtl: سثشقذا غخعق ذخعقسثس

source: Clear search
rtl: ذمثشق سثشقذا

source: Skip to list of announcements
rtl: سنهح فخ مهسف خب شررخعرذثوثرفس

source: Account Status Info
rtl: شذذخعرف سفشفعس هربخ

source: Activate your account so you can log back in
rtl: شذفهدشفث غخعق شذذخعرف سخ غخع ذشر مخل زشذن هر

source: We sent an email to {strong_start}{email}{strong_end} with a link to activate your account. Can’t find it? Check your spam folder or {link_start}resend the email{link_end}.
rtl: صث سثرف شر ثوشهم فخ {strong_start}{email}{strong_end} صهفا ش مهرن فخ شذفهدشفث غخعق شذذخعرف. ذشر’ف بهري هف? ذاثذن غخعق سحشو بخميثق خق {link_start}قثسثري فاث ثوشهم{link_end}.

source: Continue to {platform_name}
rtl: ذخرفهرعث فخ {platform_name}

source: Email Settings for {course_number}
rtl: ثوشهم سثففهرلس بخق {course_number}

source: Receive course emails
rtl: قثذثهدث ذخعقسث ثوشهمس

source: Save Settings
rtl: سشدث سثففهرلسWǝ sǝnʇ ɐn ǝɯɐᴉl ʇø {strong_start}{email}{strong_end} ʍᴉʇɥ ɐ lᴉnʞ ʇø ɐɔʇᴉʌɐʇǝ ʎønɹ ɐɔɔønnʇ. Ȼɐn’ʇ ɟᴉnd ᴉʇ? Ȼɥǝɔʞ ʎønɹ sdɐɯ ɟøldǝɹ øɹ {link_start}ɹǝsǝnd ʇɥǝ ǝɯɐᴉl{link_end}.

source: Unenroll
rtl: عرثرقخمم

source: It looks like you missed some important deadlines based on our suggested schedule.
rtl: هف مخخنس مهنث غخع وهسسثي سخوث هوحخقفشرف يثشيمهرثس زشسثي خر خعق سعللثسفثي سذاثيعمث.

source: To keep yourself on track, you can update this schedule and shift the past due assignments into the future by visiting
rtl: فخ نثثح غخعقسثمب خر فقشذن, غخع ذشر عحيشفث فاهس سذاثيعمث شري ساهبف فاث حشسف يعث شسسهلروثرفس هرفخ فاث بعفعقث زغ دهسهفهرل

source: Don't worry—you won't lose any of the progress you've made when you shift your due dates.
rtl: يخر'ف صخققغ—غخع صخر'ف مخسث شرغ خب فاث حقخلقثسس غخع'دث وشيث صاثر غخع ساهبف غخعق يعث يشفثس.

source: To keep yourself on track, you can update this schedule and shift the past due assignments into the future. Don't worry—you won't lose any of the progress you've made when you shift your due dates.
rtl: فخ نثثح غخعقسثمب خر فقشذن, غخع ذشر عحيشفث فاهس سذاثيعمث شري ساهبف فاث حشسف يعث شسسهلروثرفس هرفخ فاث بعفعقث. يخر'ف صخققغ—غخع صخر'ف مخسث شرغ خب فاث حقخلقثسس غخع'دث وشيث صاثر غخع ساهبف غخعق يعث يشفثس.

source: You are auditing this course,
rtl: غخع شقث شعيهفهرل فاهس ذخعقسث,

source: which means that you are unable to participate in graded assignments.
rtl: صاهذا وثشرس فاشف غخع شقث عرشزمث فخ حشقفهذهحشفث هر لقشيثي شسسهلروثرفس.

source: It looks like you missed some important deadlines based on our suggested schedule. Graded assignments and schedule adjustment are available to Verified Track learners.
rtl: هف مخخنس مهنث غخع وهسسثي سخوث هوحخقفشرف يثشيمهرثس زشسثي خر خعق سعللثسفثي سذاثيعمث. لقشيثي شسسهلروثرفس شري سذاثيعمث شيتعسفوثرف شقث شدشهمشزمث فخ دثقهبهثي فقشذن مثشقرثقس.

source: It looks like you missed some important deadlines based on our suggested schedule. To complete graded assignments as part of this course and shift the past due assignments into the future, you can upgrade today.
rtl: هف مخخنس مهنث غخع وهسسثي سخوث هوحخقفشرف يثشيمهرثس زشسثي خر خعق سعللثسفثي سذاثيعمث. فخ ذخوحمثفث لقشيثي شسسهلروثرفس شس حشقف خب فاهس ذخعقسث شري ساهبف فاث حشسف يعث شسسهلروثرفس هرفخ فاث بعفعقث, غخع ذشر عحلقشيث فخيشغ.

source: Upgrade to shift due dates
rtl: عحلقشيث فخ ساهبف يعث يشفثس

source: Graded assignments are available to Verified Track learners.
rtl: لقشيثي شسسهلروثرفس شقث شدشهمشزمث فخ دثقهبهثي فقشذن مثشقرثقس.

source: To complete graded assignments as part of this course, you can upgrade today.
rtl: فخ ذخوحمثفث لقشيثي شسسهلروثرفس شس حشقف خب فاهس ذخعقسث, غخع ذشر عحلقشيث فخيشغ.

source: We've built a suggested schedule to help you stay on track.
rtl: صث'دث زعهمف ش سعللثسفثي سذاثيعمث فخ اثمح غخع سفشغ خر فقشذن.

source: But don't worry—it's flexible so you can learn at your own pace. If you happen to fall behind on our suggested dates, you'll be able to adjust them to keep yourself on track.
rtl: زعف يخر'ف صخققغ—هف'س بمثطهزمث سخ غخع ذشر مثشقر شف غخعق خصر حشذث. هب غخع اشححثر فخ بشمم زثاهري خر خعق سعللثسفثي يشفثس, غخع'مم زث شزمث فخ شيتعسف فاثو فخ نثثح غخعقسثمب خر فقشذن.

source: E-mail change failed
rtl: ث-وشهم ذاشرلث بشهمثي

source: We were unable to send a confirmation email to {email}
rtl: صث صثقث عرشزمث فخ سثري ش ذخربهقوشفهخر ثوشهم فخ {email}

source: Go back to the {link_start}home page{link_end}.
rtl: لخ زشذن فخ فاث {link_start}اخوث حشلث{link_end}.

source: E-mail change successful!
rtl: ث-وشهم ذاشرلث سعذذثسسبعم!

source: You should see your new email in your {link_start}dashboard{link_end}.
rtl: غخع ساخعمي سثث غخعق رثص ثوشهم هر غخعق {link_start}يشسازخشقي{link_end}.

source: An account with the new e-mail address already exists.
rtl: شر شذذخعرف صهفا فاث رثص ث-وشهم شييقثسس شمقثشيغ ثطهسفس.

source: You should Register before trying to access the Unit
rtl: غخع ساخعمي قثلهسفثق زثبخقث فقغهرل فخ شذذثسس فاث عرهفɎøn sɥønld sǝǝ ʎønɹ nǝʍ ǝɯɐᴉl ᴉn ʎønɹ {link_start}dɐsɥbøɐɹd{link_end}.

# self
source: Enroll
rtl: ثرقخمم

source: Don't enroll
rtl: يخر'ف ثرقخمم

source: Student Enrollment Form
rtl: سفعيثرف ثرقخمموثرف بخقو

source: Course:
rtl: ذخعقسث:

source: Add new students
rtl: شيي رثص سفعيثرفس

source: Existing students:
rtl: ثطهسفهرل سفعيثرفس:

source: New students added:
rtl: رثص سفعيثرفس شييثي:

source: Students rejected:
rtl: سفعيثرفس قثتثذفثي:

source: Debug:
rtl: يثزعل:

source: External Authentication failed
rtl: ثطفثقرشم شعفاثرفهذشفهخر بشهمثي

source: organization logo
rtl: خقلشرهظشفهخر مخلخ

source: Password Reset
rtl: حشسسصخقي قثسثف

source: Please enter your e-mail address below, and we will e-mail instructions for setting a new password.
rtl: حمثشسث ثرفثق غخعق ث-وشهم شييقثسس زثمخص, شري صث صهمم ث-وشهم هرسفقعذفهخرس بخق سثففهرل ش رثص حشسسصخقي.Ᵽlǝɐsǝ ǝnʇǝɹ ʎønɹ ǝ-ɯɐᴉl ɐddɹǝss bǝløʍ, ɐnd ʍǝ ʍᴉll ǝ-ɯɐᴉl ᴉnsʇɹnɔʇᴉøns ɟøɹ sǝʇʇᴉnƃ ɐ nǝʍ dɐssʍøɹd.

source: Required Information
rtl: قثضعهقثي هربخقوشفهخر

source: Your E-mail Address
rtl: غخعق ث-وشهم شييقثسس

source: This is the e-mail address you used to register with {platform}
rtl: فاهس هس فاث ث-وشهم شييقثسس غخع عسثي فخ قثلهسفثق صهفا {platform}

source: Reset My Password
rtl: قثسثف وغ حشسسصخقي

source: Email is incorrect.
rtl: ثوشهم هس هرذخققثذف.

source: The course has ended.
rtl: فاث ذخعقسث اشس ثريثي.

source: The due date for this assignment has passed.
rtl: فاث يعث يشفث بخق فاهس شسسهلروثرف اشس حشسسثي.

source: Because the course has ended, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
rtl: زثذشعسث فاث ذخعقسث اشس ثريثي, فاهس شسسهلروثرف هس رخ مخرلثق شدشهمشزمث.{line_break}هب غخع اشدث ذخوحمثفثي فاهس شسسهلروثرف, غخعق لقشيث هس شدشهمشزمث خر فاث {link_start}حقخلقثسس حشلث{link_end}.Ƀǝɔɐnsǝ ʇɥǝ ɔønɹsǝ ɥɐs ǝndǝd, ʇɥᴉs ɐssᴉƃnɯǝnʇ ᴉs nø lønƃǝɹ ɐʌɐᴉlɐblǝ.{line_break}Ɨɟ ʎøn ɥɐʌǝ ɔøɯdlǝʇǝd ʇɥᴉs ɐssᴉƃnɯǝnʇ, ʎønɹ ƃɹɐdǝ ᴉs ɐʌɐᴉlɐblǝ øn ʇɥǝ {link_start}dɹøƃɹǝss dɐƃǝ{link_end}.

source: Because the due date has passed, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
rtl: زثذشعسث فاث يعث يشفث اشس حشسسثي, فاهس شسسهلروثرف هس رخ مخرلثق شدشهمشزمث.{line_break}هب غخع اشدث ذخوحمثفثي فاهس شسسهلروثرف, غخعق لقشيث هس شدشهمشزمث خر فاث {link_start}حقخلقثسس حشلث{link_end}.Ƀǝɔɐnsǝ ʇɥǝ dnǝ dɐʇǝ ɥɐs dɐssǝd, ʇɥᴉs ɐssᴉƃnɯǝnʇ ᴉs nø lønƃǝɹ ɐʌɐᴉlɐblǝ.{line_break}Ɨɟ ʎøn ɥɐʌǝ ɔøɯdlǝʇǝd ʇɥᴉs ɐssᴉƃnɯǝnʇ, ʎønɹ ƃɹɐdǝ ᴉs ɐʌɐᴉlɐblǝ øn ʇɥǝ {link_start}dɹøƃɹǝss dɐƃǝ{link_end}.

source: Search for a course
rtl: سثشقذا بخق ش ذخعقسث

source: Welcome to {platform_name}
rtl: صثمذخوث فخ {platform_name}

source: It works! Powered by Open edX{registered_trademark}
rtl: هف صخقنس! حخصثقثي زغ خحثر ثيط{registered_trademark}

source: Invalid email change key
rtl: هردشمهي ثوشهم ذاشرلث نثغ

source: This e-mail key is not valid. Please check:
rtl: فاهس ث-وشهم نثغ هس رخف دشمهي. حمثشسث ذاثذن:

source: Was this key already used? Check whether the e-mail change has already happened.
rtl: صشس فاهس نثغ شمقثشيغ عسثي? ذاثذن صاثفاثق فاث ث-وشهم ذاشرلث اشس شمقثشيغ اشححثرثي.

source: Did your e-mail client break the URL into two lines?
rtl: يهي غخعق ث-وشهم ذمهثرف زقثشن فاث عقم هرفخ فصخ مهرثس?

source: The keys are valid for a limited amount of time. Has the key expired?
rtl: فاث نثغس شقث دشمهي بخق ش مهوهفثي شوخعرف خب فهوث. اشس فاث نثغ ثطحهقثي?Wɐs ʇɥᴉs ʞǝʎ ɐlɹǝɐdʎ nsǝd? Ȼɥǝɔʞ ʍɥǝʇɥǝɹ ʇɥǝ ǝ-ɯɐᴉl ɔɥɐnƃǝ ɥɐs ɐlɹǝɐdʎ ɥɐddǝnǝd.

source: Showing all matching content eligible to be added into {display_name}. Each student will be assigned {max_count} component drawn randomly from this list.
rtl: ساخصهرل شمم وشفذاهرل ذخرفثرف ثمهلهزمث فخ زث شييثي هرفخ {display_name}. ثشذا سفعيثرف صهمم زث شسسهلرثي {max_count} ذخوحخرثرف يقشصر قشريخومغ بقخو فاهس مهسف.

source: External resource
rtl: ثطفثقرشم قثسخعقذث

source: {points} / {total_points} points
rtl: {points} / {total_points} حخهرفس

source: {total_points} points possible
rtl: {total_points} حخهرفس حخسسهزمث

source: View resource in a new window
rtl: دهثص قثسخعقذث هر ش رثص صهريخص

source: Please provide launch_url. Click "Edit", and fill in the required fields.
rtl: حمثشسث حقخدهيث مشعرذا_عقم. ذمهذن "ثيهف", شري بهمم هر فاث قثضعهقثي بهثميس.

source: Feedback on your work from the grader:
rtl: بثثيزشذن خر غخعق صخقن بقخو فاث لقشيثق:

source: Press to Launch
rtl: حقثسس فخ مشعرذا

source: Manage student accounts
rtl: وشرشلث سفعيثرف شذذخعرفس

source: Username:
rtl: عسثقرشوث:

source: Profile:
rtl: حقخبهمث:

source: Image:
rtl: هوشلث:

source: Name:
rtl: رشوث:

source: Choose an action:
rtl: ذاخخسث شر شذفهخر:

source: View Profile
rtl: دهثص حقخبهمث

source: Disable Account
rtl: يهسشزمث شذذخعرف

source: Reenable Account
rtl: قثثرشزمث شذذخعرف

source: Remove Profile Image
rtl: قثوخدث حقخبهمث هوشلث

source: Students whose accounts have been disabled
rtl: سفعيثرفس صاخسث شذذخعرفس اشدث زثثر يهسشزمثي

source: (reload your page to refresh)
rtl: (قثمخشي غخعق حشلث فخ قثبقثسا)
