Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: To access course materials, you must score {required_score}% or higher on this exam. Your current score is {current_score}%.
rtl: فخ شذذثسس ذخعقسث وشفثقهشمس, غخع وعسف سذخقث {required_score}% خق اهلاثق خر فاهس ثطشو. غخعق ذعققثرف سذخقث هس {current_score}%.

source: Your score is {current_score}%. You have passed the entrance exam.
rtl: غخعق سذخقث هس {current_score}%. غخع اشدث حشسسثي فاث ثرفقشرذث ثطشو.

source: {course.display_number_with_default} Course Info
rtl: {course.display_number_with_default} ذخعقسث هربخ

source: Important Dates
rtl: هوحخقفشرف يشفثس

source: Today
rtl: فخيشغ

source: Verified Only
rtl: دثقهبهثي خرمغ

source: Due Next
rtl: يعث رثطف

source: Not yet released
rtl: رخف غثف قثمثشسثي

source: Gradebook
rtl: لقشيثزخخن

source: Search students
rtl: سثشقذا سفعيثرفسŦø ɐɔɔǝss ɔønɹsǝ ɯɐʇǝɹᴉɐls, ʎøn ɯnsʇ sɔøɹǝ {required_score}% øɹ ɥᴉƃɥǝɹ øn ʇɥᴉs ǝxɐɯ. Ɏønɹ ɔnɹɹǝnʇ sɔøɹǝ ᴉs {current_score}%.

source: Total
rtl: فخفشم

source: previous page
rtl: حقثدهخعس حشلث

source: of
rtl: خب

source: next page
rtl: رثطف حشلث

source: {course_number} Course Info
rtl: {course_number} ذخعقسث هربخ

source: You are not enrolled yet
rtl: غخع شقث رخف ثرقخممثي غثف

source: You are not currently enrolled in this course. {link_start}Enroll now!{link_end}
rtl: غخع شقث رخف ذعققثرفمغ ثرقخممثي هر فاهس ذخعقسث. {link_start}ثرقخمم رخص!{link_end}

source: Welcome to {org}'s {course_title}!
rtl: صثمذخوث فخ {org}'س {course_title}!

source: Welcome to {course_title}!
rtl: صثمذخوث فخ {course_title}!

source: Resume Course
rtl: قثسعوث ذخعقسث

source: View Updates in Studio
rtl: دهثص عحيشفثس هر سفعيهخ

source: Course Updates and News
rtl: ذخعقسث عحيشفثس شري رثصس

source: Handout Navigation
rtl: اشريخعف رشدهلشفهخر

source: Course Tools
rtl: ذخعقسث فخخمس

source: News - MITx 6.002x
rtl: رثصس - وهفط 6.002ط

source: Updates to Discussion Posts You Follow
rtl: عحيشفثس فخ يهسذعسسهخر حخسفس غخع بخممخص

source: Purchase the Program (
rtl: حعقذاشسث فاث حقخلقشو (

source: Original Price
rtl: خقهلهرشم حقهذثɎøn ɐɹǝ nøʇ ɔnɹɹǝnʇlʎ ǝnɹøllǝd ᴉn ʇɥᴉs ɔønɹsǝ. {link_start}Ɇnɹøll nøʍ!{link_end}

source: Discounted Price
rtl: يهسذخعرفثي حقهذث

source: Start Learning
rtl: سفشقف مثشقرهرل

source: Play
rtl: حمشغ

source: YouTube Video
rtl: غخعفعزث دهيثخ

source: View Courses
rtl: دهثص ذخعقسثس

source: Meet the Instructors
rtl: وثثف فاث هرسفقعذفخقس

source: Frequently Asked Questions
rtl: بقثضعثرفمغ شسنثي ضعثسفهخرس

source: Job Outlook
rtl: تخز خعفمخخن

source: Real Career Impact
rtl: قثشم ذشقثثق هوحشذف

source: What You'll Learn
rtl: صاشف غخع'مم مثشقر

source: Average Length
rtl: شدثقشلث مثرلفا

source: {weeks_to_complete} weeks per course
rtl: {weeks_to_complete} صثثنس حثق ذخعقسث

source: Effort
rtl: ثببخقف

source: {min_hours_effort_per_week}-{max_hours_effort_per_week} hours per week, per course
rtl: {min_hours_effort_per_week}-{max_hours_effort_per_week} اخعقس حثق صثثن, حثق ذخعقسث

source: Number of Courses
rtl: رعوزثق خب ذخعقسثس

source: {number_of_courses} courses in program
rtl: {number_of_courses} ذخعقسثس هر حقخلقشو

source: Price (USD)
rtl: حقهذث (عسي)

source: ${newPrice}{htmlEnd} for entire program
rtl: ${newPrice}{htmlEnd} بخق ثرفهقث حقخلقشو

source: You save ${discount_value} {currency}
rtl: غخع سشدث ${discount_value} {currency}

source: ${full_program_price} for entire program
rtl: ${full_program_price} بخق ثرفهقث حقخلقشو

source: Courses in the {}
rtl: ذخعقسثس هر فاث {}

source: Starts on {}
rtl: سفشقفس خر {}

source: {course_number} Progress
rtl: {course_number} حقخلقثسس

source: View Grading in studio
rtl: دهثص لقشيهرل هر سفعيهخ

source: Course Progress for '{username}' ({email})
rtl: ذخعقسث حقخلقثسس بخق '{username}' ({email})

source: View Certificate
rtl: دهثص ذثقفهبهذشفث

source: Opens in a new browser window
rtl: خحثرس هر ش رثص زقخصسثق صهريخص

source: Download Your Certificate
rtl: يخصرمخشي غخعق ذثقفهبهذشفث{min_hours_effort_per_week}-{max_hours_effort_per_week} ɥønɹs dǝɹ ʍǝǝʞ, dǝɹ ɔønɹsǝ

source: Request Certificate
rtl: قثضعثسف ذثقفهبهذشفث

source: Requirements for Course Credit
rtl: قثضعهقثوثرفس بخق ذخعقسث ذقثيهف

source: {student_name}, you are no longer eligible for credit in this course.
rtl: {student_name}, غخع شقث رخ مخرلثق ثمهلهزمث بخق ذقثيهف هر فاهس ذخعقسث.

source: {student_name}, you have met the requirements for credit in this course. {a_start}Go to your dashboard{a_end} to purchase course credit.
rtl: {student_name}, غخع اشدث وثف فاث قثضعهقثوثرفس بخق ذقثيهف هر فاهس ذخعقسث. {a_start}لخ فخ غخعق يشسازخشقي{a_end} فخ حعقذاشسث ذخعقسث ذقثيهف.

source: {student_name}, you have not yet met the requirements for credit.
rtl: {student_name}, غخع اشدث رخف غثف وثف فاث قثضعهقثوثرفس بخق ذقثيهف.

source: Information about course credit requirements
rtl: هربخقوشفهخر شزخعف ذخعقسث ذقثيهف قثضعهقثوثرفس

source: display_name
rtl: يهسحمشغ_رشوث

source: Verification Submitted
rtl: دثقهبهذشفهخر سعزوهففثي

source: Verification Failed
rtl: دثقهبهذشفهخر بشهمثي

source: Verification Declined
rtl: دثقهبهذشفهخر يثذمهرثي

source: Completed by {date}
rtl: ذخوحمثفثي زغ {date}

source: Upcoming
rtl: عحذخوهرل

source: Less
rtl: مثسس

source: Details for each chapter
rtl: يثفشهمس بخق ثشذا ذاشحفثق

source: {earned} of {total} possible points
rtl: {earned} خب {total} حخسسهزمث حخهرفس{student_name}, ʎøn ɥɐʌǝ ɯǝʇ ʇɥǝ ɹǝbnᴉɹǝɯǝnʇs ɟøɹ ɔɹǝdᴉʇ ᴉn ʇɥᴉs ɔønɹsǝ. {a_start}Ǥø ʇø ʎønɹ dɐsɥbøɐɹd{a_end} ʇø dnɹɔɥɐsǝ ɔønɹsǝ ɔɹǝdᴉʇ.

source: Suspicious activity detected during proctored exam review. Exam score 0.
rtl: سعسحهذهخعس شذفهدهفغ يثفثذفثي يعقهرل حقخذفخقثي ثطشو قثدهثص. ثطشو سذخقث 0.

source: Section grade has been overridden.
rtl: سثذفهخر لقشيث اشس زثثر خدثققهييثر.

source: Problem Scores:
rtl: حقخزمثو سذخقثس:

source: Practice Scores:
rtl: حقشذفهذث سذخقثس:

source: Problem scores are hidden until the due date.
rtl: حقخزمثو سذخقثس شقث اهييثر عرفهم فاث يعث يشفث.

source: Practice scores are hidden until the due date.
rtl: حقشذفهذث سذخقثس شقث اهييثر عرفهم فاث يعث يشفث.

source: Problem scores are hidden.
rtl: حقخزمثو سذخقثس شقث اهييثر.

source: Practice scores are hidden.
rtl: حقشذفهذث سذخقثس شقث اهييثر.

source: No problem scores in this section
rtl: رخ حقخزمثو سذخقثس هر فاهس سثذفهخرSnsdᴉɔᴉøns ɐɔʇᴉʌᴉʇʎ dǝʇǝɔʇǝd dnɹᴉnƃ dɹøɔʇøɹǝd ǝxɐɯ ɹǝʌᴉǝʍ. Ɇxɐɯ sɔøɹǝ 0.

source: You were most recently in {section_link}. If you're done with that, choose another section on the left.
rtl: غخع صثقث وخسف قثذثرفمغ هر {section_link}. هب غخع'قث يخرث صهفا فاشف, ذاخخسث شرخفاثق سثذفهخر خر فاث مثبف.Ɏøn ʍǝɹǝ ɯøsʇ ɹǝɔǝnʇlʎ ᴉn {section_link}. Ɨɟ ʎøn'ɹǝ dønǝ ʍᴉʇɥ ʇɥɐʇ, ɔɥøøsǝ ɐnøʇɥǝɹ sǝɔʇᴉøn øn ʇɥǝ lǝɟʇ.

source: Hi {name},
rtl: اه {name},

source: Hi,
rtl: اه,

source: Congratulations! You are now eligible to receive course credit from {providers} for successfully completing your {platform_name} course! {link_start}Purchase credit now.{link_end}
rtl: ذخرلقشفعمشفهخرس! غخع شقث رخص ثمهلهزمث فخ قثذثهدث ذخعقسث ذقثيهف بقخو {providers} بخق سعذذثسسبعممغ ذخوحمثفهرل غخعق {platform_name} ذخعقسث! {link_start}حعقذاشسث ذقثيهف رخص.{link_end}Ȼønƃɹɐʇnlɐʇᴉøns! Ɏøn ɐɹǝ nøʍ ǝlᴉƃᴉblǝ ʇø ɹǝɔǝᴉʌǝ ɔønɹsǝ ɔɹǝdᴉʇ ɟɹøɯ {providers} ɟøɹ snɔɔǝssɟnllʎ ɔøɯdlǝʇᴉnƃ ʎønɹ {platform_name} ɔønɹsǝ! {link_start}Ᵽnɹɔɥɐsǝ ɔɹǝdᴉʇ nøʍ.{link_end}

source: Congratulations! You are now eligible to receive course credit for successfully completing your {platform_name} course! {link_start}Purchase credit now.{link_end}
rtl: ذخرلقشفعمشفهخرس! غخع شقث رخص ثمهلهزمث فخ قثذثهدث ذخعقسث ذقثيهف بخق سعذذثسسبعممغ ذخوحمثفهرل غخعق {platform_name} ذخعقسث! {link_start}حعقذاشسث ذقثيهف رخص.{link_end}Ȼønƃɹɐʇnlɐʇᴉøns! Ɏøn ɐɹǝ nøʍ ǝlᴉƃᴉblǝ ʇø ɹǝɔǝᴉʌǝ ɔønɹsǝ ɔɹǝdᴉʇ ɟøɹ snɔɔǝssɟnllʎ ɔøɯdlǝʇᴉnƃ ʎønɹ {platform_name} ɔønɹsǝ! {link_start}Ᵽnɹɔɥɐsǝ ɔɹǝdᴉʇ nøʍ.{link_end}

source: Course credit can help you get a jump start on your university degree, finish a degree already started, or fulfill requirements at a different academic institution.
rtl: ذخعقسث ذقثيهف ذشر اثمح غخع لثف ش تعوح سفشقف خر غخعق عرهدثقسهفغ يثلقثث, بهرهسا ش يثلقثث شمقثشيغ سفشقفثي, خق بعمبهمم قثضعهقثوثرفس شف ش يهببثقثرف شذشيثوهذ هرسفهفعفهخر.

source: There are 2 steps to getting course credit.
rtl: فاثقث شقث 2 سفثحس فخ لثففهرل ذخعقسث ذقثيهف.Ȼønɹsǝ ɔɹǝdᴉʇ ɔɐn ɥǝld ʎøn ƃǝʇ ɐ ɾnɯd sʇɐɹʇ øn ʎønɹ nnᴉʌǝɹsᴉʇʎ dǝƃɹǝǝ, ɟᴉnᴉsɥ ɐ dǝƃɹǝǝ ɐlɹǝɐdʎ sʇɐɹʇǝd, øɹ ɟnlɟᴉll ɹǝbnᴉɹǝɯǝnʇs ɐʇ ɐ dᴉɟɟǝɹǝnʇ ɐɔɐdǝɯᴉɔ ᴉnsʇᴉʇnʇᴉøn.

source: Purchase credit by going to your {link_start}{platform_name} dashboard{link_end} and clicking the {bold_start}Get Credit{bold_end} button below the course title.
rtl: حعقذاشسث ذقثيهف زغ لخهرل فخ غخعق {link_start}{platform_name} يشسازخشقي{link_end} شري ذمهذنهرل فاث {bold_start}لثف ذقثيهف{bold_end} زعففخر زثمخص فاث ذخعقسث فهفمث.Ᵽnɹɔɥɐsǝ ɔɹǝdᴉʇ bʎ ƃøᴉnƃ ʇø ʎønɹ {link_start}{platform_name} dɐsɥbøɐɹd{link_end} ɐnd ɔlᴉɔʞᴉnƃ ʇɥǝ {bold_start}Ǥǝʇ Ȼɹǝdᴉʇ{bold_end} bnʇʇøn bǝløʍ ʇɥǝ ɔønɹsǝ ʇᴉʇlǝ.

source: When your payment is complete, return to the dashboard and click the {bold_start}Request Credit{bold_end} button under the course title to request an official academic transcript at the institution that granted the credit.
rtl: صاثر غخعق حشغوثرف هس ذخوحمثفث, قثفعقر فخ فاث يشسازخشقي شري ذمهذن فاث {bold_start}قثضعثسف ذقثيهف{bold_end} زعففخر عريثق فاث ذخعقسث فهفمث فخ قثضعثسف شر خببهذهشم شذشيثوهذ فقشرسذقهحف شف فاث هرسفهفعفهخر فاشف لقشرفثي فاث ذقثيهف.Wɥǝn ʎønɹ dɐʎɯǝnʇ ᴉs ɔøɯdlǝʇǝ, ɹǝʇnɹn ʇø ʇɥǝ dɐsɥbøɐɹd ɐnd ɔlᴉɔʞ ʇɥǝ {bold_start}Ɍǝbnǝsʇ Ȼɹǝdᴉʇ{bold_end} bnʇʇøn nndǝɹ ʇɥǝ ɔønɹsǝ ʇᴉʇlǝ ʇø ɹǝbnǝsʇ ɐn øɟɟᴉɔᴉɐl ɐɔɐdǝɯᴉɔ ʇɹɐnsɔɹᴉdʇ ɐʇ ʇɥǝ ᴉnsʇᴉʇnʇᴉøn ʇɥɐʇ ƃɹɐnʇǝd ʇɥǝ ɔɹǝdᴉʇ.

source: We hope you enjoyed the course, and we hope to see you in future {platform_name} courses!
rtl: صث اخحث غخع ثرتخغثي فاث ذخعقسث, شري صث اخحث فخ سثث غخع هر بعفعقث {platform_name} ذخعقسثس!Wǝ ɥødǝ ʎøn ǝnɾøʎǝd ʇɥǝ ɔønɹsǝ, ɐnd ʍǝ ɥødǝ ʇø sǝǝ ʎøn ᴉn ɟnʇnɹǝ {platform_name} ɔønɹsǝs!

source: The {platform_name} Team
rtl: فاث {platform_name} فثشو

source: {link_start}Click here for more information on credit at {platform_name}{link_end}.
rtl: {link_start}ذمهذن اثقث بخق وخقث هربخقوشفهخر خر ذقثيهف شف {link_start}Ȼlᴉɔʞ ɥǝɹǝ ɟøɹ ɯøɹǝ ᴉnɟøɹɯɐʇᴉøn øn ɔɹǝdᴉʇ ɐʇ {platform_name}{link_end}.

source: Your grade and certificate will be ready after {date}.
rtl: غخعق لقشيث شري ذثقفهبهذشفث صهمم زث قثشيغ شبفثق {date}.

source: Congratulations! Your certificate is ready.
rtl: ذخرلقشفعمشفهخرس! غخعق ذثقفهبهذشفث هس قثشيغ.

source: Grade required for a {cert_name_short}:
rtl: لقشيث قثضعهقثي بخق ش {cert_name_short}:

source: Grade required to pass this course:
rtl: لقشيث قثضعهقثي فخ حشسس فاهس ذخعقسث:

source: Your verified {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}. If you would like a refund on your {cert_name_long}, please contact our billing address {billing_email}
rtl: غخعق دثقهبهثي {cert_name_long} هس زثهرل اثمي حثريهرل ذخربهقوشفهخر فاشف فاث هسسعشرذث خب غخعق {cert_name_short} هس هر ذخوحمهشرذث صهفا سفقهذف ع.س. ثوزشقلخثس خر هقشر, ذعزش, سغقهش شري سعيشر. هب غخع فاهرن خعق سغسفثو اشس وهسفشنثرمغ هيثرفهبهثي غخع شس زثهرل ذخررثذفثي صهفا خرث خب فاخسث ذخعرفقهثس, حمثشسث مثف عس نرخص زغ ذخرفشذفهرل {email}. هب غخع صخعمي مهنث ش قثبعري خر غخعق {cert_name_long}, حمثشسث ذخرفشذف خعق زهممهرل شييقثسس {billing_email}Ɏønɹ ʌǝɹᴉɟᴉǝd {cert_name_long} ᴉs bǝᴉnƃ ɥǝld dǝndᴉnƃ ɔønɟᴉɹɯɐʇᴉøn ʇɥɐʇ ʇɥǝ ᴉssnɐnɔǝ øɟ ʎønɹ {cert_name_short} ᴉs ᴉn ɔøɯdlᴉɐnɔǝ ʍᴉʇɥ sʇɹᴉɔʇ Ʉ.S. ǝɯbɐɹƃøǝs øn Ɨɹɐn, Ȼnbɐ, Sʎɹᴉɐ ɐnd Sndɐn. Ɨɟ ʎøn ʇɥᴉnʞ ønɹ sʎsʇǝɯ ɥɐs ɯᴉsʇɐʞǝnlʎ ᴉdǝnʇᴉɟᴉǝd ʎøn ɐs bǝᴉnƃ ɔønnǝɔʇǝd ʍᴉʇɥ ønǝ øɟ ʇɥøsǝ ɔønnʇɹᴉǝs, dlǝɐsǝ lǝʇ ns ʞnøʍ bʎ ɔønʇɐɔʇᴉnƃ {email}. Ɨɟ ʎøn ʍønld lᴉʞǝ ɐ ɹǝɟnnd øn ʎønɹ {cert_name_long}, dlǝɐsǝ ɔønʇɐɔʇ ønɹ bᴉllᴉnƃ ɐddɹǝss {billing_email}

source: Your {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}.
rtl: غخعق {cert_name_long} هس زثهرل اثمي حثريهرل ذخربهقوشفهخر فاشف فاث هسسعشرذث خب غخعق {cert_name_short} هس هر ذخوحمهشرذث صهفا سفقهذف ع.س. ثوزشقلخثس خر هقشر, ذعزش, سغقهش شري سعيشر. هب غخع فاهرن خعق سغسفثو اشس وهسفشنثرمغ هيثرفهبهثي غخع شس زثهرل ذخررثذفثي صهفا خرث خب فاخسث ذخعرفقهثس, حمثشسث مثف عس نرخص زغ ذخرفشذفهرل {email}.Ɏønɹ {cert_name_long} ᴉs bǝᴉnƃ ɥǝld dǝndᴉnƃ ɔønɟᴉɹɯɐʇᴉøn ʇɥɐʇ ʇɥǝ ᴉssnɐnɔǝ øɟ ʎønɹ {cert_name_short} ᴉs ᴉn ɔøɯdlᴉɐnɔǝ ʍᴉʇɥ sʇɹᴉɔʇ Ʉ.S. ǝɯbɐɹƃøǝs øn Ɨɹɐn, Ȼnbɐ, Sʎɹᴉɐ ɐnd Sndɐn. Ɨɟ ʎøn ʇɥᴉnʞ ønɹ sʎsʇǝɯ ɥɐs ɯᴉsʇɐʞǝnlʎ ᴉdǝnʇᴉɟᴉǝd ʎøn ɐs bǝᴉnƃ ɔønnǝɔʇǝd ʍᴉʇɥ ønǝ øɟ ʇɥøsǝ ɔønnʇɹᴉǝs, dlǝɐsǝ lǝʇ ns ʞnøʍ bʎ ɔønʇɐɔʇᴉnƃ {email}.

source: Your certificate was not issued because you do not have a current verified identity with {platform_name}.
rtl: غخعق ذثقفهبهذشفث صشس رخف هسسعثي زثذشعسث غخع يخ رخف اشدث ش ذعققثرف دثقهبهثي هيثرفهفغ صهفا {platform_name}.

source: Your {cert_name_short} is Generating
rtl: غخعق {cert_name_short} هس لثرثقشفهرل

source: This link will open the certificate web view
rtl: فاهس مهرن صهمم خحثر فاث ذثقفهبهذشفث صثز دهثص

source: View my {cert_name_short}
rtl: دهثص وغ {cert_name_short}

source: This link will open/download a PDF document
rtl: فاهس مهرن صهمم خحثر/يخصرمخشي ش حيب يخذعوثرف

source: Download my {cert_name_short}
rtl: يخصرمخشي وغ {cert_name_short}Ɏønɹ ɔǝɹʇᴉɟᴉɔɐʇǝ ʍɐs nøʇ ᴉssnǝd bǝɔɐnsǝ ʎøn dø nøʇ ɥɐʌǝ ɐ ɔnɹɹǝnʇ ʌǝɹᴉɟᴉǝd ᴉdǝnʇᴉʇʎ ʍᴉʇɥ {platform_name}.

source: This link will open/download a PDF document of your verified {cert_name_long}.
rtl: فاهس مهرن صهمم خحثر/يخصرمخشي ش حيب يخذعوثرف خب غخعق دثقهبهثي Ŧɥᴉs lᴉnʞ ʍᴉll ødǝn/døʍnløɐd ɐ ⱣĐF døɔnɯǝnʇ øɟ ʎønɹ ʌǝɹᴉɟᴉǝd {cert_name_long}.

source: Complete our course feedback survey
rtl: ذخوحمثفث خعق ذخعقسث بثثيزشذن سعقدثغ

source: Add Certificate to LinkedIn Profile
rtl: شيي ذثقفهبهذشفث فخ مهرنثيهر حقخبهمث

source: Share on LinkedIn
rtl: ساشقث خر مهرنثيهر

source: Since we did not have a valid set of verification photos from you when your {cert_name_long} was generated, we could not grant you a verified {cert_name_short}. An honor code {cert_name_short} has been granted instead.
rtl: سهرذث صث يهي رخف اشدث ش دشمهي سثف خب دثقهبهذشفهخر حاخفخس بقخو غخع صاثر غخعق {cert_name_long} صشس لثرثقشفثي, صث ذخعمي رخف لقشرف غخع ش دثقهبهثي {cert_name_short}. شر اخرخق ذخيث {cert_name_short} اشس زثثر لقشرفثي هرسفثشي.

source: You are not eligible for a certificate.
rtl: غخع شقث رخف ثمهلهزمث بخق ش ذثقفهبهذشفث.

source: This link will open the course progress page
rtl: فاهس مهرن صهمم خحثر فاث ذخعقسث حقخلقثسس حشلث

source: View grades
rtl: دهثص لقشيثس

source: Course details
rtl: ذخعقسث يثفشهمس

source: {course_number} {course_name} Home Page
rtl: {course_number} {course_name} اخوث حشلث

source: {course_number} {course_name} Cover Image
rtl: {course_number} {course_name} ذخدثق هوشلث

source: Enrolled as:
rtl: ثرقخممثي شس:

source: Coming Soon
rtl: ذخوهرل سخخر

source: Ended - {date}
rtl: ثريثي - {date}

source: Started - {date}
rtl: سفشقفثي - {date}

source: Starts - {date}
rtl: سفشقفس - {date}

source: for {course_display_name}
rtl: بخق {course_display_name}

source: You must select a session by {expiration_date} to access the course.
rtl: غخع وعسف سثمثذف ش سثسسهخر زغ {expiration_date} فخ شذذثسس فاث ذخعقسث.

source: You must select a session to access the course.
rtl: غخع وعسف سثمثذف ش سثسسهخر فخ شذذثسس فاث ذخعقسث.

source: Change or Leave Session
rtl: ذاشرلث خق مثشدث سثسسهخر

source: You can no longer change sessions.
rtl: غخع ذشر رخ مخرلثق ذاشرلث سثسسهخرس.

source: You can change sessions until {entitlement_expiration_date}.
rtl: غخع ذشر ذاشرلث سثسسهخرس عرفهم {entitlement_expiration_date}.

source: I'm taking {course_name} online with {facebook_brand}. Check it out!
rtl: ه'و فشنهرل {course_name} خرمهرث صهفا {facebook_brand}. ذاثذن هف خعف!

source: Share {course_name} on Facebook
rtl: ساشقث {course_name} خر بشذثزخخن

source: Share on Facebook
rtl: ساشقث خر بشذثزخخن

source: I'm taking {course_name} online with {twitter_brand}. Check it out!
rtl: ه'و فشنهرل {course_name} خرمهرث صهفا {twitter_brand}. ذاثذن هف خعف!

source: Share {course_name} on Twitter
rtl: ساشقث {course_name} خر فصهففثق

source: Course options for
rtl: ذخعقسث خحفهخرس بخق

source: You are not yet eligible for a certificate.
rtl: Ɏøn ɐɹǝ nøʇ ʎǝʇ ǝlᴉƃᴉblǝ ɟøɹ ɐ ɔǝɹʇᴉɟᴉɔɐʇǝ.

source: Available Actions
rtl: شدشهمشزمث شذفهخرس

source: You are enrolled by your institution and you should reach out to your institution to drop this course.
rtl: غخع شقث ثرقخممثي زغ غخعق هرسفهفعفهخر شري غخع ساخعمي قثشذا خعف فخ غخعق هرسفهفعفهخر فخ يقخح فاهس ذخعقسث.Ɏøn ɐɹǝ ǝnɹøllǝd bʎ ʎønɹ ᴉnsʇᴉʇnʇᴉøn ɐnd ʎøn sɥønld ɹǝɐɔɥ ønʇ ʇø ʎønɹ ᴉnsʇᴉʇnʇᴉøn ʇø dɹød ʇɥᴉs ɔønɹsǝ.

source: Email Settings
rtl: ثوشهم سثففهرلس

source: View Archived Course
rtl: دهثص شقذاهدثي ذخعقسث

source: Related Programs
rtl: قثمشفثي حقخلقشوس

source: To earn a certificate, you must verify your ID
rtl: فخ ثشقر ش ذثقفهبهذشفث, غخع وعسف دثقهبغ غخعق هي

source: You only have {days} day left to verify for this course.
rtl: غخع خرمغ اشدث {days} يشغ مثبف فخ دثقهبغ بخق فاهس ذخعقسث.

source: Almost there!
rtl: شموخسف فاثقث!

source: You still need to verify for this course.
rtl: غخع سفهمم رثثي فخ دثقهبغ بخق فاهس ذخعقسث.

source: Verify Now
rtl: دثقهبغ رخص

source: You have submitted your verification information.
rtl: غخع اشدث سعزوهففثي غخعق دثقهبهذشفهخر هربخقوشفهخر.

source: You will see a message on your dashboard when the verification process is complete (usually within 5-7 days).
rtl: غخع صهمم سثث ش وثسسشلث خر غخعق يشسازخشقي صاثر فاث دثقهبهذشفهخر حقخذثسس هس ذخوحمثفث (عسعشممغ صهفاهر 5-7 يشغس).

source: Your current verification will expire soon!
rtl: غخعق ذعققثرف دثقهبهذشفهخر صهمم ثطحهقث سخخر!

source: You have submitted your reverification information. You will see a message on your dashboard when the verification process is complete (usually within 5-7 days).
rtl: غخع اشدث سعزوهففثي غخعق قثدثقهبهذشفهخر هربخقوشفهخر. غخع صهمم سثث ش وثسسشلث خر غخعق يشسازخشقي صاثر فاث دثقهبهذشفهخر حقخذثسس هس ذخوحمثفث (عسعشممغ صهفاهر 5-7 يشغس).

source: You have successfully verified your ID with {platform_name}
rtl: غخع اشدث سعذذثسسبعممغ دثقهبهثي غخعق هي صهفا {platform_name}

source: Your current verification is effective until {date}.
rtl: غخعق ذعققثرف دثقهبهذشفهخر هس ثببثذفهدث عرفهم {date}.

source: Your current verification will expire soon.
rtl: غخعق ذعققثرف دثقهبهذشفهخر صهمم ثطحهقث سخخر.

source: Your current verification will expire in {days} days. {start_link}Re-verify your identity now{end_link} using a webcam and a government-issued photo ID.
rtl: غخعق ذعققثرف دثقهبهذشفهخر صهمم ثطحهقث هر {days} يشغس. {start_link}قث-دثقهبغ غخعق هيثرفهفغ رخص{end_link} عسهرل ش صثزذشو شري ش لخدثقروثرف-هسسعثي حاخفخ هي.

source: {start_bold}Get the most out of your course!{end_bold} Upgrade to get full access to the course material, unlock both graded and non-graded assignments, and earn a {link_start}verified certificate{link_end} to showcase on your resumé.
rtl: {start_bold}لثف فاث وخسف خعف خب غخعق ذخعقسث!{end_bold} عحلقشيث فخ لثف بعمم شذذثسس فخ فاث ذخعقسث وشفثقهشم, عرمخذن زخفا لقشيثي شري رخر-لقشيثي شسسهلروثرفس, شري ثشقر ش {link_start}دثقهبهثي ذثقفهبهذشفث{link_end} فخ ساخصذشسث خر غخعق قثسعوé.

source: Upgrade
rtl: عحلقشيث{start_bold}Ǥǝʇ ʇɥǝ ɯøsʇ ønʇ øɟ ʎønɹ ɔønɹsǝ!{end_bold} Ʉdƃɹɐdǝ ʇø ƃǝʇ ɟnll ɐɔɔǝss ʇø ʇɥǝ ɔønɹsǝ ɯɐʇǝɹᴉɐl, nnløɔʞ bøʇɥ ƃɹɐdǝd ɐnd nøn-ƃɹɐdǝd ɐssᴉƃnɯǝnʇs, ɐnd ǝɐɹn ɐ {link_start}ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ{link_end} ʇø sɥøʍɔɐsǝ øn ʎønɹ ɹǝsnɯé.

source: {start_bold}Get the most out of your course!{end_bold} Upgrade to earn a {link_start}verified certificate{link_end} to showcase on your resumé.
rtl: {start_bold}Ǥǝʇ ʇɥǝ ɯøsʇ ønʇ øɟ ʎønɹ ɔønɹsǝ!{end_bold} Ʉdƃɹɐdǝ ʇø ǝɐɹn ɐ {link_start}ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ{link_end} ʇø sɥøʍɔɐsǝ øn ʎønɹ ɹǝsnɯé.

source: You have completed this course and are eligible to purchase course credit. Select {strong_start}Get Credit{strong_end} to get started.
rtl: غخع اشدث ذخوحمثفثي فاهس ذخعقسث شري شقث ثمهلهزمث فخ حعقذاشسث ذخعقسث ذقثيهف. سثمثذف {strong_start}لثف ذقثيهف{strong_end} فخ لثف سفشقفثي.

source: You are now eligible for credit from {provider}. Congratulations!
rtl: غخع شقث رخص ثمهلهزمث بخق ذقثيهف بقخو {provider}. ذخرلقشفعمشفهخرس!

source: Get Credit
rtl: لثف ذقثيهفɎøn ɥɐʌǝ ɔøɯdlǝʇǝd ʇɥᴉs ɔønɹsǝ ɐnd ɐɹǝ ǝlᴉƃᴉblǝ ʇø dnɹɔɥɐsǝ ɔønɹsǝ ɔɹǝdᴉʇ. Sǝlǝɔʇ {strong_start}Ǥǝʇ Ȼɹǝdᴉʇ{strong_end} ʇø ƃǝʇ sʇɐɹʇǝd.

source: Thank you for your payment. To receive course credit, you must now request credit at the {link_to_provider_site} website. Select {start_bold}Request Credit{end_bold} to get started.
rtl: فاشرن غخع بخق غخعق حشغوثرف. فخ قثذثهدث ذخعقسث ذقثيهف, غخع وعسف رخص قثضعثسف ذقثيهف شف فاث {link_to_provider_site} صثزسهفث. سثمثذف {start_bold}قثضعثسف ذقثيهف{end_bold} فخ لثف سفشقفثي.

source: Request Credit
rtl: قثضعثسف ذقثيهفŦɥɐnʞ ʎøn ɟøɹ ʎønɹ dɐʎɯǝnʇ. Ŧø ɹǝɔǝᴉʌǝ ɔønɹsǝ ɔɹǝdᴉʇ, ʎøn ɯnsʇ nøʍ ɹǝbnǝsʇ ɔɹǝdᴉʇ ɐʇ ʇɥǝ {link_to_provider_site} ʍǝbsᴉʇǝ. Sǝlǝɔʇ {start_bold}Ɍǝbnǝsʇ Ȼɹǝdᴉʇ{end_bold} ʇø ƃǝʇ sʇɐɹʇǝd.

source: {provider_name} has received your course credit request. We will update you when credit processing is complete.
rtl: {provider_name} اشس قثذثهدثي غخعق ذخعقسث ذقثيهف قثضعثسف. صث صهمم عحيشفث غخع صاثر ذقثيهف حقخذثسسهرل هس ذخوحمثفث.

source: View Details
rtl: دهثص يثفشهمس{provider_name} ɥɐs ɹǝɔǝᴉʌǝd ʎønɹ ɔønɹsǝ ɔɹǝdᴉʇ ɹǝbnǝsʇ. Wǝ ʍᴉll nddɐʇǝ ʎøn ʍɥǝn ɔɹǝdᴉʇ dɹøɔǝssᴉnƃ ᴉs ɔøɯdlǝʇǝ.

source: {start_bold}Congratulations!{end_bold} {provider_name} has approved your request for course credit. To see your course credit, visit the {link_to_provider_site} website.
rtl: {start_bold}ذخرلقشفعمشفهخرس!{end_bold} {provider_name} اشس شححقخدثي غخعق قثضعثسف بخق ذخعقسث ذقثيهف. فخ سثث غخعق ذخعقسث ذقثيهف, دهسهف فاث {link_to_provider_site} صثزسهفث.

source: View Credit
rtl: دهثص ذقثيهف{start_bold}Ȼønƃɹɐʇnlɐʇᴉøns!{end_bold} {provider_name} ɥɐs ɐddɹøʌǝd ʎønɹ ɹǝbnǝsʇ ɟøɹ ɔønɹsǝ ɔɹǝdᴉʇ. Ŧø sǝǝ ʎønɹ ɔønɹsǝ ɔɹǝdᴉʇ, ʌᴉsᴉʇ ʇɥǝ {link_to_provider_site} ʍǝbsᴉʇǝ.

source: {provider_name} did not approve your request for course credit. For more information, contact {link_to_provider_site} directly.
rtl: {provider_name} يهي رخف شححقخدث غخعق قثضعثسف بخق ذخعقسث ذقثيهف. بخق وخقث هربخقوشفهخر, ذخرفشذف {link_to_provider_site} يهقثذفمغ.{provider_name} dᴉd nøʇ ɐddɹøʌǝ ʎønɹ ɹǝbnǝsʇ ɟøɹ ɔønɹsǝ ɔɹǝdᴉʇ. Føɹ ɯøɹǝ ᴉnɟøɹɯɐʇᴉøn, ɔønʇɐɔʇ {link_to_provider_site} dᴉɹǝɔʇlʎ.

source: An error occurred with this transaction. For help, contact {support_email}.
rtl: شر ثققخق خذذعققثي صهفا فاهس فقشرسشذفهخر. بخق اثمح, ذخرفشذف {support_email}.

source: Course options for {courseName}
rtl: ذخعقسث خحفهخرس بخق {courseName}

source: Consent to share your data
rtl: ذخرسثرف فخ ساشقث غخعق يشفشȺn ǝɹɹøɹ øɔɔnɹɹǝd ʍᴉʇɥ ʇɥᴉs ʇɹɐnsɐɔʇᴉøn. Føɹ ɥǝld, ɔønʇɐɔʇ {support_email}.

source: To access this course, you must first consent to share your learning achievements with {enterprise_customer_name}.
rtl: فخ شذذثسس فاهس ذخعقسث, غخع وعسف بهقسف ذخرسثرف فخ ساشقث غخعق مثشقرهرل شذاهثدثوثرفس صهفا {enterprise_customer_name}.

source: View Consent
rtl: دهثص ذخرسثرف

source: Current ID Verification Status: Approved
rtl: ذعققثرف هي دثقهبهذشفهخر سفشفعس: شححقخدثي

source: Your {platform_name} ID verification has been approved. Your ID verification is effective for two years after submission.
rtl: غخعق {platform_name} هي دثقهبهذشفهخر اشس زثثر شححقخدثي. غخعق هي دثقهبهذشفهخر هس ثببثذفهدث بخق فصخ غثشقس شبفثق سعزوهسسهخر.

source: Your photo ID verification expires on {verification_expiry}. Please be aware photo verification can take up to three days once initiated and you will not be able to earn a certificate or take a proctored exam until approved.
rtl: غخعق حاخفخ هي دثقهبهذشفهخر ثطحهقثس خر {verification_expiry}. حمثشسث زث شصشقث حاخفخ دثقهبهذشفهخر ذشر فشنث عح فخ فاقثث يشغس خرذث هرهفهشفثي شري غخع صهمم رخف زث شزمث فخ ثشقر ش ذثقفهبهذشفث خق فشنث ش حقخذفخقثي ثطشو عرفهم شححقخدثي.

source: Resubmit Verification
rtl: قثسعزوهف دثقهبهذشفهخر
