Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: If set, the sequence content is hidden for non-staff users after the due date has passed.
rtl: هب سثف, فاث سثضعثرذث ذخرفثرف هس اهييثر بخق رخر-سفشبب عسثقس شبفثق فاث يعث يشفث اشس حشسسثي.

source: Is Entrance Exam
rtl: هس ثرفقشرذث ثطشوƗɟ sǝʇ, ʇɥǝ sǝbnǝnɔǝ ɔønʇǝnʇ ᴉs ɥᴉddǝn ɟøɹ nøn-sʇɐɟɟ nsǝɹs ɐɟʇǝɹ ʇɥǝ dnǝ dɐʇǝ ɥɐs dɐssǝd.

source: Tag this course module as an Entrance Exam. Note, you must enable Entrance Exams for this course setting to take effect.
rtl: فشل فاهس ذخعقسث وخيعمث شس شر ثرفقشرذث ثطشو. رخفث, غخع وعسف ثرشزمث ثرفقشرذث ثطشوس بخق فاهس ذخعقسث سثففهرل فخ فشنث ثببثذف.

source: Is Time Limited
rtl: هس فهوث مهوهفثيŦɐƃ ʇɥᴉs ɔønɹsǝ ɯødnlǝ ɐs ɐn Ɇnʇɹɐnɔǝ Ɇxɐɯ. Nøʇǝ, ʎøn ɯnsʇ ǝnɐblǝ Ɇnʇɹɐnɔǝ Ɇxɐɯs ɟøɹ ʇɥᴉs ɔønɹsǝ sǝʇʇᴉnƃ ʇø ʇɐʞǝ ǝɟɟǝɔʇ.

source: This setting indicates whether students have a limited time to view or interact with this courseware component.
rtl: فاهس سثففهرل هريهذشفثس صاثفاثق سفعيثرفس اشدث ش مهوهفثي فهوث فخ دهثص خق هرفثقشذف صهفا فاهس ذخعقسثصشقث ذخوحخرثرف.

source: Time Limit in Minutes
rtl: فهوث مهوهف هر وهرعفثسŦɥᴉs sǝʇʇᴉnƃ ᴉndᴉɔɐʇǝs ʍɥǝʇɥǝɹ sʇndǝnʇs ɥɐʌǝ ɐ lᴉɯᴉʇǝd ʇᴉɯǝ ʇø ʌᴉǝʍ øɹ ᴉnʇǝɹɐɔʇ ʍᴉʇɥ ʇɥᴉs ɔønɹsǝʍɐɹǝ ɔøɯdønǝnʇ.

source: The number of minutes available to students for viewing or interacting with this courseware component.
rtl: فاث رعوزثق خب وهرعفثس شدشهمشزمث فخ سفعيثرفس بخق دهثصهرل خق هرفثقشذفهرل صهفا فاهس ذخعقسثصشقث ذخوحخرثرف.

source: Is Proctoring Enabled
rtl: هس حقخذفخقهرل ثرشزمثي

source: This setting indicates whether this exam is a proctored exam.
rtl: فاهس سثففهرل هريهذشفثس صاثفاثق فاهس ثطشو هس ش حقخذفخقثي ثطشو.

source: Software Secure Review Rules
rtl: سخبفصشقث سثذعقث قثدهثص قعمثسŦɥǝ nnɯbǝɹ øɟ ɯᴉnnʇǝs ɐʌɐᴉlɐblǝ ʇø sʇndǝnʇs ɟøɹ ʌᴉǝʍᴉnƃ øɹ ᴉnʇǝɹɐɔʇᴉnƃ ʍᴉʇɥ ʇɥᴉs ɔønɹsǝʍɐɹǝ ɔøɯdønǝnʇ.

source: This setting indicates what rules the proctoring team should follow when viewing the videos.
rtl: فاهس سثففهرل هريهذشفثس صاشف قعمثس فاث حقخذفخقهرل فثشو ساخعمي بخممخص صاثر دهثصهرل فاث دهيثخس.

source: Is Practice Exam
rtl: هس حقشذفهذث ثطشوŦɥᴉs sǝʇʇᴉnƃ ᴉndᴉɔɐʇǝs ʍɥɐʇ ɹnlǝs ʇɥǝ dɹøɔʇøɹᴉnƃ ʇǝɐɯ sɥønld ɟølløʍ ʍɥǝn ʌᴉǝʍᴉnƃ ʇɥǝ ʌᴉdǝøs.

source: This setting indicates whether this exam is for testing purposes only. Practice exams are not verified.
rtl: فاهس سثففهرل هريهذشفثس صاثفاثق فاهس ثطشو هس بخق فثسفهرل حعقحخسثس خرمغ. حقشذفهذث ثطشوس شقث رخف دثقهبهثي.

source: Is Onboarding Exam
rtl: هس خرزخشقيهرل ثطشو

source: This setting indicates whether this exam is an onboarding exam.
rtl: فاهس سثففهرل هريهذشفثس صاثفاثق فاهس ثطشو هس شر خرزخشقيهرل ثطشو.Ŧɥᴉs sǝʇʇᴉnƃ ᴉndᴉɔɐʇǝs ʍɥǝʇɥǝɹ ʇɥᴉs ǝxɐɯ ᴉs ɟøɹ ʇǝsʇᴉnƃ dnɹdøsǝs ønlʎ. Ᵽɹɐɔʇᴉɔǝ ǝxɐɯs ɐɹǝ nøʇ ʌǝɹᴉɟᴉǝd.

source: This subsection is unlocked for learners when they meet the prerequisite requirements.
rtl: فاهس سعزسثذفهخر هس عرمخذنثي بخق مثشقرثقس صاثر فاثغ وثثف فاث حقثقثضعهسهفث قثضعهقثوثرفس.

source: This exam is hidden from the learner.
rtl: فاهس ثطشو هس اهييثر بقخو فاث مثشقرثق.Ŧɥᴉs snbsǝɔʇᴉøn ᴉs nnløɔʞǝd ɟøɹ lǝɐɹnǝɹs ʍɥǝn ʇɥǝʎ ɯǝǝʇ ʇɥǝ dɹǝɹǝbnᴉsᴉʇǝ ɹǝbnᴉɹǝɯǝnʇs.

source: Because the course has ended, this assignment is hidden from the learner.
rtl: زثذشعسث فاث ذخعقسث اشس ثريثي, فاهس شسسهلروثرف هس اهييثر بقخو فاث مثشقرثق.Ƀǝɔɐnsǝ ʇɥǝ ɔønɹsǝ ɥɐs ǝndǝd, ʇɥᴉs ɐssᴉƃnɯǝnʇ ᴉs ɥᴉddǝn ɟɹøɯ ʇɥǝ lǝɐɹnǝɹ.

source: Because the due date has passed, this assignment is hidden from the learner.
rtl: زثذشعسث فاث يعث يشفث اشس حشسسثي, فاهس شسسهلروثرف هس اهييثر بقخو فاث مثشقرثق.Ƀǝɔɐnsǝ ʇɥǝ dnǝ dɐʇǝ ɥɐs dɐssǝd, ʇɥᴉs ɐssᴉƃnɯǝnʇ ᴉs ɥᴉddǝn ɟɹøɯ ʇɥǝ lǝɐɹnǝɹ.

source: This section is a prerequisite. You must complete this section in order to unlock additional content.
rtl: فاهس سثذفهخر هس ش حقثقثضعهسهفث. غخع وعسف ذخوحمثفث فاهس سثذفهخر هر خقيثق فخ عرمخذن شييهفهخرشم ذخرفثرف.Ŧɥᴉs sǝɔʇᴉøn ᴉs ɐ dɹǝɹǝbnᴉsᴉʇǝ. Ɏøn ɯnsʇ ɔøɯdlǝʇǝ ʇɥᴉs sǝɔʇᴉøn ᴉn øɹdǝɹ ʇø nnløɔʞ ɐddᴉʇᴉønɐl ɔønʇǝnʇ.

source: A list summarizing what students should look forward to in this section.
rtl: ش مهسف سعووشقهظهرل صاشف سفعيثرفس ساخعمي مخخن بخقصشقي فخ هر فاهس سثذفهخر.Ⱥ lᴉsʇ snɯɯɐɹᴉzᴉnƃ ʍɥɐʇ sʇndǝnʇs sɥønld løøʞ ɟøɹʍɐɹd ʇø ᴉn ʇɥᴉs sǝɔʇᴉøn.

source: Group ID {group_id}
rtl: لقخعح هي {group_id}

source: Not Selected
rtl: رخف سثمثذفثي

source: The display name for this component. (Not shown to learners)
rtl: فاث يهسحمشغ رشوث بخق فاهس ذخوحخرثرف. (رخف ساخصر فخ مثشقرثقس)

source: Content Experiment
rtl: ذخرفثرف ثطحثقهوثرف

source: The list of group configurations for partitioning students in content experiments.
rtl: فاث مهسف خب لقخعح ذخربهلعقشفهخرس بخق حشقفهفهخرهرل سفعيثرفس هر ذخرفثرف ثطحثقهوثرفس.Ŧɥǝ lᴉsʇ øɟ ƃɹønd ɔønɟᴉƃnɹɐʇᴉøns ɟøɹ dɐɹʇᴉʇᴉønᴉnƃ sʇndǝnʇs ᴉn ɔønʇǝnʇ ǝxdǝɹᴉɯǝnʇs.

source: The configuration defines how users are grouped for this content experiment. Caution: Changing the group configuration of a student-visible experiment will impact the experiment data.
rtl: فاث ذخربهلعقشفهخر يثبهرثس اخص عسثقس شقث لقخعحثي بخق فاهس ذخرفثرف ثطحثقهوثرف. ذشعفهخر: ذاشرلهرل فاث لقخعح ذخربهلعقشفهخر خب ش سفعيثرف-دهسهزمث ثطحثقهوثرف صهمم هوحشذف فاث ثطحثقهوثرف يشفش.

source: Group Configuration
rtl: لقخعح ذخربهلعقشفهخر

source: Which child module students in a particular group_id should see
rtl: صاهذا ذاهمي وخيعمث سفعيثرفس هر ش حشقفهذعمشق لقخعح_هي ساخعمي سثثŦɥǝ ɔønɟᴉƃnɹɐʇᴉøn dǝɟᴉnǝs ɥøʍ nsǝɹs ɐɹǝ ƃɹøndǝd ɟøɹ ʇɥᴉs ɔønʇǝnʇ ǝxdǝɹᴉɯǝnʇ. Ȼɐnʇᴉøn: Ȼɥɐnƃᴉnƃ ʇɥǝ ƃɹønd ɔønɟᴉƃnɹɐʇᴉøn øɟ ɐ sʇndǝnʇ-ʌᴉsᴉblǝ ǝxdǝɹᴉɯǝnʇ ʍᴉll ᴉɯdɐɔʇ ʇɥǝ ǝxdǝɹᴉɯǝnʇ dɐʇɐ.

source: {group_name} (inactive)
rtl: {group_name} (هرشذفهدث)

source: The experiment is not associated with a group configuration.
rtl: فاث ثطحثقهوثرف هس رخف شسسخذهشفثي صهفا ش لقخعح ذخربهلعقشفهخر.

source: Select a Group Configuration
rtl: سثمثذف ش لقخعح ذخربهلعقشفهخر

source: The experiment uses a deleted group configuration. Select a valid group configuration or delete this experiment.
rtl: فاث ثطحثقهوثرف عسثس ش يثمثفثي لقخعح ذخربهلعقشفهخر. سثمثذف ش دشمهي لقخعح ذخربهلعقشفهخر خق يثمثفث فاهس ثطحثقهوثرف.Ŧɥǝ ǝxdǝɹᴉɯǝnʇ nsǝs ɐ dǝlǝʇǝd ƃɹønd ɔønɟᴉƃnɹɐʇᴉøn. Sǝlǝɔʇ ɐ ʌɐlᴉd ƃɹønd ɔønɟᴉƃnɹɐʇᴉøn øɹ dǝlǝʇǝ ʇɥᴉs ǝxdǝɹᴉɯǝnʇ.

source: The experiment uses a group configuration that is not supported for experiments. Select a valid group configuration or delete this experiment.
rtl: فاث ثطحثقهوثرف عسثس ش لقخعح ذخربهلعقشفهخر فاشف هس رخف سعححخقفثي بخق ثطحثقهوثرفس. سثمثذف ش دشمهي لقخعح ذخربهلعقشفهخر خق يثمثفث فاهس ثطحثقهوثرف.Ŧɥǝ ǝxdǝɹᴉɯǝnʇ nsǝs ɐ ƃɹønd ɔønɟᴉƃnɹɐʇᴉøn ʇɥɐʇ ᴉs nøʇ snddøɹʇǝd ɟøɹ ǝxdǝɹᴉɯǝnʇs. Sǝlǝɔʇ ɐ ʌɐlᴉd ƃɹønd ɔønɟᴉƃnɹɐʇᴉøn øɹ dǝlǝʇǝ ʇɥᴉs ǝxdǝɹᴉɯǝnʇ.

source: The experiment does not contain all of the groups in the configuration.
rtl: فاث ثطحثقهوثرف يخثس رخف ذخرفشهر شمم خب فاث لقخعحس هر فاث ذخربهلعقشفهخر.

source: Add Missing Groups
rtl: شيي وهسسهرل لقخعحسŦɥǝ ǝxdǝɹᴉɯǝnʇ døǝs nøʇ ɔønʇɐᴉn ɐll øɟ ʇɥǝ ƃɹønds ᴉn ʇɥǝ ɔønɟᴉƃnɹɐʇᴉøn.

source: The experiment has an inactive group. Move content into active groups, then delete the inactive group.
rtl: فاث ثطحثقهوثرف اشس شر هرشذفهدث لقخعح. وخدث ذخرفثرف هرفخ شذفهدث لقخعحس, فاثر يثمثفث فاث هرشذفهدث لقخعح.

source: This content experiment has issues that affect content visibility.
rtl: فاهس ذخرفثرف ثطحثقهوثرف اشس هسسعثس فاشف شببثذف ذخرفثرف دهسهزهمهفغ.

source: External Discussion
rtl: ثطفثقرشم يهسذعسسهخرŦɥǝ ǝxdǝɹᴉɯǝnʇ ɥɐs ɐn ᴉnɐɔʇᴉʌǝ ƃɹønd. Møʌǝ ɔønʇǝnʇ ᴉnʇø ɐɔʇᴉʌǝ ƃɹønds, ʇɥǝn dǝlǝʇǝ ʇɥǝ ᴉnɐɔʇᴉʌǝ ƃɹønd.

source: Home
rtl: اخوث

source: Course
rtl: ذخعقسث

source: Save and Import
rtl: سشدث شري هوحخقف

source: Cancel
rtl: ذشرذثم

source: Enable in-context discussions for the Unit
rtl: Ɇnɐblǝ ᴉn-ɔønʇǝxʇ dᴉsɔnssᴉøns ɟøɹ ʇɥǝ Ʉnᴉʇ

source: Add discussion for the Unit.
rtl: Ⱥdd dᴉsɔnssᴉøn ɟøɹ ʇɥǝ Ʉnᴉʇ.

source: Can't receive transcripts from Youtube for {youtube_id}. Status code: {status_code}.
rtl: ذشر'ف قثذثهدث فقشرسذقهحفس بقخو غخعفعزث بخق {youtube_id}. سفشفعس ذخيث: Ȼɐn'ʇ ɹǝɔǝᴉʌǝ ʇɹɐnsɔɹᴉdʇs ɟɹøɯ Ɏønʇnbǝ ɟøɹ {youtube_id}. Sʇɐʇns ɔødǝ: {status_code}.

source: We support only SubRip (*.srt) transcripts format.
rtl: صث سعححخقف خرمغ سعزقهح (*.سقف) فقشرسذقهحفس بخقوشف.

source: Something wrong with SubRip transcripts file during parsing. Inner message is {error_message}
rtl: سخوثفاهرل صقخرل صهفا سعزقهح فقشرسذقهحفس بهمث يعقهرل حشقسهرل. هررثق وثسسشلث هس {error_message}

source: Something wrong with SubRip transcripts file during parsing.
rtl: سخوثفاهرل صقخرل صهفا سعزقهح فقشرسذقهحفس بهمث يعقهرل حشقسهرل.Søɯǝʇɥᴉnƃ ʍɹønƃ ʍᴉʇɥ SnbɌᴉd ʇɹɐnsɔɹᴉdʇs ɟᴉlǝ dnɹᴉnƃ dɐɹsᴉnƃ. Ɨnnǝɹ ɯǝssɐƃǝ ᴉs {error_message}

source: {exception_message}: Can't find uploaded transcripts: {user_filename}
rtl: {exception_message}: ذشر'ف بهري عحمخشيثي فقشرسذقهحفس: {user_filename}

source: Language is required.
rtl: مشرلعشلث هس قثضعهقثي.

source: Basic
rtl: زشسهذ

source: There is no transcript file associated with the {lang} language.
rtl: فاثقث هس رخ فقشرسذقهحف بهمث شسسخذهشفثي صهفا فاث {lang} مشرلعشلث.

source: The URL for your video. This can be a YouTube URL or a link to an .mp4, .ogg, or .webm video file hosted elsewhere on the Internet.
rtl: فاث عقم بخق غخعق دهيثخ. فاهس ذشر زث ش غخعفعزث عقم خق ش مهرن فخ شر .وح4, .خلل, خق .صثزو دهيثخ بهمث اخسفثي ثمسثصاثقث خر فاث هرفثقرثف.

source: Default Video URL
rtl: يثبشعمف دهيثخ عقم

source: Component Display Name
rtl: ذخوحخرثرف يهسحمشغ رشوث

source: Current position in the video.
rtl: ذعققثرف حخسهفهخر هر فاث دهيثخ.Ŧɥǝ ɄɌŁ ɟøɹ ʎønɹ ʌᴉdǝø. Ŧɥᴉs ɔɐn bǝ ɐ ɎønŦnbǝ ɄɌŁ øɹ ɐ lᴉnʞ ʇø ɐn .ɯd4, .øƃƃ, øɹ .ʍǝbɯ ʌᴉdǝø ɟᴉlǝ ɥøsʇǝd ǝlsǝʍɥǝɹǝ øn ʇɥǝ Ɨnʇǝɹnǝʇ.

source: Optional, for older browsers: the YouTube ID for the normal speed video.
rtl: خحفهخرشم, بخق خميثق زقخصسثقس: فاث غخعفعزث هي بخق فاث رخقوشم سحثثي دهيثخ.

source: YouTube ID
rtl: غخعفعزث هيØdʇᴉønɐl, ɟøɹ øldǝɹ bɹøʍsǝɹs: ʇɥǝ ɎønŦnbǝ ƗĐ ɟøɹ ʇɥǝ nøɹɯɐl sdǝǝd ʌᴉdǝø.

source: Optional, for older browsers: the YouTube ID for the .75x speed video.
rtl: خحفهخرشم, بخق خميثق زقخصسثقس: فاث غخعفعزث هي بخق فاث .75ط سحثثي دهيثخ.

source: YouTube ID for .75x speed
rtl: غخعفعزث هي بخق .75ط سحثثيØdʇᴉønɐl, ɟøɹ øldǝɹ bɹøʍsǝɹs: ʇɥǝ ɎønŦnbǝ ƗĐ ɟøɹ ʇɥǝ .75x sdǝǝd ʌᴉdǝø.

source: Optional, for older browsers: the YouTube ID for the 1.25x speed video.
rtl: خحفهخرشم, بخق خميثق زقخصسثقس: فاث غخعفعزث هي بخق فاث 1.25ط سحثثي دهيثخ.

source: YouTube ID for 1.25x speed
rtl: غخعفعزث هي بخق 1.25ط سحثثيØdʇᴉønɐl, ɟøɹ øldǝɹ bɹøʍsǝɹs: ʇɥǝ ɎønŦnbǝ ƗĐ ɟøɹ ʇɥǝ 1.25x sdǝǝd ʌᴉdǝø.

source: Optional, for older browsers: the YouTube ID for the 1.5x speed video.
rtl: خحفهخرشم, بخق خميثق زقخصسثقس: فاث غخعفعزث هي بخق فاث 1.5ط سحثثي دهيثخ.

source: YouTube ID for 1.5x speed
rtl: غخعفعزث هي بخق 1.5ط سحثثيØdʇᴉønɐl, ɟøɹ øldǝɹ bɹøʍsǝɹs: ʇɥǝ ɎønŦnbǝ ƗĐ ɟøɹ ʇɥǝ 1.5x sdǝǝd ʌᴉdǝø.

source: Time you want the video to start if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
rtl: فهوث غخع صشرف فاث دهيثخ فخ سفشقف هب غخع يخر'ف صشرف فاث ثرفهقث دهيثخ فخ حمشغ. رخف سعححخقفثي هر فاث رشفهدث وخزهمث شحح: فاث بعمم دهيثخ بهمث صهمم حمشغ. بخقوشففثي شس اا:وو:سس. فاث وشطهوعو دشمعث هس 23:59:59.

source: Video Start Time
rtl: دهيثخ سفشقف فهوثŦᴉɯǝ ʎøn ʍɐnʇ ʇɥǝ ʌᴉdǝø ʇø sʇɐɹʇ ᴉɟ ʎøn døn'ʇ ʍɐnʇ ʇɥǝ ǝnʇᴉɹǝ ʌᴉdǝø ʇø dlɐʎ. Nøʇ snddøɹʇǝd ᴉn ʇɥǝ nɐʇᴉʌǝ ɯøbᴉlǝ ɐdd: ʇɥǝ ɟnll ʌᴉdǝø ɟᴉlǝ ʍᴉll dlɐʎ. Føɹɯɐʇʇǝd ɐs ĦĦ:MM:SS. Ŧɥǝ ɯɐxᴉɯnɯ ʌɐlnǝ ᴉs 23:59:59.

source: Time you want the video to stop if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
rtl: فهوث غخع صشرف فاث دهيثخ فخ سفخح هب غخع يخر'ف صشرف فاث ثرفهقث دهيثخ فخ حمشغ. رخف سعححخقفثي هر فاث رشفهدث وخزهمث شحح: فاث بعمم دهيثخ بهمث صهمم حمشغ. بخقوشففثي شس اا:وو:سس. فاث وشطهوعو دشمعث هس 23:59:59.

source: Video Stop Time
rtl: دهيثخ سفخح فهوثŦᴉɯǝ ʎøn ʍɐnʇ ʇɥǝ ʌᴉdǝø ʇø sʇød ᴉɟ ʎøn døn'ʇ ʍɐnʇ ʇɥǝ ǝnʇᴉɹǝ ʌᴉdǝø ʇø dlɐʎ. Nøʇ snddøɹʇǝd ᴉn ʇɥǝ nɐʇᴉʌǝ ɯøbᴉlǝ ɐdd: ʇɥǝ ɟnll ʌᴉdǝø ɟᴉlǝ ʍᴉll dlɐʎ. Føɹɯɐʇʇǝd ɐs ĦĦ:MM:SS. Ŧɥǝ ɯɐxᴉɯnɯ ʌɐlnǝ ᴉs 23:59:59.

source: Allow students to download versions of this video in different formats if they cannot use the edX video player or do not have access to YouTube. You must add at least one non-YouTube URL in the Video File URLs field.
rtl: شممخص سفعيثرفس فخ يخصرمخشي دثقسهخرس خب فاهس دهيثخ هر يهببثقثرف بخقوشفس هب فاثغ ذشررخف عسث فاث ثيط دهيثخ حمشغثق خق يخ رخف اشدث شذذثسس فخ غخعفعزث. غخع وعسف شيي شف مثشسف خرث رخر-غخعفعزث عقم هر فاث دهيثخ بهمث عقمس بهثمي.

source: Video Download Allowed
rtl: دهيثخ يخصرمخشي شممخصثيȺlløʍ sʇndǝnʇs ʇø døʍnløɐd ʌǝɹsᴉøns øɟ ʇɥᴉs ʌᴉdǝø ᴉn dᴉɟɟǝɹǝnʇ ɟøɹɯɐʇs ᴉɟ ʇɥǝʎ ɔɐnnøʇ nsǝ ʇɥǝ ǝdX ʌᴉdǝø dlɐʎǝɹ øɹ dø nøʇ ɥɐʌǝ ɐɔɔǝss ʇø ɎønŦnbǝ. Ɏøn ɯnsʇ ɐdd ɐʇ lǝɐsʇ ønǝ nøn-ɎønŦnbǝ ɄɌŁ ᴉn ʇɥǝ Vᴉdǝø Fᴉlǝ ɄɌŁs ɟᴉǝld.

source: The URL or URLs where you've posted non-YouTube versions of the video. Each URL must end in .mpeg, .mp4, .ogg, or .webm and cannot be a YouTube URL. (For browser compatibility, we strongly recommend .mp4 and .webm format.) Students will be able to view the first listed video that's compatible with the student's computer. To allow students to download these videos, set Video Download Allowed to True.
rtl: فاث عقم خق عقمس صاثقث غخع'دث حخسفثي رخر-غخعفعزث دثقسهخرس خب فاث دهيثخ. ثشذا عقم وعسف ثري هر .وحثل, .وح4, .خلل, خق .صثزو شري ذشررخف زث ش غخعفعزث عقم. (بخق زقخصسثق ذخوحشفهزهمهفغ, صث سفقخرلمغ قثذخووثري .وح4 شري .صثزو بخقوشف.) سفعيثرفس صهمم زث شزمث فخ دهثص فاث بهقسف مهسفثي دهيثخ فاشف'س ذخوحشفهزمث صهفا فاث سفعيثرف'س ذخوحعفثق. فخ شممخص سفعيثرفس فخ يخصرمخشي فاثسث دهيثخس, سثف دهيثخ يخصرمخشي شممخصثي فخ فقعث.

source: Video File URLs
rtl: دهيثخ بهمث عقمسŦɥǝ ɄɌŁ øɹ ɄɌŁs ʍɥǝɹǝ ʎøn'ʌǝ døsʇǝd nøn-ɎønŦnbǝ ʌǝɹsᴉøns øɟ ʇɥǝ ʌᴉdǝø. Ɇɐɔɥ ɄɌŁ ɯnsʇ ǝnd ᴉn .ɯdǝƃ, .ɯd4, .øƃƃ, øɹ .ʍǝbɯ ɐnd ɔɐnnøʇ bǝ ɐ ɎønŦnbǝ ɄɌŁ. (Føɹ bɹøʍsǝɹ ɔøɯdɐʇᴉbᴉlᴉʇʎ, ʍǝ sʇɹønƃlʎ ɹǝɔøɯɯǝnd .ɯd4 ɐnd .ʍǝbɯ ɟøɹɯɐʇ.) Sʇndǝnʇs ʍᴉll bǝ ɐblǝ ʇø ʌᴉǝʍ ʇɥǝ ɟᴉɹsʇ lᴉsʇǝd ʌᴉdǝø ʇɥɐʇ's ɔøɯdɐʇᴉblǝ ʍᴉʇɥ ʇɥǝ sʇndǝnʇ's ɔøɯdnʇǝɹ. Ŧø ɐlløʍ sʇndǝnʇs ʇø døʍnløɐd ʇɥǝsǝ ʌᴉdǝøs, sǝʇ Vᴉdǝø Đøʍnløɐd Ⱥlløʍǝd ʇø Ŧɹnǝ.

source: By default, students can download an .srt or .txt transcript when you set Download Transcript Allowed to True. If you want to provide a downloadable transcript in a different format, we recommend that you upload a handout by using the Upload a Handout field. If this isn't possible, you can post a transcript file on the Files & Uploads page or on the Internet, and then add the URL for the transcript here. Students see a link to download that transcript below the video.
rtl: زغ يثبشعمف, سفعيثرفس ذشر يخصرمخشي شر .سقف خق .فطف فقشرسذقهحف صاثر غخع سثف يخصرمخشي فقشرسذقهحف شممخصثي فخ فقعث. هب غخع صشرف فخ حقخدهيث ش يخصرمخشيشزمث فقشرسذقهحف هر ش يهببثقثرف بخقوشف, صث قثذخووثري فاشف غخع عحمخشي ش اشريخعف زغ عسهرل فاث عحمخشي ش اشريخعف بهثمي. هب فاهس هسر'ف حخسسهزمث, غخع ذشر حخسف ش فقشرسذقهحف بهمث خر فاث بهمثس & عحمخشيس حشلث خق خر فاث هرفثقرثف, شري فاثر شيي فاث عقم بخق فاث فقشرسذقهحف اثقث. سفعيثرفس سثث ش مهرن فخ يخصرمخشي فاشف فقشرسذقهحف زثمخص فاث دهيثخ.

source: Downloadable Transcript URL
rtl: يخصرمخشيشزمث فقشرسذقهحف عقمɃʎ dǝɟɐnlʇ, sʇndǝnʇs ɔɐn døʍnløɐd ɐn .sɹʇ øɹ .ʇxʇ ʇɹɐnsɔɹᴉdʇ ʍɥǝn ʎøn sǝʇ Đøʍnløɐd Ŧɹɐnsɔɹᴉdʇ Ⱥlløʍǝd ʇø Ŧɹnǝ. Ɨɟ ʎøn ʍɐnʇ ʇø dɹøʌᴉdǝ ɐ døʍnløɐdɐblǝ ʇɹɐnsɔɹᴉdʇ ᴉn ɐ dᴉɟɟǝɹǝnʇ ɟøɹɯɐʇ, ʍǝ ɹǝɔøɯɯǝnd ʇɥɐʇ ʎøn ndløɐd ɐ ɥɐndønʇ bʎ nsᴉnƃ ʇɥǝ Ʉdløɐd ɐ Ħɐndønʇ ɟᴉǝld. Ɨɟ ʇɥᴉs ᴉsn'ʇ døssᴉblǝ, ʎøn ɔɐn døsʇ ɐ ʇɹɐnsɔɹᴉdʇ ɟᴉlǝ øn ʇɥǝ Fᴉlǝs & Ʉdløɐds dɐƃǝ øɹ øn ʇɥǝ Ɨnʇǝɹnǝʇ, ɐnd ʇɥǝn ɐdd ʇɥǝ ɄɌŁ ɟøɹ ʇɥǝ ʇɹɐnsɔɹᴉdʇ ɥǝɹǝ. Sʇndǝnʇs sǝǝ ɐ lᴉnʞ ʇø døʍnløɐd ʇɥɐʇ ʇɹɐnsɔɹᴉdʇ bǝløʍ ʇɥǝ ʌᴉdǝø.

source: Allow students to download the timed transcript. A link to download the file appears below the video. By default, the transcript is an .srt or .txt file. If you want to provide the transcript for download in a different format, upload a file by using the Upload Handout field.
rtl: شممخص سفعيثرفس فخ يخصرمخشي فاث فهوثي فقشرسذقهحف. ش مهرن فخ يخصرمخشي فاث بهمث شححثشقس زثمخص فاث دهيثخ. زغ يثبشعمف, فاث فقشرسذقهحف هس شر .سقف خق .فطف بهمث. هب غخع صشرف فخ حقخدهيث فاث فقشرسذقهحف بخق يخصرمخشي هر ش يهببثقثرف بخقوشف, عحمخشي ش بهمث زغ عسهرل فاث عحمخشي اشريخعف بهثمي.

source: Download Transcript Allowed
rtl: يخصرمخشي فقشرسذقهحف شممخصثيȺlløʍ sʇndǝnʇs ʇø døʍnløɐd ʇɥǝ ʇᴉɯǝd ʇɹɐnsɔɹᴉdʇ. Ⱥ lᴉnʞ ʇø døʍnløɐd ʇɥǝ ɟᴉlǝ ɐddǝɐɹs bǝløʍ ʇɥǝ ʌᴉdǝø. Ƀʎ dǝɟɐnlʇ, ʇɥǝ ʇɹɐnsɔɹᴉdʇ ᴉs ɐn .sɹʇ øɹ .ʇxʇ ɟᴉlǝ. Ɨɟ ʎøn ʍɐnʇ ʇø dɹøʌᴉdǝ ʇɥǝ ʇɹɐnsɔɹᴉdʇ ɟøɹ døʍnløɐd ᴉn ɐ dᴉɟɟǝɹǝnʇ ɟøɹɯɐʇ, ndløɐd ɐ ɟᴉlǝ bʎ nsᴉnƃ ʇɥǝ Ʉdløɐd Ħɐndønʇ ɟᴉǝld.

source: The default transcript for the video, from the Default Timed Transcript field on the Basic tab. This transcript should be in English. You don't have to change this setting.
rtl: فاث يثبشعمف فقشرسذقهحف بخق فاث دهيثخ, بقخو فاث يثبشعمف فهوثي فقشرسذقهحف بهثمي خر فاث زشسهذ فشز. فاهس فقشرسذقهحف ساخعمي زث هر ثرلمهسا. غخع يخر'ف اشدث فخ ذاشرلث فاهس سثففهرل.

source: Default Timed Transcript
rtl: يثبشعمف فهوثي فقشرسذقهحف

source: Specify whether the transcripts appear with the video by default.
rtl: سحثذهبغ صاثفاثق فاث فقشرسذقهحفس شححثشق صهفا فاث دهيثخ زغ يثبشعمف.

source: Show Transcript
rtl: ساخص فقشرسذقهحفŦɥǝ dǝɟɐnlʇ ʇɹɐnsɔɹᴉdʇ ɟøɹ ʇɥǝ ʌᴉdǝø, ɟɹøɯ ʇɥǝ Đǝɟɐnlʇ Ŧᴉɯǝd Ŧɹɐnsɔɹᴉdʇ ɟᴉǝld øn ʇɥǝ Ƀɐsᴉɔ ʇɐb. Ŧɥᴉs ʇɹɐnsɔɹᴉdʇ sɥønld bǝ ᴉn Ɇnƃlᴉsɥ. Ɏøn døn'ʇ ɥɐʌǝ ʇø ɔɥɐnƃǝ ʇɥᴉs sǝʇʇᴉnƃ.

source: Add transcripts in different languages. Click below to specify a language and upload an .srt transcript file for that language.
rtl: شيي فقشرسذقهحفس هر يهببثقثرف مشرلعشلثس. ذمهذن زثمخص فخ سحثذهبغ ش مشرلعشلث شري عحمخشي شر .سقف فقشرسذقهحف بهمث بخق فاشف مشرلعشلث.

source: Transcript Languages
rtl: فقشرسذقهحف مشرلعشلثس

source: Preferred language for transcript.
rtl: حقثبثققثي مشرلعشلث بخق فقشرسذقهحف.

source: Preferred language for transcript
rtl: حقثبثققثي مشرلعشلث بخق فقشرسذقهحف

source: Transcript file format to download by user.
rtl: فقشرسذقهحف بهمث بخقوشف فخ يخصرمخشي زغ عسثق.Ⱥdd ʇɹɐnsɔɹᴉdʇs ᴉn dᴉɟɟǝɹǝnʇ lɐnƃnɐƃǝs. Ȼlᴉɔʞ bǝløʍ ʇø sdǝɔᴉɟʎ ɐ lɐnƃnɐƃǝ ɐnd ndløɐd ɐn .sɹʇ ʇɹɐnsɔɹᴉdʇ ɟᴉlǝ ɟøɹ ʇɥɐʇ lɐnƃnɐƃǝ.

source: SubRip (.srt) file
rtl: سعزقهح (.سقف) بهمث

source: Text (.txt) file
rtl: فثطف (.فطف) بهمث

source: The last speed that the user specified for the video.
rtl: فاث مشسف سحثثي فاشف فاث عسثق سحثذهبهثي بخق فاث دهيثخ.

source: The default speed for the video.
rtl: فاث يثبشعمف سحثثي بخق فاث دهيثخ.

source: Specify whether to advance automatically to the next unit when the video ends.
rtl: سحثذهبغ صاثفاثق فخ شيدشرذث شعفخوشفهذشممغ فخ فاث رثطف عرهف صاثر فاث دهيثخ ثريس.

source: Specify whether YouTube is available for the user.
rtl: سحثذهبغ صاثفاثق غخعفعزث هس شدشهمشزمث بخق فاث عسثق.Sdǝɔᴉɟʎ ʍɥǝʇɥǝɹ ʇø ɐdʌɐnɔǝ ɐnʇøɯɐʇᴉɔɐllʎ ʇø ʇɥǝ nǝxʇ nnᴉʇ ʍɥǝn ʇɥǝ ʌᴉdǝø ǝnds.

source: Upload a handout to accompany this video. Students can download the handout by clicking Download Handout under the video.
rtl: عحمخشي ش اشريخعف فخ شذذخوحشرغ فاهس دهيثخ. سفعيثرفس ذشر يخصرمخشي فاث اشريخعف زغ ذمهذنهرل يخصرمخشي اشريخعف عريثق فاث دهيثخ.

source: Upload Handout
rtl: عحمخشي اشريخعفɄdløɐd ɐ ɥɐndønʇ ʇø ɐɔɔøɯdɐnʎ ʇɥᴉs ʌᴉdǝø. Sʇndǝnʇs ɔɐn døʍnløɐd ʇɥǝ ɥɐndønʇ bʎ ɔlᴉɔʞᴉnƃ Đøʍnløɐd Ħɐndønʇ nndǝɹ ʇɥǝ ʌᴉdǝø.

source: Specify whether access to this video is limited to browsers only, or if it can be accessed from other applications including mobile apps.
rtl: سحثذهبغ صاثفاثق شذذثسس فخ فاهس دهيثخ هس مهوهفثي فخ زقخصسثقس خرمغ, خق هب هف ذشر زث شذذثسسثي بقخو خفاثق شححمهذشفهخرس هرذمعيهرل وخزهمث شححس.

source: Video Available on Web Only
rtl: دهيثخ شدشهمشزمث خر صثز خرمغSdǝɔᴉɟʎ ʍɥǝʇɥǝɹ ɐɔɔǝss ʇø ʇɥᴉs ʌᴉdǝø ᴉs lᴉɯᴉʇǝd ʇø bɹøʍsǝɹs ønlʎ, øɹ ᴉɟ ᴉʇ ɔɐn bǝ ɐɔɔǝssǝd ɟɹøɯ øʇɥǝɹ ɐddlᴉɔɐʇᴉøns ᴉnɔlndᴉnƃ ɯøbᴉlǝ ɐdds.

source: If you were assigned a Video ID by edX for the video to play in this component, enter the ID here. In this case, do not enter values in the Default Video URL, the Video File URLs, and the YouTube ID fields. If you were not assigned a Video ID, enter values in those other fields and ignore this field.
rtl: هب غخع صثقث شسسهلرثي ش دهيثخ هي زغ ثيط بخق فاث دهيثخ فخ حمشغ هر فاهس ذخوحخرثرف, ثرفثق فاث هي اثقث. هر فاهس ذشسث, يخ رخف ثرفثق دشمعثس هر فاث يثبشعمف دهيثخ عقم, فاث دهيثخ بهمث عقمس, شري فاث غخعفعزث هي بهثميس. هب غخع صثقث رخف شسسهلرثي ش دهيثخ هي, ثرفثق دشمعثس هر فاخسث خفاثق بهثميس شري هلرخقث فاهس بهثمي.

source: Date of the last view of the bumper
rtl: يشفث خب فاث مشسف دهثص خب فاث زعوحثق

source: Do not show bumper again
rtl: يخ رخف ساخص زعوحثق شلشهرƗɟ ʎøn ʍǝɹǝ ɐssᴉƃnǝd ɐ Vᴉdǝø ƗĐ bʎ ǝdX ɟøɹ ʇɥǝ ʌᴉdǝø ʇø dlɐʎ ᴉn ʇɥᴉs ɔøɯdønǝnʇ, ǝnʇǝɹ ʇɥǝ ƗĐ ɥǝɹǝ. Ɨn ʇɥᴉs ɔɐsǝ, dø nøʇ ǝnʇǝɹ ʌɐlnǝs ᴉn ʇɥǝ Đǝɟɐnlʇ Vᴉdǝø ɄɌŁ, ʇɥǝ Vᴉdǝø Fᴉlǝ ɄɌŁs, ɐnd ʇɥǝ ɎønŦnbǝ ƗĐ ɟᴉǝlds. Ɨɟ ʎøn ʍǝɹǝ nøʇ ɐssᴉƃnǝd ɐ Vᴉdǝø ƗĐ, ǝnʇǝɹ ʌɐlnǝs ᴉn ʇɥøsǝ øʇɥǝɹ ɟᴉǝlds ɐnd ᴉƃnøɹǝ ʇɥᴉs ɟᴉǝld.

source: Specify whether the video can be accessed publicly by learners.
rtl: Sdǝɔᴉɟʎ ʍɥǝʇɥǝɹ ʇɥǝ ʌᴉdǝø ɔɐn bǝ ɐɔɔǝssǝd dnblᴉɔlʎ bʎ lǝɐɹnǝɹs.

source: Public Access
rtl: Ᵽnblᴉɔ Ⱥɔɔǝss

source: Instructions
rtl: هرسفقعذفهخرس

source: Add instructions to help learners understand how to use the word cloud. Clear instructions are important, especially for learners who have accessibility requirements.
rtl: شيي هرسفقعذفهخرس فخ اثمح مثشقرثقس عريثقسفشري اخص فخ عسث فاث صخقي ذمخعي. ذمثشق هرسفقعذفهخرس شقث هوحخقفشرف, ثسحثذهشممغ بخق مثشقرثقس صاخ اشدث شذذثسسهزهمهفغ قثضعهقثوثرفس.

source: Inputs
rtl: هرحعفسȺdd ᴉnsʇɹnɔʇᴉøns ʇø ɥǝld lǝɐɹnǝɹs nndǝɹsʇɐnd ɥøʍ ʇø nsǝ ʇɥǝ ʍøɹd ɔlønd. Ȼlǝɐɹ ᴉnsʇɹnɔʇᴉøns ɐɹǝ ᴉɯdøɹʇɐnʇ, ǝsdǝɔᴉɐllʎ ɟøɹ lǝɐɹnǝɹs ʍɥø ɥɐʌǝ ɐɔɔǝssᴉbᴉlᴉʇʎ ɹǝbnᴉɹǝɯǝnʇs.

source: The number of text boxes available for learners to add words and sentences.
rtl: فاث رعوزثق خب فثطف زخطثس شدشهمشزمث بخق مثشقرثقس فخ شيي صخقيس شري سثرفثرذثس.

source: Maximum Words
rtl: وشطهوعو صخقيس

source: The maximum number of words displayed in the generated word cloud.
rtl: فاث وشطهوعو رعوزثق خب صخقيس يهسحمشغثي هر فاث لثرثقشفثي صخقي ذمخعي.

source: Show Percents
rtl: ساخص حثقذثرفس

source: Statistics are shown for entered words near that word.
rtl: سفشفهسفهذس شقث ساخصر بخق ثرفثقثي صخقيس رثشق فاشف صخقي.

source: Whether this learner has posted words to the cloud.
rtl: صاثفاثق فاهس مثشقرثق اشس حخسفثي صخقيس فخ فاث ذمخعي.

source: Student answer.
rtl: سفعيثرف شرسصثق.

source: All possible words from all learners.
rtl: شمم حخسسهزمث صخقيس بقخو شمم مثشقرثقس.

source: Top num_top_words words for word cloud.
rtl: فخح رعو_فخح_صخقيس صخقيس بخق صخقي ذمخعي.Ŧɥǝ nnɯbǝɹ øɟ ʇǝxʇ bøxǝs ɐʌɐᴉlɐblǝ ɟøɹ lǝɐɹnǝɹs ʇø ɐdd ʍøɹds ɐnd sǝnʇǝnɔǝs.

source: {display_name} is only accessible to enrolled learners. Sign in or register, and enroll in this course to view it.
rtl: {display_name} هس خرمغ شذذثسسهزمث فخ ثرقخممثي مثشقرثقس. سهلر هر خق قثلهسفثق, شري ثرقخمم هر فاهس ذخعقسث فخ دهثص هف.

source: Unlock Account
rtl: عرمخذن شذذخعرف{display_name} ᴉs ønlʎ ɐɔɔǝssᴉblǝ ʇø ǝnɹøllǝd lǝɐɹnǝɹs. Sᴉƃn ᴉn øɹ ɹǝƃᴉsʇǝɹ, ɐnd ǝnɹøll ᴉn ʇɥᴉs ɔønɹsǝ ʇø ʌᴉǝʍ ᴉʇ.

source: Close
rtl: ذمخسث

source: This is a routed Account Activation email for %(routed_user)s (%(routed_user_email)s): %(routed_profile_name)s
rtl: فاهس هس ش قخعفثي شذذخعرف شذفهدشفهخر ثوشهم بخق %(routed_user)s Ŧɥᴉs ᴉs ɐ ɹønʇǝd Ⱥɔɔønnʇ Ⱥɔʇᴉʌɐʇᴉøn ǝɯɐᴉl ɟøɹ %(routed_user)s (%(routed_user_email)s): %(routed_profile_name)s

source: Account activation
rtl: شذذخعرف شذفهدشفهخر

source: You're almost there! Use the link below to activate your account to access engaging, high-quality %(platform_name)s courses. Note that you will not be able to log back into your account until you have activated it.
rtl: غخع'قث شموخسف فاثقث! عسث فاث مهرن زثمخص فخ شذفهدشفث غخعق شذذخعرف فخ شذذثسس ثرلشلهرل, اهلا-ضعشمهفغ %(platform_name)s ذخعقسثس. رخفث فاشف غخع صهمم رخف زث شزمث فخ مخل زشذن هرفخ غخعق شذذخعرف عرفهم غخع اشدث شذفهدشفثي هف.

source: Activate your account
rtl: شذفهدشفث غخعق شذذخعرفɎøn'ɹǝ ɐlɯøsʇ ʇɥǝɹǝ! Ʉsǝ ʇɥǝ lᴉnʞ bǝløʍ ʇø ɐɔʇᴉʌɐʇǝ ʎønɹ ɐɔɔønnʇ ʇø ɐɔɔǝss ǝnƃɐƃᴉnƃ, ɥᴉƃɥ-bnɐlᴉʇʎ %(platform_name)s ɔønɹsǝs. Nøʇǝ ʇɥɐʇ ʎøn ʍᴉll nøʇ bǝ ɐblǝ ʇø løƃ bɐɔʞ ᴉnʇø ʎønɹ ɐɔɔønnʇ nnʇᴉl ʎøn ɥɐʌǝ ɐɔʇᴉʌɐʇǝd ᴉʇ.

source: Enjoy learning with %(platform_name)s.
rtl: ثرتخغ مثشقرهرل صهفا %(platform_name)s.
