Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: You can also create assignment types, such as homework, labs, quizzes, and exams, and specify how much of a student's grade each assignment type is worth.
rtl: غخع ذشر شمسخ ذقثشفث شسسهلروثرف فغحثس, سعذا شس اخوثصخقن, مشزس, ضعهظظثس, شري ثطشوس, شري سحثذهبغ اخص وعذا خب ش سفعيثرف'س لقشيث ثشذا شسسهلروثرف فغحث هس صخقفا.

source: Expand or Collapse
rtl: ثطحشري خق ذخممشحسث

source: Access Settings
rtl: شذذثسس سثففهرلس

source: Set Access
rtl: سثف شذذثسس

source: This block contains multiple components.
rtl: فاهس زمخذن ذخرفشهرس وعمفهحمث ذخوحخرثرفس.

source: New Textbook
rtl: رثص فثطفزخخن

source: Why should I break my textbook into chapters?
rtl: صاغ ساخعمي ه زقثشن وغ فثطفزخخن هرفخ ذاشحفثقس?Ɏøn ɔɐn ɐlsø ɔɹǝɐʇǝ ɐssᴉƃnɯǝnʇ ʇʎdǝs, snɔɥ ɐs ɥøɯǝʍøɹʞ, lɐbs, bnᴉzzǝs, ɐnd ǝxɐɯs, ɐnd sdǝɔᴉɟʎ ɥøʍ ɯnɔɥ øɟ ɐ sʇndǝnʇ's ƃɹɐdǝ ǝɐɔɥ ɐssᴉƃnɯǝnʇ ʇʎdǝ ᴉs ʍøɹʇɥ.

source: Breaking your textbook into multiple chapters reduces loading times for students, especially those with slow Internet connections. Breaking up textbooks into chapters can also help students more easily find topic-based information.
rtl: زقثشنهرل غخعق فثطفزخخن هرفخ وعمفهحمث ذاشحفثقس قثيعذثس مخشيهرل فهوثس بخق سفعيثرفس, ثسحثذهشممغ فاخسث صهفا سمخص هرفثقرثف ذخررثذفهخرس. زقثشنهرل عح فثطفزخخنس هرفخ ذاشحفثقس ذشر شمسخ اثمح سفعيثرفس وخقث ثشسهمغ بهري فخحهذ-زشسثي هربخقوشفهخر.

source: What if my book isn't divided into chapters?
rtl: صاشف هب وغ زخخن هسر'ف يهدهيثي هرفخ ذاشحفثقس?Ƀɹǝɐʞᴉnƃ ʎønɹ ʇǝxʇbøøʞ ᴉnʇø ɯnlʇᴉdlǝ ɔɥɐdʇǝɹs ɹǝdnɔǝs løɐdᴉnƃ ʇᴉɯǝs ɟøɹ sʇndǝnʇs, ǝsdǝɔᴉɐllʎ ʇɥøsǝ ʍᴉʇɥ sløʍ Ɨnʇǝɹnǝʇ ɔønnǝɔʇᴉøns. Ƀɹǝɐʞᴉnƃ nd ʇǝxʇbøøʞs ᴉnʇø ɔɥɐdʇǝɹs ɔɐn ɐlsø ɥǝld sʇndǝnʇs ɯøɹǝ ǝɐsᴉlʎ ɟᴉnd ʇødᴉɔ-bɐsǝd ᴉnɟøɹɯɐʇᴉøn.

source: If your textbook doesn't have individual chapters, you can upload the entire text as a single chapter and enter a name of your choice in the Chapter Name field.
rtl: هب غخعق فثطفزخخن يخثسر'ف اشدث هريهدهيعشم ذاشحفثقس, غخع ذشر عحمخشي فاث ثرفهقث فثطف شس ش سهرلمث ذاشحفثق شري ثرفثق ش رشوث خب غخعق ذاخهذث هر فاث ذاشحفثق رشوث بهثمي.

source: Learn more about textbooks
rtl: مثشقر وخقث شزخعف فثطفزخخنس

source: Video Uploads
rtl: دهيثخ عحمخشيس

source: Course Video Settings
rtl: ذخعقسث دهيثخ سثففهرلس

source: Changing..
rtl: ذاشرلهرل..

source: Videos per page:
rtl: دهيثخس حثق حشلث:

source: Access is not restricted
rtl: شذذثسس هس رخف قثسفقهذفثيƗɟ ʎønɹ ʇǝxʇbøøʞ døǝsn'ʇ ɥɐʌǝ ᴉndᴉʌᴉdnɐl ɔɥɐdʇǝɹs, ʎøn ɔɐn ndløɐd ʇɥǝ ǝnʇᴉɹǝ ʇǝxʇ ɐs ɐ sᴉnƃlǝ ɔɥɐdʇǝɹ ɐnd ǝnʇǝɹ ɐ nɐɯǝ øɟ ʎønɹ ɔɥøᴉɔǝ ᴉn ʇɥǝ Ȼɥɐdʇǝɹ Nɐɯǝ ɟᴉǝld.

source: Access to this unit is not restricted, but visibility might be affected by inherited settings.
rtl: شذذثسس فخ فاهس عرهف هس رخف قثسفقهذفثي, زعف دهسهزهمهفغ وهلاف زث شببثذفثي زغ هراثقهفثي سثففهرلس.Ⱥɔɔǝss ʇø ʇɥᴉs nnᴉʇ ᴉs nøʇ ɹǝsʇɹᴉɔʇǝd, bnʇ ʌᴉsᴉbᴉlᴉʇʎ ɯᴉƃɥʇ bǝ ɐɟɟǝɔʇǝd bʎ ᴉnɥǝɹᴉʇǝd sǝʇʇᴉnƃs.

source: Access to this component is not restricted, but visibility might be affected by inherited settings.
rtl: شذذثسس فخ فاهس ذخوحخرثرف هس رخف قثسفقهذفثي, زعف دهسهزهمهفغ وهلاف زث شببثذفثي زغ هراثقهفثي سثففهرلس.Ⱥɔɔǝss ʇø ʇɥᴉs ɔøɯdønǝnʇ ᴉs nøʇ ɹǝsʇɹᴉɔʇǝd, bnʇ ʌᴉsᴉbᴉlᴉʇʎ ɯᴉƃɥʇ bǝ ɐɟɟǝɔʇǝd bʎ ᴉnɥǝɹᴉʇǝd sǝʇʇᴉnƃs.

source: You can restrict access to this unit to learners in specific enrollment tracks or content groups.
rtl: غخع ذشر قثسفقهذف شذذثسس فخ فاهس عرهف فخ مثشقرثقس هر سحثذهبهذ ثرقخمموثرف فقشذنس خق ذخرفثرف لقخعحس.Ɏøn ɔɐn ɹǝsʇɹᴉɔʇ ɐɔɔǝss ʇø ʇɥᴉs nnᴉʇ ʇø lǝɐɹnǝɹs ᴉn sdǝɔᴉɟᴉɔ ǝnɹøllɯǝnʇ ʇɹɐɔʞs øɹ ɔønʇǝnʇ ƃɹønds.

source: You can restrict access to this component to learners in specific enrollment tracks or content groups.
rtl: غخع ذشر قثسفقهذف شذذثسس فخ فاهس ذخوحخرثرف فخ مثشقرثقس هر سحثذهبهذ ثرقخمموثرف فقشذنس خق ذخرفثرف لقخعحس.Ɏøn ɔɐn ɹǝsʇɹᴉɔʇ ɐɔɔǝss ʇø ʇɥᴉs ɔøɯdønǝnʇ ʇø lǝɐɹnǝɹs ᴉn sdǝɔᴉɟᴉɔ ǝnɹøllɯǝnʇ ʇɹɐɔʞs øɹ ɔønʇǝnʇ ƃɹønds.

source: You can restrict access to this unit to learners in specific content groups.
rtl: غخع ذشر قثسفقهذف شذذثسس فخ فاهس عرهف فخ مثشقرثقس هر سحثذهبهذ ذخرفثرف لقخعحس.Ɏøn ɔɐn ɹǝsʇɹᴉɔʇ ɐɔɔǝss ʇø ʇɥᴉs nnᴉʇ ʇø lǝɐɹnǝɹs ᴉn sdǝɔᴉɟᴉɔ ɔønʇǝnʇ ƃɹønds.

source: You can restrict access to this component to learners in specific content groups.
rtl: غخع ذشر قثسفقهذف شذذثسس فخ فاهس ذخوحخرثرف فخ مثشقرثقس هر سحثذهبهذ ذخرفثرف لقخعحس.

source: Manage content groups
rtl: وشرشلث ذخرفثرف لقخعحسɎøn ɔɐn ɹǝsʇɹᴉɔʇ ɐɔɔǝss ʇø ʇɥᴉs ɔøɯdønǝnʇ ʇø lǝɐɹnǝɹs ᴉn sdǝɔᴉɟᴉɔ ɔønʇǝnʇ ƃɹønds.

source: {screen_reader_start}Warning:{screen_reader_end} The unit that contains this component is hidden from learners. The unit setting overrides the component access settings defined here.
rtl: {screen_reader_start}صشقرهرل:{screen_reader_end} فاث عرهف فاشف ذخرفشهرس فاهس ذخوحخرثرف هس اهييثر بقخو مثشقرثقس. فاث عرهف سثففهرل خدثققهيثس فاث ذخوحخرثرف شذذثسس سثففهرلس يثبهرثي اثقث.

source: Access is restricted to:
rtl: شذذثسس هس قثسفقهذفثي فخ:

source: Restrict access to:
rtl: قثسفقهذف شذذثسس فخ:

source: Select a group type
rtl: سثمثذف ش لقخعح فغحث

source: All Learners and Staff
rtl: شمم مثشقرثقس شري سفشبب

source: Select one or more groups:
rtl: سثمثذف خرث خق وخقث لقخعحس:{screen_reader_start}Wɐɹnᴉnƃ:{screen_reader_end} Ŧɥǝ nnᴉʇ ʇɥɐʇ ɔønʇɐᴉns ʇɥᴉs ɔøɯdønǝnʇ ᴉs ɥᴉddǝn ɟɹøɯ lǝɐɹnǝɹs. Ŧɥǝ nnᴉʇ sǝʇʇᴉnƃ øʌǝɹɹᴉdǝs ʇɥǝ ɔøɯdønǝnʇ ɐɔɔǝss sǝʇʇᴉnƃs dǝɟᴉnǝd ɥǝɹǝ.

source: This group no longer exists. Choose another group or remove the access restriction.
rtl: فاهس لقخعح رخ مخرلثق ثطهسفس. ذاخخسث شرخفاثق لقخعح خق قثوخدث فاث شذذثسس قثسفقهذفهخر.

source: {email} has requested {studio_name} course creator privileges on edge
rtl: {email} اشس قثضعثسفثي {studio_name} ذخعقسث ذقثشفخق حقهدهمثلثس خر ثيلثŦɥᴉs ƃɹønd nø lønƃǝɹ ǝxᴉsʇs. Ȼɥøøsǝ ɐnøʇɥǝɹ ƃɹønd øɹ ɹǝɯøʌǝ ʇɥǝ ɐɔɔǝss ɹǝsʇɹᴉɔʇᴉøn.

source: User '{user}' with e-mail {email} has requested {studio_name} course creator privileges on edge.
rtl: عسثق '{user}' صهفا ث-وشهم {email} اشس قثضعثسفثي {studio_name} ذخعقسث ذقثشفخق حقهدهمثلثس خر ثيلث.

source: To grant or deny this request, use the course creator admin table.
rtl: فخ لقشرف خق يثرغ فاهس قثضعثسف, عسث فاث ذخعقسث ذقثشفخق شيوهر فشزمث.Ʉsǝɹ '{user}' ʍᴉʇɥ ǝ-ɯɐᴉl {email} ɥɐs ɹǝbnǝsʇǝd {studio_name} ɔønɹsǝ ɔɹǝɐʇøɹ dɹᴉʌᴉlǝƃǝs øn ǝdƃǝ.

source: Your request for course creation rights to {studio_name} have been denied. If you believe this was in error, please contact {email}
rtl: غخعق قثضعثسف بخق ذخعقسث ذقثشفهخر قهلافس فخ {studio_name} اشدث زثثر يثرهثي. هب غخع زثمهثدث فاهس صشس هر ثققخق, حمثشسث ذخرفشذف {email}Ɏønɹ ɹǝbnǝsʇ ɟøɹ ɔønɹsǝ ɔɹǝɐʇᴉøn ɹᴉƃɥʇs ʇø {studio_name} ɥɐʌǝ bǝǝn dǝnᴉǝd. Ɨɟ ʎøn bǝlᴉǝʌǝ ʇɥᴉs ʍɐs ᴉn ǝɹɹøɹ, dlǝɐsǝ ɔønʇɐɔʇ {email}

source: Your request for course creation rights to {studio_name} have been granted. To create your first course, visit {url}
rtl: غخعق قثضعثسف بخق ذخعقسث ذقثشفهخر قهلافس فخ {studio_name} اشدث زثثر لقشرفثي. فخ ذقثشفث غخعق بهقسف ذخعقسث, دهسهف Ɏønɹ ɹǝbnǝsʇ ɟøɹ ɔønɹsǝ ɔɹǝɐʇᴉøn ɹᴉƃɥʇs ʇø {studio_name} ɥɐʌǝ bǝǝn ƃɹɐnʇǝd. Ŧø ɔɹǝɐʇǝ ʎønɹ ɟᴉɹsʇ ɔønɹsǝ, ʌᴉsᴉʇ {url}

source: Your course creation rights to {studio_name} have been revoked. If you believe this was in error, please contact {email}
rtl: غخعق ذخعقسث ذقثشفهخر قهلافس فخ {studio_name} اشدث زثثر قثدخنثي. هب غخع زثمهثدث فاهس صشس هر ثققخق, حمثشسث ذخرفشذف {email}

source: Your course creator status for {studio_name}
rtl: غخعق ذخعقسث ذقثشفخق سفشفعس بخق {studio_name}Ɏønɹ ɔønɹsǝ ɔɹǝɐʇᴉøn ɹᴉƃɥʇs ʇø {studio_name} ɥɐʌǝ bǝǝn ɹǝʌøʞǝd. Ɨɟ ʎøn bǝlᴉǝʌǝ ʇɥᴉs ʍɐs ᴉn ǝɹɹøɹ, dlǝɐsǝ ɔønʇɐɔʇ {email}

source: Your {task_name} task has completed with the status '{task_status}'. Use this URL to view task details or download any files created: {detail_url}
rtl: غخعق {task_name} فشسن اشس ذخوحمثفثي صهفا فاث سفشفعس '{task_status}'. عسث فاهس عقم فخ دهثص فشسن يثفشهمس خق يخصرمخشي شرغ بهمثس ذقثشفثي: {detail_url}Ɏønɹ {task_name} ʇɐsʞ ɥɐs ɔøɯdlǝʇǝd ʍᴉʇɥ ʇɥǝ sʇɐʇns '{task_status}'. Ʉsǝ ʇɥᴉs ɄɌŁ ʇø ʌᴉǝʍ ʇɐsʞ dǝʇɐᴉls øɹ døʍnløɐd ɐnʎ ɟᴉlǝs ɔɹǝɐʇǝd: {detail_url}

source: Your {task_name} task has completed with the status '{task_status}'. Sign in to view the details of your task or download any files created.
rtl: غخعق {task_name} فشسن اشس ذخوحمثفثي صهفا فاث سفشفعس '{task_status}'. سهلر هر فخ دهثص فاث يثفشهمس خب غخعق فشسن خق يخصرمخشي شرغ بهمثس ذقثشفثي.

source: Here are some validations we found with your course content.
rtl: اثقث شقث سخوث دشمهيشفهخرس صث بخعري صهفا غخعق ذخعقسث ذخرفثرف.

source: Errors:
rtl: ثققخقس:

source: Warnings:
rtl: صشقرهرلس:

source: {platform_name} {studio_name}: Task Status Update
rtl: {platform_name} {studio_name}: فشسن سفشفعس عحيشفث

source: Delete Announcement
rtl: يثمثفث شررخعرذثوثرف

source: Are you sure you want to delete this Announcement?
rtl: شقث غخع سعقث غخع صشرف فخ يثمثفث فاهس شررخعرذثوثرف?

source: Confirm
rtl: ذخربهقو

source: Edit Announcement
rtl: ثيهف شررخعرذثوثرف

source: Create New
rtl: ذقثشفث رثص

source: previous
rtl: حقثدهخعس

source: next
rtl: رثطف

source: Required data to force publish course.
rtl: قثضعهقثي يشفش فخ بخقذث حعزمهسا ذخعقسث.

source: course-v1:edX+DemoX+Demo_Course
rtl: ذخعقسث-د1:ثيط+يثوخط+يثوخ_ذخعقسث

source: Reset values
rtl: قثسثف دشمعثس

source: Maintenance Dashboard
rtl: وشهرفثرشرذث يشسازخشقي

source: Thanks for activating your account.
rtl: فاشرنس بخق شذفهدشفهرل غخعق شذذخعرف.

source: This account has already been activated.
rtl: فاهس شذذخعرف اشس شمقثشيغ زثثر شذفهدشفثي.

source: Visit your {link_start}dashboard{link_end} to see your courses.
rtl: دهسهف غخعق {link_start}يشسازخشقي{link_end} فخ سثث غخعق ذخعقسثس.

source: You can now {link_start}sign in{link_end}.
rtl: غخع ذشر رخص {link_start}سهلر هر{link_end}.

source: Activation Invalid
rtl: شذفهدشفهخر هردشمهيɎønɹ {task_name} ʇɐsʞ ɥɐs ɔøɯdlǝʇǝd ʍᴉʇɥ ʇɥǝ sʇɐʇns '{task_status}'. Sᴉƃn ᴉn ʇø ʌᴉǝʍ ʇɥǝ dǝʇɐᴉls øɟ ʎønɹ ʇɐsʞ øɹ døʍnløɐd ɐnʎ ɟᴉlǝs ɔɹǝɐʇǝd.

source: Something went wrong. Email programs sometimes split URLs into two lines, so make sure the URL you're using is formatted correctly. If you still have issues, send us an email message at {email_start}{email}{email_end}.
rtl: سخوثفاهرل صثرف صقخرل. ثوشهم حقخلقشوس سخوثفهوثس سحمهف عقمس هرفخ فصخ مهرثس, سخ وشنث سعقث فاث عقم غخع'قث عسهرل هس بخقوشففثي ذخققثذفمغ. هب غخع سفهمم اشدث هسسعثس, سثري عس شر ثوشهم وثسسشلث شف {email_start}{email}{email_end}.

source: Return to the {link_start}home page{link_end}.
rtl: قثفعقر فخ فاث {link_start}اخوث حشلث{link_end}.

source: Support will be removed in an upcoming release.
rtl: سعححخقف صهمم زث قثوخدثي هر شر عحذخوهرل قثمثشسث.

source: Support will be removed on {expiration_date}.
rtl: سعححخقف صهمم زث قثوخدثي خر {expiration_date}.

source: This course uses a legacy storage format.
rtl: فاهس ذخعقسث عسثس ش مثلشذغ سفخقشلث بخقوشف.Søɯǝʇɥᴉnƃ ʍǝnʇ ʍɹønƃ. Ɇɯɐᴉl dɹøƃɹɐɯs søɯǝʇᴉɯǝs sdlᴉʇ ɄɌŁs ᴉnʇø ʇʍø lᴉnǝs, sø ɯɐʞǝ snɹǝ ʇɥǝ ɄɌŁ ʎøn'ɹǝ nsᴉnƃ ᴉs ɟøɹɯɐʇʇǝd ɔøɹɹǝɔʇlʎ. Ɨɟ ʎøn sʇᴉll ɥɐʌǝ ᴉssnǝs, sǝnd ns ɐn ǝɯɐᴉl ɯǝssɐƃǝ ɐʇ {email_start}{email}{email_end}.

source: Please reach out to your support team contact, if you have any additional questions or concerns.
rtl: حمثشسث قثشذا خعف فخ غخعق سعححخقف فثشو ذخرفشذف, هب غخع اشدث شرغ شييهفهخرشم ضعثسفهخرس خق ذخرذثقرس.

source: Policies
rtl: حخمهذهثس

source: Accessibility Accommodation Request
rtl: شذذثسسهزهمهفغ شذذخووخيشفهخر قثضعثسف

source: LMS
rtl: موس

source: Current Course:
rtl: ذعققثرف ذخعقسث:

source: Course Navigation
rtl: ذخعقسث رشدهلشفهخر

source: Outline
rtl: خعفمهرث

source: Publisher
rtl: حعزمهساثق

source: Import
rtl: هوحخقف

source: Export
rtl: ثطحخقف

source: Current Library:
rtl: ذعققثرف مهزقشقغ:

source: Language preference
rtl: مشرلعشلث حقثبثقثرذث

source: Account Navigation
rtl: شذذخعرف رشدهلشفهخر

source: Contextual Online Help
rtl: ذخرفثطفعشم خرمهرث اثمح

source: Sign Up
rtl: سهلر عح

source: Launch Latex Source Compiler
rtl: مشعرذا مشفثط سخعقذث ذخوحهمثق

source: Heading
rtl: اثشيهرل

source: Insert a heading
rtl: هرسثقف ش اثشيهرل

source: Add a multiple choice question
rtl: شيي ش وعمفهحمث ذاخهذث ضعثسفهخر

source: Add a question with checkboxes
rtl: شيي ش ضعثسفهخر صهفا ذاثذنزخطثس

source: Insert a text response
rtl: هرسثقف ش فثطف قثسحخرسث

source: Insert a numerical response
rtl: هرسثقف ش رعوثقهذشم قثسحخرسث

source: Insert a dropdown response
rtl: هرسثقف ش يقخحيخصر قثسحخرسث

source: Explanation
rtl: ثطحمشرشفهخر

source: Add an explanation for this question
rtl: شيي شر ثطحمشرشفهخر بخق فاهس ضعثسفهخر

source: Advanced Editor
rtl: شيدشرذثي ثيهفخق

source: Markdown Help
rtl: وشقنيخصر اثمح

source: Label
rtl: مشزثم

source: Access the Open edX Portal
rtl: شذذثسس فاث خحثر ثيط حخقفشم

source: Open edX Portal
rtl: خحثر ثيط حخقفشم

source: Currently signed in as:
rtl: ذعققثرفمغ سهلرثي هر شس:

source: Maintenance
rtl: وشهرفثرشرذث

source: created
rtl: ذقثشفثي

source: Wiki notifications
rtl: صهنه رخفهبهذشفهخرس

source: Wiki images
rtl: صهنه هوشلثس

source: Wiki attachments
rtl: صهنه شففشذاوثرفس

source: Only localhost... muahahaha
rtl: خرمغ مخذشماخسف... وعشاشاشاش

source: Initial title of the article. May be overridden with revision titles.
rtl: هرهفهشم فهفمث خب فاث شقفهذمث. وشغ زث خدثققهييثر صهفا قثدهسهخر فهفمثس.

source: Type in some contents
rtl: فغحث هر سخوث ذخرفثرفسⱣlǝɐsǝ ɹǝɐɔɥ ønʇ ʇø ʎønɹ snddøɹʇ ʇǝɐɯ ɔønʇɐɔʇ, ᴉɟ ʎøn ɥɐʌǝ ɐnʎ ɐddᴉʇᴉønɐl bnǝsʇᴉøns øɹ ɔønɔǝɹns.

source: This is just the initial contents of your article. After creating it, you can use more complex features like adding plugins, meta data, related articles etc...
rtl: فاهس هس تعسف فاث هرهفهشم ذخرفثرفس خب غخعق شقفهذمث. شبفثق ذقثشفهرل هف, غخع ذشر عسث وخقث ذخوحمثط بثشفعقثس مهنث شييهرل حمعلهرس, وثفش يشفش, قثمشفثي شقفهذمثس ثفذ...

source: Contents
rtl: ذخرفثرفس

source: Summary
rtl: سعووشقغŦɥᴉs ᴉs ɾnsʇ ʇɥǝ ᴉnᴉʇᴉɐl ɔønʇǝnʇs øɟ ʎønɹ ɐɹʇᴉɔlǝ. Ⱥɟʇǝɹ ɔɹǝɐʇᴉnƃ ᴉʇ, ʎøn ɔɐn nsǝ ɯøɹǝ ɔøɯdlǝx ɟǝɐʇnɹǝs lᴉʞǝ ɐddᴉnƃ dlnƃᴉns, ɯǝʇɐ dɐʇɐ, ɹǝlɐʇǝd ɐɹʇᴉɔlǝs ǝʇɔ...

source: Give a short reason for your edit, which will be stated in the revision log.
rtl: لهدث ش ساخقف قثشسخر بخق غخعق ثيهف, صاهذا صهمم زث سفشفثي هر فاث قثدهسهخر مخل.Ǥᴉʌǝ ɐ sɥøɹʇ ɹǝɐsøn ɟøɹ ʎønɹ ǝdᴉʇ, ʍɥᴉɔɥ ʍᴉll bǝ sʇɐʇǝd ᴉn ʇɥǝ ɹǝʌᴉsᴉøn løƃ.

source: While you were editing, someone else changed the revision. Your contents have been automatically merged with the new contents. Please review the text below.
rtl: صاهمث غخع صثقث ثيهفهرل, سخوثخرث ثمسث ذاشرلثي فاث قثدهسهخر. غخعق ذخرفثرفس اشدث زثثر شعفخوشفهذشممغ وثقلثي صهفا فاث رثص ذخرفثرفس. حمثشسث قثدهثص فاث فثطف زثمخص.

source: No changes made. Nothing to save.
rtl: رخ ذاشرلثس وشيث. رخفاهرل فخ سشدث.

source: Slug
rtl: سمعلWɥᴉlǝ ʎøn ʍǝɹǝ ǝdᴉʇᴉnƃ, søɯǝønǝ ǝlsǝ ɔɥɐnƃǝd ʇɥǝ ɹǝʌᴉsᴉøn. Ɏønɹ ɔønʇǝnʇs ɥɐʌǝ bǝǝn ɐnʇøɯɐʇᴉɔɐllʎ ɯǝɹƃǝd ʍᴉʇɥ ʇɥǝ nǝʍ ɔønʇǝnʇs. Ᵽlǝɐsǝ ɹǝʌᴉǝʍ ʇɥǝ ʇǝxʇ bǝløʍ.

source: This will be the address where your article can be found. Use only alphanumeric characters and - or _. Note that you cannot change the slug after creating the article.
rtl: فاهس صهمم زث فاث شييقثسس صاثقث غخعق شقفهذمث ذشر زث بخعري. عسث خرمغ شمحاشرعوثقهذ ذاشقشذفثقس شري - خق _. رخفث فاشف غخع ذشررخف ذاشرلث فاث سمعل شبفثق ذقثشفهرل فاث شقفهذمث.

source: Write a brief message for the article's history log.
rtl: صقهفث ش زقهثب وثسسشلث بخق فاث شقفهذمث'س اهسفخقغ مخل.

source: A slug may not begin with an underscore.
rtl: ش سمعل وشغ رخف زثلهر صهفا شر عريثقسذخقث.Ŧɥᴉs ʍᴉll bǝ ʇɥǝ ɐddɹǝss ʍɥǝɹǝ ʎønɹ ɐɹʇᴉɔlǝ ɔɐn bǝ ɟønnd. Ʉsǝ ønlʎ ɐldɥɐnnɯǝɹᴉɔ ɔɥɐɹɐɔʇǝɹs ɐnd - øɹ _. Nøʇǝ ʇɥɐʇ ʎøn ɔɐnnøʇ ɔɥɐnƃǝ ʇɥǝ slnƃ ɐɟʇǝɹ ɔɹǝɐʇᴉnƃ ʇɥǝ ɐɹʇᴉɔlǝ.

source: A deleted article with slug "%s" already exists.
rtl: ش يثمثفثي شقفهذمث صهفا سمعل "%s" شمقثشيغ ثطهسفس.

source: A slug named "%s" already exists.
rtl: ش سمعل رشوثي "%s" شمقثشيغ ثطهسفس.

source: Yes, I am sure
rtl: غثس, ه شو سعقث

source: Purge
rtl: حعقلث

source: Purge the article: Completely remove it (and all its contents) with no undo. Purging is a good idea if you want to free the slug such that users can create new articles in its place.
rtl: حعقلث فاث شقفهذمث: ذخوحمثفثمغ قثوخدث هف (شري شمم هفس ذخرفثرفس) صهفا رخ عريخ. حعقلهرل هس ش لخخي هيثش هب غخع صشرف فخ بقثث فاث سمعل سعذا فاشف عسثقس ذشر ذقثشفث رثص شقفهذمثس هر هفس حمشذث.Ᵽnɹƃǝ ʇɥǝ ɐɹʇᴉɔlǝ: Ȼøɯdlǝʇǝlʎ ɹǝɯøʌǝ ᴉʇ (ɐnd ɐll ᴉʇs ɔønʇǝnʇs) ʍᴉʇɥ nø nndø. Ᵽnɹƃᴉnƃ ᴉs ɐ ƃøød ᴉdǝɐ ᴉɟ ʎøn ʍɐnʇ ʇø ɟɹǝǝ ʇɥǝ slnƃ snɔɥ ʇɥɐʇ nsǝɹs ɔɐn ɔɹǝɐʇǝ nǝʍ ɐɹʇᴉɔlǝs ᴉn ᴉʇs dlɐɔǝ.

source: You are not sure enough!
rtl: غخع شقث رخف سعقث ثرخعلا!

source: While you tried to delete this article, it was modified. TAKE CARE!
rtl: صاهمث غخع فقهثي فخ يثمثفث فاهس شقفهذمث, هف صشس وخيهبهثي. فشنث ذشقث!

source: Lock article
rtl: مخذن شقفهذمث

source: Deny all users access to edit this article.
rtl: يثرغ شمم عسثقس شذذثسس فخ ثيهف فاهس شقفهذمث.

source: Permissions
rtl: حثقوهسسهخرس

source: Owner
rtl: خصرثق

source: Enter the username of the owner.
rtl: ثرفثق فاث عسثقرشوث خب فاث خصرثق.

source: (none)
rtl: (رخرث)

source: Inherit permissions
rtl: هراثقهف حثقوهسسهخرس

source: Check here to apply the above permissions recursively to articles under this one.
rtl: ذاثذن اثقث فخ شححمغ فاث شزخدث حثقوهسسهخرس قثذعقسهدثمغ فخ شقفهذمثس عريثق فاهس خرث.

source: Permission settings for the article were updated.
rtl: حثقوهسسهخر سثففهرلس بخق فاث شقفهذمث صثقث عحيشفثي.

source: Your permission settings were unchanged, so nothing saved.
rtl: غخعق حثقوهسسهخر سثففهرلس صثقث عرذاشرلثي, سخ رخفاهرل سشدثي.

source: No user with that username
rtl: رخ عسثق صهفا فاشف عسثقرشوث

source: Article locked for editing
rtl: شقفهذمث مخذنثي بخق ثيهفهرل

source: Article unlocked for editing
rtl: شقفهذمث عرمخذنثي بخق ثيهفهرل

source: Filter
rtl: بهمفثق

source: Settings for plugin
rtl: سثففهرلس بخق حمعلهرȻɥǝɔʞ ɥǝɹǝ ʇø ɐddlʎ ʇɥǝ ɐbøʌǝ dǝɹɯᴉssᴉøns ɹǝɔnɹsᴉʌǝlʎ ʇø ɐɹʇᴉɔlǝs nndǝɹ ʇɥᴉs ønǝ.

source: current revision
rtl: ذعققثرف قثدهسهخر

source: The revision being displayed for this article. If you need to do a roll-back, simply change the value of this field.
rtl: فاث قثدهسهخر زثهرل يهسحمشغثي بخق فاهس شقفهذمث. هب غخع رثثي فخ يخ ش قخمم-زشذن, سهوحمغ ذاشرلث فاث دشمعث خب فاهس بهثمي.

source: modified
rtl: وخيهبهثي

source: Article properties last modified
rtl: شقفهذمث حقخحثقفهثس مشسف وخيهبهثي

source: owner
rtl: خصرثقŦɥǝ ɹǝʌᴉsᴉøn bǝᴉnƃ dᴉsdlɐʎǝd ɟøɹ ʇɥᴉs ɐɹʇᴉɔlǝ. Ɨɟ ʎøn nǝǝd ʇø dø ɐ ɹøll-bɐɔʞ, sᴉɯdlʎ ɔɥɐnƃǝ ʇɥǝ ʌɐlnǝ øɟ ʇɥᴉs ɟᴉǝld.

source: The owner of the article, usually the creator. The owner always has both read and write access.
rtl: فاث خصرثق خب فاث شقفهذمث, عسعشممغ فاث ذقثشفخق. فاث خصرثق شمصشغس اشس زخفا قثشي شري صقهفث شذذثسس.

source: group
rtl: لقخعحŦɥǝ øʍnǝɹ øɟ ʇɥǝ ɐɹʇᴉɔlǝ, nsnɐllʎ ʇɥǝ ɔɹǝɐʇøɹ. Ŧɥǝ øʍnǝɹ ɐlʍɐʎs ɥɐs bøʇɥ ɹǝɐd ɐnd ʍɹᴉʇǝ ɐɔɔǝss.

source: Like in a UNIX file system, permissions can be given to a user according to group membership. Groups are handled through the Django auth system.
rtl: مهنث هر ش عرهط بهمث سغسفثو, حثقوهسسهخرس ذشر زث لهدثر فخ ش عسثق شذذخقيهرل فخ لقخعح وثوزثقساهح. لقخعحس شقث اشريمثي فاقخعلا فاث يتشرلخ شعفا سغسفثو.

source: group read access
rtl: لقخعح قثشي شذذثسس

source: group write access
rtl: لقخعح صقهفث شذذثسس

source: others read access
rtl: خفاثقس قثشي شذذثسس

source: others write access
rtl: خفاثقس صقهفث شذذثسسŁᴉʞǝ ᴉn ɐ ɄNƗX ɟᴉlǝ sʎsʇǝɯ, dǝɹɯᴉssᴉøns ɔɐn bǝ ƃᴉʌǝn ʇø ɐ nsǝɹ ɐɔɔøɹdᴉnƃ ʇø ƃɹønd ɯǝɯbǝɹsɥᴉd. Ǥɹønds ɐɹǝ ɥɐndlǝd ʇɥɹønƃɥ ʇɥǝ Đɾɐnƃø ɐnʇɥ sʎsʇǝɯ.

source: Article without content (%(id)d)
rtl: شقفهذمث صهفاخعف ذخرفثرف (%(id)d)

source: content type
rtl: ذخرفثرف فغحث

source: object ID
rtl: خزتثذف هي

source: Article for object
rtl: شقفهذمث بخق خزتثذف

source: Articles for object
rtl: شقفهذمثس بخق خزتثذف

source: revision number
rtl: قثدهسهخر رعوزثق

source: IP address
rtl: هح شييقثسس

source: user
rtl: عسثق

source: locked
rtl: مخذنثي

source: article
rtl: شقفهذمث

source: article contents
rtl: شقفهذمث ذخرفثرفس

source: article title
rtl: شقفهذمث فهفمث

source: Each revision contains a title field that must be filled out, even if the title has not changed
rtl: ثشذا قثدهسهخر ذخرفشهرس ش فهفمث بهثمي فاشف وعسف زث بهممثي خعف, ثدثر هب فاث فهفمث اشس رخف ذاشرلثي

source: original article
rtl: خقهلهرشم شقفهذمث

source: Permissions are inherited from this article
rtl: حثقوهسسهخرس شقث هراثقهفثي بقخو فاهس شقفهذمث

source: A plugin was changed
rtl: ش حمعلهر صشس ذاشرلثيɆɐɔɥ ɹǝʌᴉsᴉøn ɔønʇɐᴉns ɐ ʇᴉʇlǝ ɟᴉǝld ʇɥɐʇ ɯnsʇ bǝ ɟᴉllǝd ønʇ, ǝʌǝn ᴉɟ ʇɥǝ ʇᴉʇlǝ ɥɐs nøʇ ɔɥɐnƃǝd

source: The revision being displayed for this plugin.If you need to do a roll-back, simply change the value of this field.
rtl: فاث قثدهسهخر زثهرل يهسحمشغثي بخق فاهس حمعلهر.هب غخع رثثي فخ يخ ش قخمم-زشذن, سهوحمغ ذاشرلث فاث دشمعث خب فاهس بهثمي.

source: Cache lookup value for articles
rtl: ذشذاث مخخنعح دشمعث بخق شقفهذمثس

source: slug
rtl: سمعل

source: (root)
rtl: (قخخف)

source: URL path
rtl: عقم حشفا

source: URL paths
rtl: عقم حشفاس

source: Sorry but you cannot have a root article with a slug.
rtl: سخققغ زعف غخع ذشررخف اشدث ش قخخف شقفهذمث صهفا ش سمعل.

source: A non-root note must always have a slug.
rtl: ش رخر-قخخف رخفث وعسف شمصشغس اشدث ش سمعل.Ŧɥǝ ɹǝʌᴉsᴉøn bǝᴉnƃ dᴉsdlɐʎǝd ɟøɹ ʇɥᴉs dlnƃᴉn.Ɨɟ ʎøn nǝǝd ʇø dø ɐ ɹøll-bɐɔʞ, sᴉɯdlʎ ɔɥɐnƃǝ ʇɥǝ ʌɐlnǝ øɟ ʇɥᴉs ɟᴉǝld.

source: There is already a root node on %s
rtl: فاثقث هس شمقثشيغ ش قخخف رخيث خر %s

source: Articles who lost their parents =============================== The children of this article have had their parents deleted. You should probably find a new home for them.
rtl: شقفهذمثس صاخ مخسف فاثهق حشقثرفس =============================== فاث ذاهميقثر خب فاهس شقفهذمث اشدث اشي فاثهق حشقثرفس يثمثفثي. غخع ساخعمي حقخزشزمغ بهري ش رثص اخوث بخق فاثو.

source: Lost and found
rtl: مخسف شري بخعري

source: A short summary of what the file contains
rtl: ش ساخقف سعووشقغ خب صاشف فاث بهمث ذخرفشهرس

source: Yes I am sure...
rtl: غثس ه شو سعقث...

source: Click to download file
rtl: ذمهذن فخ يخصرمخشي بهمثȺɹʇᴉɔlǝs ʍɥø løsʇ ʇɥǝᴉɹ dɐɹǝnʇs =============================== Ŧɥǝ ɔɥᴉldɹǝn øɟ ʇɥᴉs ɐɹʇᴉɔlǝ ɥɐʌǝ ɥɐd ʇɥǝᴉɹ dɐɹǝnʇs dǝlǝʇǝd. Ɏøn sɥønld dɹøbɐblʎ ɟᴉnd ɐ nǝʍ ɥøɯǝ ɟøɹ ʇɥǝɯ.

source: The revision of this attachment currently in use (on all articles using the attachment)
rtl: فاث قثدهسهخر خب فاهس شففشذاوثرف ذعققثرفمغ هر عسث (خر شمم شقفهذمثس عسهرل فاث شففشذاوثرف)

source: original filename
rtl: خقهلهرشم بهمثرشوث

source: attachment
rtl: شففشذاوثرف

source: attachments
rtl: شففشذاوثرفس

source: file
rtl: بهمث

source: attachment revision
rtl: شففشذاوثرف قثدهسهخر

source: attachment revisions
rtl: شففشذاوثرف قثدهسهخرسŦɥǝ ɹǝʌᴉsᴉøn øɟ ʇɥᴉs ɐʇʇɐɔɥɯǝnʇ ɔnɹɹǝnʇlʎ ᴉn nsǝ (øn ɐll ɐɹʇᴉɔlǝs nsᴉnƃ ʇɥǝ ɐʇʇɐɔɥɯǝnʇ)

source: %s was successfully added.
rtl: %s صشس سعذذثسسبعممغ شييثي.

source: Your file could not be saved: %s
rtl: غخعق بهمث ذخعمي رخف زث سشدثي: %s

source: Your file could not be saved, probably because of a permission error on the web server.
rtl: غخعق بهمث ذخعمي رخف زث سشدثي, حقخزشزمغ زثذشعسث خب ش حثقوهسسهخر ثققخق خر فاث صثز سثقدثق.Ɏønɹ ɟᴉlǝ ɔønld nøʇ bǝ sɐʌǝd, dɹøbɐblʎ bǝɔɐnsǝ øɟ ɐ dǝɹɯᴉssᴉøn ǝɹɹøɹ øn ʇɥǝ ʍǝb sǝɹʌǝɹ.

source: %s uploaded and replaces old attachment.
rtl: %s عحمخشيثي شري قثحمشذثس خمي شففشذاوثرف.

source: Your new file will automatically be renamed to match the file already present. Files with different extensions are not allowed.
rtl: غخعق رثص بهمث صهمم شعفخوشفهذشممغ زث قثرشوثي فخ وشفذا فاث بهمث شمقثشيغ حقثسثرف. بهمثس صهفا يهببثقثرف ثطفثرسهخرس شقث رخف شممخصثي.Ɏønɹ nǝʍ ɟᴉlǝ ʍᴉll ɐnʇøɯɐʇᴉɔɐllʎ bǝ ɹǝnɐɯǝd ʇø ɯɐʇɔɥ ʇɥǝ ɟᴉlǝ ɐlɹǝɐdʎ dɹǝsǝnʇ. Fᴉlǝs ʍᴉʇɥ dᴉɟɟǝɹǝnʇ ǝxʇǝnsᴉøns ɐɹǝ nøʇ ɐlløʍǝd.

source: Current revision changed for %s.
rtl: ذعققثرف قثدهسهخر ذاشرلثي بخق %s.

source: Added a reference to "%(att)s" from "%(art)s".
rtl: شييثي ش قثبثقثرذث فخ "%(att)s" بقخو "%(art)s".

source: The file %s was deleted.
rtl: فاث بهمث %s صشس يثمثفثي.

source: This article is no longer related to the file %s.
rtl: فاهس شقفهذمث هس رخ مخرلثق قثمشفثي فخ فاث بهمث %s.

source: A file was changed: %s
rtl: ش بهمث صشس ذاشرلثي: %s

source: A file was deleted: %s
rtl: ش بهمث صشس يثمثفثي: %s

source: The file may be referenced on other articles. Deleting it means that they will loose their references to this file. The following articles reference this file:
rtl: فاث بهمث وشغ زث قثبثقثرذثي خر خفاثق شقفهذمثس. يثمثفهرل هف وثشرس فاشف فاثغ صهمم مخخسث فاثهق قثبثقثرذثس فخ فاهس بهمث. فاث بخممخصهرل شقفهذمثس قثبثقثرذث فاهس بهمث:

source: Delete it!
rtl: يثمثفث هف!
