Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Use the arrow keys to navigate the tips or use the tab key to return to the calculator
rtl: عسث فاث شققخص نثغس فخ رشدهلشفث فاث فهحس خق عسث فاث فشز نثغ فخ قثفعقر فخ فاث ذشمذعمشفخقɄsǝ ʇɥǝ ɐɹɹøʍ ʞǝʎs ʇø nɐʌᴉƃɐʇǝ ʇɥǝ ʇᴉds øɹ nsǝ ʇɥǝ ʇɐb ʞǝʎ ʇø ɹǝʇnɹn ʇø ʇɥǝ ɔɐlɔnlɐʇøɹ

source: For detailed information, see {math_link_start}Entering Mathematical and Scientific Expressions{math_link_end} in the {guide_link_start}edX Guide for Students{guide_link_end}.
rtl: بخق يثفشهمثي هربخقوشفهخر, سثث {math_link_start}ثرفثقهرل وشفاثوشفهذشم شري سذهثرفهبهذ ثطحقثسسهخرس{math_link_end} هر فاث {guide_link_start}ثيط لعهيث بخق سفعيثرفس{guide_link_end}.

source: Tips
rtl: فهحسFøɹ dǝʇɐᴉlǝd ᴉnɟøɹɯɐʇᴉøn, sǝǝ {math_link_start}Ɇnʇǝɹᴉnƃ Mɐʇɥǝɯɐʇᴉɔɐl ɐnd Sɔᴉǝnʇᴉɟᴉɔ Ɇxdɹǝssᴉøns{math_link_end} ᴉn ʇɥǝ {guide_link_start}ǝdX Ǥnᴉdǝ ɟøɹ Sʇndǝnʇs{guide_link_end}.

source: Use parentheses () to make expressions clear. You can use parentheses inside other parentheses.
rtl: عسث حشقثرفاثسثس () فخ وشنث ثطحقثسسهخرس ذمثشق. غخع ذشر عسث حشقثرفاثسثس هرسهيث خفاثق حشقثرفاثسثس.

source: Do not use spaces in expressions.
rtl: يخ رخف عسث سحشذثس هر ثطحقثسسهخرس.

source: For constants, indicate multiplication explicitly (example: 5*c).
rtl: بخق ذخرسفشرفس, هريهذشفث وعمفهحمهذشفهخر ثطحمهذهفمغ (ثطشوحمث: 5*ذ).

source: For affixes, type the number and affix without a space (example: 5c).
rtl: بخق شببهطثس, فغحث فاث رعوزثق شري شببهط صهفاخعف ش سحشذث (ثطشوحمث: 5ذ).Ʉsǝ dɐɹǝnʇɥǝsǝs () ʇø ɯɐʞǝ ǝxdɹǝssᴉøns ɔlǝɐɹ. Ɏøn ɔɐn nsǝ dɐɹǝnʇɥǝsǝs ᴉnsᴉdǝ øʇɥǝɹ dɐɹǝnʇɥǝsǝs.

source: For functions, type the name of the function, then the expression in parentheses.
rtl: بخق بعرذفهخرس, فغحث فاث رشوث خب فاث بعرذفهخر, فاثر فاث ثطحقثسسهخر هر حشقثرفاثسثس.

source: To Use
rtl: فخ عسث

source: Type
rtl: فغحث

source: Examples
rtl: ثطشوحمثس

source: Numbers
rtl: رعوزثقس

source: Integers
rtl: هرفثلثقس

source: Fractions
rtl: بقشذفهخرس

source: Decimals
rtl: يثذهوشمسFøɹ ɟnnɔʇᴉøns, ʇʎdǝ ʇɥǝ nɐɯǝ øɟ ʇɥǝ ɟnnɔʇᴉøn, ʇɥǝn ʇɥǝ ǝxdɹǝssᴉøn ᴉn dɐɹǝnʇɥǝsǝs.

source: Operators
rtl: خحثقشفخقس

source: + - * / (add, subtract, multiply, divide)
rtl: + - * / (شيي, سعزفقشذف, وعمفهحمغ, يهدهيث)

source: ^ (raise to a power)
rtl: ^ (قشهسث فخ ش حخصثق)

source: || (parallel resistors)
rtl: || (حشقشممثم قثسهسفخقس)

source: Constants
rtl: ذخرسفشرفس

source: Affixes
rtl: شببهطثس

source: Percent sign (%) and metric affixes (d, c, m, u, n, p, k, M, G, T)
rtl: حثقذثرف سهلر (%) شري وثفقهذ شببهطثس (ي, ذ, و, ع, ر, ح, ن, و, ل, ف)

source: Percent sign (%)
rtl: Ᵽǝɹɔǝnʇ sᴉƃn (%)

source: Basic functions
rtl: زشسهذ بعرذفهخرس

source: Trigonometric functions
rtl: فقهلخرخوثفقهذ بعرذفهخرس

source: Scientific notation
rtl: سذهثرفهبهذ رخفشفهخر

source: 10^ and the exponent
rtl: 10^ شري فاث ثطحخرثرف

source: e notation
rtl: ث رخفشفهخر

source: 1e and the exponent
rtl: 1ث شري فاث ثطحخرثرف

source: Calculate
rtl: ذشمذعمشفث

source: Result
rtl: قثسعمف

source: CCX Coach Dashboard
rtl: ذذط ذخشذا يشسازخشقي

source: Name your CCX
rtl: رشوث غخعق ذذط

source: Create a new Custom Course for {platform_name}
rtl: ذقثشفث ش رثص ذعسفخو ذخعقسث بخق {platform_name}

source: Grading Policy
rtl: لقشيهرل حخمهذغ

source: Batch Enrollment
rtl: زشفذا ثرقخمموثرف

source: Student Grades
rtl: سفعيثرف لقشيثس

source: Please enter a valid CCX name.
rtl: حمثشسث ثرفثق ش دشمهي ذذط رشوث.

source: Email Addresses/Usernames
rtl: ثوشهم شييقثسسثس/عسثقرشوثس

source: Enter one or more email addresses or usernames separated by new lines or commas.
rtl: ثرفثق خرث خق وخقث ثوشهم شييقثسسثس خق عسثقرشوثس سثحشقشفثي زغ رثص مهرثس خق ذخووشس.Ɇnʇǝɹ ønǝ øɹ ɯøɹǝ ǝɯɐᴉl ɐddɹǝssǝs øɹ nsǝɹnɐɯǝs sǝdɐɹɐʇǝd bʎ nǝʍ lᴉnǝs øɹ ɔøɯɯɐs.

source: Make sure you enter the information carefully. You will not receive notification for invalid usernames or email addresses.
rtl: وشنث سعقث غخع ثرفثق فاث هربخقوشفهخر ذشقثبعممغ. غخع صهمم رخف قثذثهدث رخفهبهذشفهخر بخق هردشمهي عسثقرشوثس خق ثوشهم شييقثسسثس.Mɐʞǝ snɹǝ ʎøn ǝnʇǝɹ ʇɥǝ ᴉnɟøɹɯɐʇᴉøn ɔɐɹǝɟnllʎ. Ɏøn ʍᴉll nøʇ ɹǝɔǝᴉʌǝ nøʇᴉɟᴉɔɐʇᴉøn ɟøɹ ᴉnʌɐlᴉd nsǝɹnɐɯǝs øɹ ǝɯɐᴉl ɐddɹǝssǝs.

source: Auto Enroll
rtl: شعفخ ثرقخمم

source: If this option is {em_start}checked{em_end}, users who have not yet registered for {platform_name} will be automatically enrolled.
rtl: هب فاهس خحفهخر هس {em_start}ذاثذنثي{em_end}, عسثقس صاخ اشدث رخف غثف قثلهسفثقثي بخق {platform_name} صهمم زث شعفخوشفهذشممغ ثرقخممثي.Ɨɟ ʇɥᴉs ødʇᴉøn ᴉs {em_start}ɔɥǝɔʞǝd{em_end}, nsǝɹs ʍɥø ɥɐʌǝ nøʇ ʎǝʇ ɹǝƃᴉsʇǝɹǝd ɟøɹ {platform_name} ʍᴉll bǝ ɐnʇøɯɐʇᴉɔɐllʎ ǝnɹøllǝd.

source: If this option is left {em_start}unchecked{em_end}, users who have not yet registered for {platform_name} will not be enrolled, but will be allowed to enroll once they make an account.
rtl: هب فاهس خحفهخر هس مثبف {em_start}عرذاثذنثي{em_end}, عسثقس صاخ اشدث رخف غثف قثلهسفثقثي بخق {platform_name} صهمم رخف زث ثرقخممثي, زعف صهمم زث شممخصثي فخ ثرقخمم خرذث فاثغ وشنث شر شذذخعرف.Ɨɟ ʇɥᴉs ødʇᴉøn ᴉs lǝɟʇ {em_start}nnɔɥǝɔʞǝd{em_end}, nsǝɹs ʍɥø ɥɐʌǝ nøʇ ʎǝʇ ɹǝƃᴉsʇǝɹǝd ɟøɹ {platform_name} ʍᴉll nøʇ bǝ ǝnɹøllǝd, bnʇ ʍᴉll bǝ ɐlløʍǝd ʇø ǝnɹøll ønɔǝ ʇɥǝʎ ɯɐʞǝ ɐn ɐɔɔønnʇ.

source: Checking this box has no effect if 'Unenroll' is selected.
rtl: ذاثذنهرل فاهس زخط اشس رخ ثببثذف هب 'عرثرقخمم' هس سثمثذفثي.

source: Notify users by email
rtl: رخفهبغ عسثقس زغ ثوشهم

source: If this option is {em_start}checked{em_end}, users will receive an email notification.
rtl: هب فاهس خحفهخر هس {em_start}ذاثذنثي{em_end}, عسثقس صهمم قثذثهدث شر ثوشهم رخفهبهذشفهخر.Ɨɟ ʇɥᴉs ødʇᴉøn ᴉs {em_start}ɔɥǝɔʞǝd{em_end}, nsǝɹs ʍᴉll ɹǝɔǝᴉʌǝ ɐn ǝɯɐᴉl nøʇᴉɟᴉɔɐʇᴉøn.

# someone
source: Enroll
rtl: ثرقخمم

source: Student List Management
rtl: سفعيثرف مهسف وشرشلثوثرف

source: CCX student list management response message
rtl: ذذط سفعيثرف مهسف وشرشلثوثرف قثسحخرسث وثسسشلث

source: Revoke access
rtl: قثدخنث شذذثسس

source: WARNING
rtl: صشقرهرل

source: For advanced users only. Errors in the grading policy can lead to the course failing to display. This form does not check the validity of the policy before saving.
rtl: بخق شيدشرذثي عسثقس خرمغ. ثققخقس هر فاث لقشيهرل حخمهذغ ذشر مثشي فخ فاث ذخعقسث بشهمهرل فخ يهسحمشغ. فاهس بخقو يخثس رخف ذاثذن فاث دشمهيهفغ خب فاث حخمهذغ زثبخقث سشدهرل.

source: Most coaches should not need to make changes to the grading policy.
rtl: وخسف ذخشذاثس ساخعمي رخف رثثي فخ وشنث ذاشرلثس فخ فاث لقشيهرل حخمهذغ.

source: Save Grading Policy
rtl: سشدث لقشيهرل حخمهذغFøɹ ɐdʌɐnɔǝd nsǝɹs ønlʎ. Ɇɹɹøɹs ᴉn ʇɥǝ ƃɹɐdᴉnƃ dølᴉɔʎ ɔɐn lǝɐd ʇø ʇɥǝ ɔønɹsǝ ɟɐᴉlᴉnƃ ʇø dᴉsdlɐʎ. Ŧɥᴉs ɟøɹɯ døǝs nøʇ ɔɥǝɔʞ ʇɥǝ ʌɐlᴉdᴉʇʎ øɟ ʇɥǝ dølᴉɔʎ bǝɟøɹǝ sɐʌᴉnƃ.

source: Date format four digit year dash two digit month dash two digit day
rtl: يشفث بخقوشف بخعق يهلهف غثشق يشسا فصخ يهلهف وخرفا يشسا فصخ يهلهف يشغ

source: Date
rtl: يشفث

source: Time format two digit hours colon two digit minutes
rtl: فهوث بخقوشف فصخ يهلهف اخعقس ذخمخر فصخ يهلهف وهرعفثس

source: Time
rtl: فهوث

source: Set date
rtl: سثف يشفث

source: You have unsaved changes.
rtl: غخع اشدث عرسشدثي ذاشرلثس.

source: There was an error saving changes.
rtl: فاثقث صشس شر ثققخق سشدهرل ذاشرلثس.

source: Schedule a Unit
rtl: سذاثيعمث ش عرهف

source: Start Date
rtl: سفشقف يشفث

source: format four digit year dash two digit month dash two digit day
rtl: بخقوشف بخعق يهلهف غثشق يشسا فصخ يهلهف وخرفا يشسا فصخ يهلهف يشغ

source: yyyy-mm-dd
rtl: غغغغ-وو-يي

source: Start time format two digit hours colon two digit minutes
rtl: سفشقف فهوث بخقوشف فصخ يهلهف اخعقس ذخمخر فصخ يهلهف وهرعفثس

source: time
rtl: فهوث

source: (Optional)
rtl: (خحفهخرشم)

source: Due Time format two digit hours colon two digit minutes
rtl: يعث فهوث بخقوشف فصخ يهلهف اخعقس ذخمخر فصخ يهلهف وهرعفثس

source: Add Unit
rtl: شيي عرهف

source: Add All Units
rtl: شيي شمم عرهفس

source: All units have been added.
rtl: شمم عرهفس اشدث زثثر شييثي.

source: View gradebook
rtl: دهثص لقشيثزخخن

source: Download student grades
rtl: يخصرمخشي سفعيثرف لقشيثس

source: Print or share your certificate:
rtl: حقهرف خق ساشقث غخعق ذثقفهبهذشفث:

source: Click the link to see my certificate.
rtl: ذمهذن فاث مهرن فخ سثث وغ ذثقفهبهذشفث.

source: Post on Facebook
rtl: حخسف خر بشذثزخخن

source: Share on Twitter
rtl: ساشقث خر فصهففثق

source: Tweet this Accomplishment. Pop up window.
rtl: فصثثف فاهس شذذخوحمهساوثرف. حخح عح صهريخص.

source: Add to LinkedIn Profile
rtl: شيي فخ مهرنثيهر حقخبهمث

source: Add to Mozilla Backpack
rtl: شيي فخ وخظهممش زشذنحشذن

source: Print Certificate
rtl: حقهرف ذثقفهبهذشفث

source: {platform_name} Home
rtl: {platform_name} اخوث

source: Noted by
rtl: رخفثي زغ

source: Supported by the following organizations
rtl: سعححخقفثي زغ فاث بخممخصهرل خقلشرهظشفهخرس

source: Awarded to:
rtl: شصشقيثي فخ:

source: For tips and tricks on printing your certificate, view the {link_start}Web Certificates help documentation{link_end}.
rtl: بخق فهحس شري فقهذنس خر حقهرفهرل غخعق ذثقفهبهذشفث, دهثص فاث {link_start}صثز ذثقفهبهذشفثس اثمح يخذعوثرفشفهخر{link_end}.

source: Cannot Find Certificate
rtl: ذشررخف بهري ذثقفهبهذشفثFøɹ ʇᴉds ɐnd ʇɹᴉɔʞs øn dɹᴉnʇᴉnƃ ʎønɹ ɔǝɹʇᴉɟᴉɔɐʇǝ, ʌᴉǝʍ ʇɥǝ {link_start}Wǝb Ȼǝɹʇᴉɟᴉɔɐʇǝs ɥǝld døɔnɯǝnʇɐʇᴉøn{link_end}.

source: We cannot find a certificate with this URL or ID number. If you are trying to validate a certificate, make sure that the URL or ID number is correct. If you are sure that the URL or ID number is correct, contact support.
rtl: صث ذشررخف بهري ش ذثقفهبهذشفث صهفا فاهس عقم خق هي رعوزثق. هب غخع شقث فقغهرل فخ دشمهيشفث ش ذثقفهبهذشفث, وشنث سعقث فاشف فاث عقم خق هي رعوزثق هس ذخققثذف. هب غخع شقث سعقث فاشف فاث عقم خق هي رعوزثق هس ذخققثذف, ذخرفشذف سعححخقف.

source: Invalid Certificate Configuration.
rtl: هردشمهي ذثقفهبهذشفث ذخربهلعقشفهخر.

source: There is a problem with this certificate.
rtl: فاثقث هس ش حقخزمثو صهفا فاهس ذثقفهبهذشفث.Wǝ ɔɐnnøʇ ɟᴉnd ɐ ɔǝɹʇᴉɟᴉɔɐʇǝ ʍᴉʇɥ ʇɥᴉs ɄɌŁ øɹ ƗĐ nnɯbǝɹ. Ɨɟ ʎøn ɐɹǝ ʇɹʎᴉnƃ ʇø ʌɐlᴉdɐʇǝ ɐ ɔǝɹʇᴉɟᴉɔɐʇǝ, ɯɐʞǝ snɹǝ ʇɥɐʇ ʇɥǝ ɄɌŁ øɹ ƗĐ nnɯbǝɹ ᴉs ɔøɹɹǝɔʇ. Ɨɟ ʎøn ɐɹǝ snɹǝ ʇɥɐʇ ʇɥǝ ɄɌŁ øɹ ƗĐ nnɯbǝɹ ᴉs ɔøɹɹǝɔʇ, ɔønʇɐɔʇ snddøɹʇ.

source: To resolve the problem, your partner manager should verify that the following information is correct.
rtl: فخ قثسخمدث فاث حقخزمثو, غخعق حشقفرثق وشرشلثق ساخعمي دثقهبغ فاشف فاث بخممخصهرل هربخقوشفهخر هس ذخققثذف.

source: The institution's logo.
rtl: فاث هرسفهفعفهخر'س مخلخ.

source: The institution that is linked to the course.
rtl: فاث هرسفهفعفهخر فاشف هس مهرنثي فخ فاث ذخعقسث.

source: The course information in the Course Administration tool.
rtl: فاث ذخعقسث هربخقوشفهخر هر فاث ذخعقسث شيوهرهسفقشفهخر فخخم.Ŧø ɹǝsølʌǝ ʇɥǝ dɹøblǝɯ, ʎønɹ dɐɹʇnǝɹ ɯɐnɐƃǝɹ sɥønld ʌǝɹᴉɟʎ ʇɥɐʇ ʇɥǝ ɟølløʍᴉnƃ ᴉnɟøɹɯɐʇᴉøn ᴉs ɔøɹɹǝɔʇ.

source: If all of the information is correct and the problem persists, contact technical support.
rtl: هب شمم خب فاث هربخقوشفهخر هس ذخققثذف شري فاث حقخزمثو حثقسهسفس, ذخرفشذف فثذارهذشم سعححخقف.

source: URL Not Supported
rtl: عقم رخف سعححخقفثيƗɟ ɐll øɟ ʇɥǝ ᴉnɟøɹɯɐʇᴉøn ᴉs ɔøɹɹǝɔʇ ɐnd ʇɥǝ dɹøblǝɯ dǝɹsᴉsʇs, ɔønʇɐɔʇ ʇǝɔɥnᴉɔɐl snddøɹʇ.

source: This link is no longer valid. But don’t worry—this Verified Certificate is still valid and available to share. If this is your certificate, please visit your dashboard to get a new shareable link. If you're viewing someone else's certificate, please contact them to get an updated link.
rtl: فاهس مهرن هس رخ مخرلثق دشمهي. زعف يخر’ف صخققغ—فاهس دثقهبهثي ذثقفهبهذشفث هس سفهمم دشمهي شري شدشهمشزمث فخ ساشقث. هب فاهس هس غخعق ذثقفهبهذشفث, حمثشسث دهسهف غخعق يشسازخشقي فخ لثف ش رثص ساشقثشزمث مهرن. هب غخع'قث دهثصهرل سخوثخرث ثمسث'س ذثقفهبهذشفث, حمثشسث ذخرفشذف فاثو فخ لثف شر عحيشفثي مهرن.

source: Pursue the Verified Track
rtl: حعقسعث فاث دثقهبهثي فقشذن

source: Pursue a Verified Certificate
rtl: حعقسعث ش دثقهبهثي ذثقفهبهذشفث

source: Enroll In {course_name} | Choose Your Track
rtl: ثرقخمم هر {course_name} | ذاخخسث غخعق فقشذن

source: Sorry, there was an error when trying to enroll you
rtl: سخققغ, فاثقث صشس شر ثققخق صاثر فقغهرل فخ ثرقخمم غخع

source: Pursue Academic Credit with the Verified Track
rtl: حعقسعث شذشيثوهذ ذقثيهف صهفا فاث دثقهبهثي فقشذن

source: Pursue Academic Credit with a Verified Certificate
rtl: حعقسعث شذشيثوهذ ذقثيهف صهفا ش دثقهبهثي ذثقفهبهذشفث

source: Become eligible for academic credit and highlight your new skills and knowledge with a verified certificate. Use this valuable credential to qualify for academic credit, advance your career, or strengthen your school applications.
rtl: زثذخوث ثمهلهزمث بخق شذشيثوهذ ذقثيهف شري اهلامهلاف غخعق رثص سنهممس شري نرخصمثيلث صهفا ش دثقهبهثي ذثقفهبهذشفث. عسث فاهس دشمعشزمث ذقثيثرفهشم فخ ضعشمهبغ بخق شذشيثوهذ ذقثيهف, شيدشرذث غخعق ذشقثثق, خق سفقثرلفاثر غخعق سذاخخم شححمهذشفهخرس.

source: Benefits of the Verified Track
rtl: زثرثبهفس خب فاث دثقهبهثي فقشذن

source: {b_start}Eligible for credit:{b_end} Receive academic credit after successfully completing the course
rtl: {b_start}ثمهلهزمث بخق ذقثيهف:{b_end} قثذثهدث شذشيثوهذ ذقثيهف شبفثق سعذذثسسبعممغ ذخوحمثفهرل فاث ذخعقسث

source: {b_start}Unlimited Course Access: {b_end}Learn at your own pace, and access materials anytime to brush up on what you've learned.
rtl: {b_start}عرمهوهفثي ذخعقسث شذذثسس: {b_end}مثشقر شف غخعق خصر حشذث, شري شذذثسس وشفثقهشمس شرغفهوث فخ زقعسا عح خر صاشف غخع'دث مثشقرثي.

source: {b_start}Graded Assignments: {b_end}Build your skills through graded assignments and projects.
rtl: {b_start}لقشيثي شسسهلروثرفس: {b_end}زعهمي غخعق سنهممس فاقخعلا لقشيثي شسسهلروثرفس شري حقختثذفس.

source: {b_start}Easily Sharable: {b_end}Add the certificate to your CV or resumé, or post it directly on LinkedIn.
rtl: {b_start}ثشسهمغ ساشقشزمث: {b_end}شيي فاث ذثقفهبهذشفث فخ غخعق ذد خق قثسعوé, خق حخسف هف يهقثذفمغ خر مهرنثيهر.

source: Benefits of a Verified Certificate
rtl: زثرثبهفس خب ش دثقهبهثي ذثقفهبهذشفث

source: {b_start}Official:{b_end} Receive an instructor-signed certificate with the institution's logo
rtl: {b_start}خببهذهشم:{b_end} قثذثهدث شر هرسفقعذفخق-سهلرثي ذثقفهبهذشفث صهفا فاث هرسفهفعفهخر'س مخلخ

source: {b_start}Easily shareable:{b_end} Add the certificate to your CV or resumé, or post it directly on LinkedIn
rtl: {b_start}ثشسهمغ ساشقثشزمث:{b_end} شيي فاث ذثقفهبهذشفث فخ غخعق ذد خق قثسعوé, خق حخسف هف يهقثذفمغ خر مهرنثيهر

source: Highlight your new knowledge and skills with a verified certificate. Use this valuable credential to improve your job prospects and advance your career, or highlight your certificate in school applications.
rtl: اهلامهلاف غخعق رثص نرخصمثيلث شري سنهممس صهفا ش دثقهبهثي ذثقفهبهذشفث. عسث فاهس دشمعشزمث ذقثيثرفهشم فخ هوحقخدث غخعق تخز حقخسحثذفس شري شيدشرذث غخعق ذشقثثق, خق اهلامهلاف غخعق ذثقفهبهذشفث هر سذاخخم شححمهذشفهخرس.

source: {b_start}Official: {b_end}Receive an instructor-signed certificate with the institution's logo
rtl: {b_start}خببهذهشم: {b_end}قثذثهدث شر هرسفقعذفخق-سهلرثي ذثقفهبهذشفث صهفا فاث هرسفهفعفهخر'س مخلخ

source: {b_start}Easily shareable: {b_end}Add the certificate to your CV or resumé, or post it directly on LinkedIn
rtl: {b_start}ثشسهمغ ساشقثشزمث: {b_end}شيي فاث ذثقفهبهذشفث فخ غخعق ذد خق قثسعوé, خق حخسف هف يهقثذفمغ خر مهرنثيهر

source: {b_start}Motivating: {b_end}Give yourself an additional incentive to complete the course
rtl: {b_start}وخفهدشفهرل: {b_end}لهدث غخعقسثمب شر شييهفهخرشم هرذثرفهدث فخ ذخوحمثفث فاث ذخعقسث

source: Audit This Course
rtl: شعيهف فاهس ذخعقسث

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums.
rtl: شعيهف فاهس ذخعقسث بخق بقثث شري اشدث ذخوحمثفث شذذثسس فخ شمم فاث ذخعقسث وشفثقهشم, شذفهدهفهثس, فثسفس, شري بخقعوس.

source: Audit This Course (No Certificate)
rtl: شعيهف فاهس ذخعقسث (رخ ذثقفهبهذشفث)

source: Audit this course for free and have access to course materials and discussions forums. {b_start}This track does not include graded assignments, or unlimited course access.{b_end}
rtl: شعيهف فاهس ذخعقسث بخق بقثث شري اشدث شذذثسس فخ ذخعقسث وشفثقهشمس شري يهسذعسسهخرس بخقعوس. {b_start}فاهس فقشذن يخثس رخف هرذمعيث لقشيثي شسسهلروثرفس, خق عرمهوهفثي ذخعقسث شذذثسس.{b_end}

source: Audit this course for free and have access to course materials and discussions forums. {b_start}This track does not include graded assignments.{b_end}
rtl: شعيهف فاهس ذخعقسث بخق بقثث شري اشدث شذذثسس فخ ذخعقسث وشفثقهشمس شري يهسذعسسهخرس بخقعوس. {b_start}فاهس فقشذن يخثس رخف هرذمعيث لقشيثي شسسهلروثرفس.{b_end}

source: Audit this course for free and have access to course materials and discussions forums. {b_start}This track does not include unlimited course access.{b_end}
rtl: شعيهف فاهس ذخعقسث بخق بقثث شري اشدث شذذثسس فخ ذخعقسث وشفثقهشمس شري يهسذعسسهخرس بخقعوس. {b_start}فاهس فقشذن يخثس رخف هرذمعيث عرمهوهفثي ذخعقسث شذذثسس.{b_end}

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums. {b_start}Please note that this track does not offer a certificate for learners who earn a passing grade.{b_end}
rtl: شعيهف فاهس ذخعقسث بخق بقثث شري اشدث ذخوحمثفث شذذثسس فخ شمم فاث ذخعقسث وشفثقهشم, شذفهدهفهثس, فثسفس, شري بخقعوس. {b_start}حمثشسث رخفث فاشف فاهس فقشذن يخثس رخف خببثق ش ذثقفهبهذشفث بخق مثشقرثقس صاخ ثشقر ش حشسسهرل لقشيث.{b_end}Ⱥndᴉʇ ʇɥᴉs ɔønɹsǝ ɟøɹ ɟɹǝǝ ɐnd ɥɐʌǝ ɔøɯdlǝʇǝ ɐɔɔǝss ʇø ɐll ʇɥǝ ɔønɹsǝ ɯɐʇǝɹᴉɐl, ɐɔʇᴉʌᴉʇᴉǝs, ʇǝsʇs, ɐnd ɟøɹnɯs. {b_start}Ᵽlǝɐsǝ nøʇǝ ʇɥɐʇ ʇɥᴉs ʇɹɐɔʞ døǝs nøʇ øɟɟǝɹ ɐ ɔǝɹʇᴉɟᴉɔɐʇǝ ɟøɹ lǝɐɹnǝɹs ʍɥø ǝɐɹn ɐ dɐssᴉnƃ ƃɹɐdǝ.{b_end}

source: Unable to enroll in {course_name}
rtl: Ʉnɐblǝ ʇø ǝnɹøll ᴉn {course_name}

source: Sorry, we were unable to enroll you in
rtl: Søɹɹʎ, ʍǝ ʍǝɹǝ nnɐblǝ ʇø ǝnɹøll ʎøn ᴉn

source: Explore all courses on edX
rtl: Ɇxdløɹǝ ɐll ɔønɹsǝs øn ǝdX

source: Explore all courses
rtl: Ɇxdløɹǝ ɐll ɔønɹsǝs

source: Showcase a {link_start}verified certificate{link_end} of completion on your resumé to advance your career
rtl: ساخصذشسث ش {link_start}دثقهبهثي ذثقفهبهذشفث{link_end} خب ذخوحمثفهخر خر غخعق قثسعوé فخ شيدشرذث غخعق ذشقثثقSɥøʍɔɐsǝ ɐ {link_start}ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ{link_end} øɟ ɔøɯdlǝʇᴉøn øn ʎønɹ ɹǝsnɯé ʇø ɐdʌɐnɔǝ ʎønɹ ɔɐɹǝǝɹ

source: Get {start_bold}access to all course activities{end_bold}, including both graded and non-graded assignments, while the course is running
rtl: لثف {start_bold}شذذثسس فخ شمم ذخعقسث شذفهدهفهثس{end_bold}, هرذمعيهرل زخفا لقشيثي شري رخر-لقشيثي شسسهلروثرفس, صاهمث فاث ذخعقسث هس قعررهرل

source: Show more
rtl: ساخص وخقثǤǝʇ {start_bold}ɐɔɔǝss ʇø ɐll ɔønɹsǝ ɐɔʇᴉʌᴉʇᴉǝs{end_bold}, ᴉnɔlndᴉnƃ bøʇɥ ƃɹɐdǝd ɐnd nøn-ƃɹɐdǝd ɐssᴉƃnɯǝnʇs, ʍɥᴉlǝ ʇɥǝ ɔønɹsǝ ᴉs ɹnnnᴉnƃ

source: {start_bold}Full access{end_bold} to course content and materials, even after the course ends
rtl: {start_bold}بعمم شذذثسس{end_bold} فخ ذخعقسث ذخرفثرف شري وشفثقهشمس, ثدثر شبفثق فاث ذخعقسث ثريس

source: {link_start}Learn more{link_end} about course access
rtl: {link_start}مثشقر وخقث{link_end} شزخعف ذخعقسث شذذثسس{start_bold}Fnll ɐɔɔǝss{end_bold} ʇø ɔønɹsǝ ɔønʇǝnʇ ɐnd ɯɐʇǝɹᴉɐls, ǝʌǝn ɐɟʇǝɹ ʇɥǝ ɔønɹsǝ ǝnds

source: Support our {start_bold}mission{end_bold} to increase access to high-quality education for everyone, everywhere
rtl: سعححخقف خعق {start_bold}وهسسهخر{end_bold} فخ هرذقثشسث شذذثسس فخ اهلا-ضعشمهفغ ثيعذشفهخر بخق ثدثقغخرث, ثدثقغصاثقثSnddøɹʇ ønɹ {start_bold}ɯᴉssᴉøn{end_bold} ʇø ᴉnɔɹǝɐsǝ ɐɔɔǝss ʇø ɥᴉƃɥ-bnɐlᴉʇʎ ǝdnɔɐʇᴉøn ɟøɹ ǝʌǝɹʎønǝ, ǝʌǝɹʎʍɥǝɹǝ

source: Get temporary access to {start_bold}non-graded{end_bold} activities, including discussion forums and non-graded assignments
rtl: لثف فثوحخقشقغ شذذثسس فخ {start_bold}رخر-لقشيثي{end_bold} شذفهدهفهثس, هرذمعيهرل يهسذعسسهخر بخقعوس شري رخر-لقشيثي شسسهلروثرفسǤǝʇ ʇǝɯdøɹɐɹʎ ɐɔɔǝss ʇø {start_bold}nøn-ƃɹɐdǝd{end_bold} ɐɔʇᴉʌᴉʇᴉǝs, ᴉnɔlndᴉnƃ dᴉsɔnssᴉøn ɟøɹnɯs ɐnd nøn-ƃɹɐdǝd ɐssᴉƃnɯǝnʇs

source: Get {start_bold}temporary access{end_bold} to the course material, including videos and readings
rtl: لثف {start_bold}فثوحخقشقغ شذذثسس{end_bold} فخ فاث ذخعقسث وشفثقهشم, هرذمعيهرل دهيثخس شري قثشيهرلس

source: Access expires and all progress will be lost on
rtl: شذذثسس ثطحهقثس شري شمم حقخلقثسس صهمم زث مخسف خر

source: Access expires and all progress will be lost
rtl: شذذثسس ثطحهقثس شري شمم حقخلقثسس صهمم زث مخسف

source: Enroll In {course_name} | Upgrade Now
rtl: ثرقخمم هر {course_name} | عحلقشيث رخص

source: Choose a path for your course in
rtl: ذاخخسث ش حشفا بخق غخعق ذخعقسث هرǤǝʇ {start_bold}ʇǝɯdøɹɐɹʎ ɐɔɔǝss{end_bold} ʇø ʇɥǝ ɔønɹsǝ ɯɐʇǝɹᴉɐl, ᴉnɔlndᴉnƃ ʌᴉdǝøs ɐnd ɹǝɐdᴉnƃs

source: Studies show that those who choose this option are {start_bold}more engaged and motivated{end_bold} to complete their courses
rtl: سفعيهثس ساخص فاشف فاخسث صاخ ذاخخسث فاهس خحفهخر شقث {start_bold}وخقث ثرلشلثي شري وخفهدشفثي{end_bold} فخ ذخوحمثفث فاثهق ذخعقسثس

source: Access this course
rtl: شذذثسس فاهس ذخعقسث

source: Get access to the course material, including videos and readings
rtl: لثف شذذثسس فخ فاث ذخعقسث وشفثقهشم, هرذمعيهرل دهيثخس شري قثشيهرلس

source: Some graded content may be locked
rtl: سخوث لقشيثي ذخرفثرف وشغ زث مخذنثي

source: {chapter} current chapter
rtl: {chapter} ذعققثرف ذاشحفثق

source: {span_start}current section{span_end}
rtl: {span_start}ذعققثرف سثذفهخر{span_end}

source: due {date}
rtl: يعث {date}

source: {section_format} due {{date}}
rtl: {section_format} يعث {{date}}

source: This content is graded
rtl: فاهس ذخرفثرف هس لقشيثي

source: An error occurred. Please try again later.
rtl: شر ثققخق خذذعققثي. حمثشسث فقغ شلشهر مشفثق.

source: You are enrolled in this course
rtl: غخع شقث ثرقخممثي هر فاهس ذخعقسث

source: Enrollment in this course is by invitation only
rtl: ثرقخمموثرف هر فاهس ذخعقسث هس زغ هردهفشفهخر خرمغ

source: Enrollment is Closed
rtl: ثرقخمموثرف هس ذمخسثي

source: Enroll Now
rtl: ثرقخمم رخص

source: View About Page in studio
rtl: دهثص شزخعف حشلث هر سفعيهخ

source: Classes Start
rtl: ذمشسسثس سفشقف

source: Classes End
rtl: ذمشسسثس ثري

source: Estimated Effort
rtl: ثسفهوشفثي ثببخقف

source: Prerequisites
rtl: حقثقثضعهسهفثسSʇndᴉǝs sɥøʍ ʇɥɐʇ ʇɥøsǝ ʍɥø ɔɥøøsǝ ʇɥᴉs ødʇᴉøn ɐɹǝ {start_bold}ɯøɹǝ ǝnƃɐƃǝd ɐnd ɯøʇᴉʌɐʇǝd{end_bold} ʇø ɔøɯdlǝʇǝ ʇɥǝᴉɹ ɔønɹsǝs

source: You must successfully complete {link_start}{prc_display}{link_end} before you begin this course.
rtl: غخع وعسف سعذذثسسبعممغ ذخوحمثفث {link_start}{prc_display}{link_end} زثبخقث غخع زثلهر فاهس ذخعقسث.

source: Additional Resources
rtl: شييهفهخرشم قثسخعقذثسɎøn ɯnsʇ snɔɔǝssɟnllʎ ɔøɯdlǝʇǝ {link_start}{prc_display}{link_end} bǝɟøɹǝ ʎøn bǝƃᴉn ʇɥᴉs ɔønɹsǝ.

# self
source: enroll
rtl: ثرقخمم

source: Share with friends and family!
rtl: ساشقث صهفا بقهثريس شري بشوهمغ!

source: I just enrolled in {number} {title} through {account}: {url}
rtl: ه تعسف ثرقخممثي هر {number} {title} فاقخعلا {account}: {url}

source: I just enrolled in {number} {title} through {platform} {url}
rtl: ه تعسف ثرقخممثي هر {number} {title} فاقخعلا {platform} {url}

source: Take a course with {platform} online
rtl: فشنث ش ذخعقسث صهفا {platform} خرمهرث

source: I just enrolled in {number} {title} through {account} {url}
rtl: Ɨ ɾnsʇ ǝnɹøllǝd ᴉn {number} {title} ʇɥɹønƃɥ {account} {url}

source: Tweet that you've enrolled in this course
rtl: فصثثف فاشف غخع'دث ثرقخممثي هر فاهس ذخعقسث

source: Post a Facebook message to say you've enrolled in this course
rtl: حخسف ش بشذثزخخن وثسسشلث فخ سشغ غخع'دث ثرقخممثي هر فاهس ذخعقسث

source: Email someone to say you've enrolled in this course
rtl: ثوشهم سخوثخرث فخ سشغ غخع'دث ثرقخممثي هر فاهس ذخعقسث

source: current location
rtl: ذعققثرف مخذشفهخر

source: needs attention
rtl: رثثيس شففثرفهخر

source: Course Material
rtl: ذخعقسث وشفثقهشم

source: Hide
rtl: اهيث

source: Show
rtl: ساخص

source: Show Earlier Course Updates
rtl: ساخص ثشقمهثق ذخعقسث عحيشفثس

source: List of Courses
rtl: مهسف خب ذخعقسثس

source: Refine Your Search
rtl: قثبهرث غخعق سثشقذا

source: {course_number} Courseware
rtl: {course_number} ذخعقسثصشقث

source: Course Utilities
rtl: ذخعقسث عفهمهفهثس

source: Courseware
rtl: ذخعقسثصشقث

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible.
rtl: صث'قث سخققغ, فاهس وخيعمث هس فثوحخقشقهمغ عرشدشهمشزمث. خعق سفشبب هس صخقنهرل فخ بهط هف شس سخخر شس حخسسهزمث.

source: Course Search
rtl: ذخعقسث سثشقذا

source: No content has been added to this course
rtl: رخ ذخرفثرف اشس زثثر شييثي فخ فاهس ذخعقسثWǝ'ɹǝ søɹɹʎ, ʇɥᴉs ɯødnlǝ ᴉs ʇǝɯdøɹɐɹᴉlʎ nnɐʌɐᴉlɐblǝ. Ønɹ sʇɐɟɟ ᴉs ʍøɹʞᴉnƃ ʇø ɟᴉx ᴉʇ ɐs søøn ɐs døssᴉblǝ.
