Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: If disabled, the discussions in the associated learning context/course will be disabled.
rtl: هب يهسشزمثي, فاث يهسذعسسهخرس هر فاث شسسخذهشفثي مثشقرهرل ذخرفثطف/ذخعقسث صهمم زث يهسشزمثي.

source: The LTI configuration data for this context/provider.
rtl: فاث مفه ذخربهلعقشفهخر يشفش بخق فاهس ذخرفثطف/حقخدهيثق.

source: The plugin configuration data for this context/provider.
rtl: فاث حمعلهر ذخربهلعقشفهخر يشفش بخق فاهس ذخرفثطف/حقخدهيثق.

source: Discussion provider
rtl: يهسذعسسهخر حقخدهيثق

source: The discussion tool/provider's id
rtl: فاث يهسذعسسهخر فخخم/حقخدهيثق'س هي

source: Program UUID
rtl: حقخلقشو ععهي

source: If disabled, the discussions in the associated program will be disabled.
rtl: هب يهسشزمثي, فاث يهسذعسسهخرس هر فاث شسسخذهشفثي حقخلقشو صهمم زث يهسشزمثي.

source: The LTI configuration data for this program/provider.
rtl: فاث مفه ذخربهلعقشفهخر يشفش بخق فاهس حقخلقشو/حقخدهيثق.

source: The discussion provider's id
rtl: فاث يهسذعسسهخر حقخدهيثق'س هيƗɟ dᴉsɐblǝd, ʇɥǝ dᴉsɔnssᴉøns ᴉn ʇɥǝ ɐssøɔᴉɐʇǝd lǝɐɹnᴉnƃ ɔønʇǝxʇ/ɔønɹsǝ ʍᴉll bǝ dᴉsɐblǝd.

source: If enabled, discussion topics will be created for each non-graded unit in the course. A UI for discussions will show up with each unit.
rtl: Ɨɟ ǝnɐblǝd, dᴉsɔnssᴉøn ʇødᴉɔs ʍᴉll bǝ ɔɹǝɐʇǝd ɟøɹ ǝɐɔɥ nøn-ƃɹɐdǝd nnᴉʇ ᴉn ʇɥǝ ɔønɹsǝ. Ⱥ ɄƗ ɟøɹ dᴉsɔnssᴉøns ʍᴉll sɥøʍ nd ʍᴉʇɥ ǝɐɔɥ nnᴉʇ.

source: If enabled, discussion topics will be created for graded units as well.
rtl: Ɨɟ ǝnɐblǝd, dᴉsɔnssᴉøn ʇødᴉɔs ʍᴉll bǝ ɔɹǝɐʇǝd ɟøɹ ƃɹɐdǝd nnᴉʇs ɐs ʍǝll.

source: If enabled, discussions will need to be manually enabled for each unit.
rtl: Ɨɟ ǝnɐblǝd, dᴉsɔnssᴉøns ʍᴉll nǝǝd ʇø bǝ ɯɐnnɐllʎ ǝnɐblǝd ɟøɹ ǝɐɔɥ nnᴉʇ.

source: Context key for context in which this discussion topic exists.
rtl: Ȼønʇǝxʇ ʞǝʎ ɟøɹ ɔønʇǝxʇ ᴉn ʍɥᴉɔɥ ʇɥᴉs dᴉsɔnssᴉøn ʇødᴉɔ ǝxᴉsʇs.

source: Usage key for in-context discussion topic. Set to null for course-level topics.
rtl: Ʉsɐƃǝ ʞǝʎ ɟøɹ ᴉn-ɔønʇǝxʇ dᴉsɔnssᴉøn ʇødᴉɔ. Sǝʇ ʇø nnll ɟøɹ ɔønɹsǝ-lǝʌǝl ʇødᴉɔs.

source: Title for discussion topic.
rtl: Ŧᴉʇlǝ ɟøɹ dᴉsɔnssᴉøn ʇødᴉɔ.

source: Group for divided discussions.
rtl: Ǥɹønd ɟøɹ dᴉʌᴉdǝd dᴉsɔnssᴉøns.

source: Provider id for discussion provider.
rtl: Ᵽɹøʌᴉdǝɹ ᴉd ɟøɹ dᴉsɔnssᴉøn dɹøʌᴉdǝɹ.

source: Discussion context ID in external forum provider. e.g. commentable_id for cs_comments_service.
rtl: Đᴉsɔnssᴉøn ɔønʇǝxʇ ƗĐ ᴉn ǝxʇǝɹnɐl ɟøɹnɯ dɹøʌᴉdǝɹ. ǝ.ƃ. ɔøɯɯǝnʇɐblǝ_ᴉd ɟøɹ ɔs_ɔøɯɯǝnʇs_sǝɹʌᴉɔǝ.

source: Whether this topic should be shown in-context in the course.
rtl: Wɥǝʇɥǝɹ ʇɥᴉs ʇødᴉɔ sɥønld bǝ sɥøʍn ᴉn-ɔønʇǝxʇ ᴉn ʇɥǝ ɔønɹsǝ.

source: Ordering of this topic in its learning context
rtl: Øɹdǝɹᴉnƃ øɟ ʇɥᴉs ʇødᴉɔ ᴉn ᴉʇs lǝɐɹnᴉnƃ ɔønʇǝxʇ

source: Encourage participation and engagement in your course with discussions.
rtl: ثرذخعقشلث حشقفهذهحشفهخر شري ثرلشلثوثرف هر غخعق ذخعقسث صهفا يهسذعسسهخرس.

source: Administrator
rtl: شيوهرهسفقشفخق

source: Moderator
rtl: وخيثقشفخق

source: Group Moderator
rtl: لقخعح وخيثقشفخقɆnɔønɹɐƃǝ dɐɹʇᴉɔᴉdɐʇᴉøn ɐnd ǝnƃɐƃǝɯǝnʇ ᴉn ʎønɹ ɔønɹsǝ ʍᴉʇɥ dᴉsɔnssᴉøns.

source: Community TA
rtl: ذخووعرهفغ فش

source: Student
rtl: سفعيثرف

source: COURSE NOT FOUND. Please check that the course ID is valid.
rtl: ذخعقسث رخف بخعري. حمثشسث ذاثذن فاشف فاث ذخعقسث هي هس دشمهي.

source: The course key for the restricted course.
rtl: فاث ذخعقسث نثغ بخق فاث قثسفقهذفثي ذخعقسث.

source: The message to show when a user is blocked from enrollment.
rtl: فاث وثسسشلث فخ ساخص صاثر ش عسثق هس زمخذنثي بقخو ثرقخمموثرف.

source: The message to show when a user is blocked from accessing a course.
rtl: فاث وثسسشلث فخ ساخص صاثر ش عسثق هس زمخذنثي بقخو شذذثسسهرل ش ذخعقسث.

source: Allow users who enrolled in an allowed country to access restricted courses from excluded countries.
rtl: شممخص عسثقس صاخ ثرقخممثي هر شر شممخصثي ذخعرفقغ فخ شذذثسس قثسفقهذفثي ذخعقسثس بقخو ثطذمعيثي ذخعرفقهثس.

source: Two character ISO country code.
rtl: فصخ ذاشقشذفثق هسخ ذخعرفقغ ذخيث.Ⱥlløʍ nsǝɹs ʍɥø ǝnɹøllǝd ᴉn ɐn ɐlløʍǝd ɔønnʇɹʎ ʇø ɐɔɔǝss ɹǝsʇɹᴉɔʇǝd ɔønɹsǝs ɟɹøɯ ǝxɔlndǝd ɔønnʇɹᴉǝs.

source: Whether to include or exclude the given course. If whitelist countries are specified, then ONLY users from whitelisted countries will be able to access the course. If blacklist countries are specified, then users from blacklisted countries will NOT be able to access the course.
rtl: صاثفاثق فخ هرذمعيث خق ثطذمعيث فاث لهدثر ذخعقسث. هب صاهفثمهسف ذخعرفقهثس شقث سحثذهبهثي, فاثر خرمغ عسثقس بقخو صاهفثمهسفثي ذخعرفقهثس صهمم زث شزمث فخ شذذثسس فاث ذخعقسث. هب زمشذنمهسف ذخعرفقهثس شقث سحثذهبهثي, فاثر عسثقس بقخو زمشذنمهسفثي ذخعرفقهثس صهمم رخف زث شزمث فخ شذذثسس فاث ذخعقسث.

source: The course to which this rule applies.
rtl: فاث ذخعقسث فخ صاهذا فاهس قعمث شححمهثس.

source: The country to which this rule applies.
rtl: فاث ذخعرفقغ فخ صاهذا فاهس قعمث شححمهثس.Wɥǝʇɥǝɹ ʇø ᴉnɔlndǝ øɹ ǝxɔlndǝ ʇɥǝ ƃᴉʌǝn ɔønɹsǝ. Ɨɟ ʍɥᴉʇǝlᴉsʇ ɔønnʇɹᴉǝs ɐɹǝ sdǝɔᴉɟᴉǝd, ʇɥǝn ØNŁɎ nsǝɹs ɟɹøɯ ʍɥᴉʇǝlᴉsʇǝd ɔønnʇɹᴉǝs ʍᴉll bǝ ɐblǝ ʇø ɐɔɔǝss ʇɥǝ ɔønɹsǝ. Ɨɟ blɐɔʞlᴉsʇ ɔønnʇɹᴉǝs ɐɹǝ sdǝɔᴉɟᴉǝd, ʇɥǝn nsǝɹs ɟɹøɯ blɐɔʞlᴉsʇǝd ɔønnʇɹᴉǝs ʍᴉll NØŦ bǝ ɐblǝ ʇø ɐɔɔǝss ʇɥǝ ɔønɹsǝ.

source: Whitelist {country} for {course}
rtl: صاهفثمهسف {country} بخق {course}

source: Blacklist {country} for {course}
rtl: زمشذنمهسف {country} بخق {course}

source: Learner Pathways
rtl: Łǝɐɹnǝɹ Ᵽɐʇɥʍɐʎs

source: Comma-separated list of scopes that this application will be allowed to request.
rtl: ذخووش-سثحشقشفثي مهسف خب سذخحثس فاشف فاهس شححمهذشفهخر صهمم زث شممخصثي فخ قثضعثسف.Ȼøɯɯɐ-sǝdɐɹɐʇǝd lᴉsʇ øɟ sɔødǝs ʇɥɐʇ ʇɥᴉs ɐddlᴉɔɐʇᴉøn ʍᴉll bǝ ɐlløʍǝd ʇø ɹǝbnǝsʇ.

source: Comma-separated list of filters that this application will be allowed to request.
rtl: ذخووش-سثحشقشفثي مهسف خب بهمفثقس فاشف فاهس شححمهذشفهخر صهمم زث شممخصثي فخ قثضعثسف.

source: Content Provider
rtl: ذخرفثرف حقخدهيثق

source: Password Policy
rtl: حشسسصخقي حخمهذغȻøɯɯɐ-sǝdɐɹɐʇǝd lᴉsʇ øɟ ɟᴉlʇǝɹs ʇɥɐʇ ʇɥᴉs ɐddlᴉɔɐʇᴉøn ʍᴉll bǝ ɐlløʍǝd ʇø ɹǝbnǝsʇ.

source: {strong_tag_open}We recently changed our password requirements{strong_tag_close}{break_line_tag}Your current password does not meet the new security requirements. We just sent a password-reset message to the email address associated with this account. Thank you for helping us keep your data safe.
rtl: {strong_tag_open}صث قثذثرفمغ ذاشرلثي خعق حشسسصخقي قثضعهقثوثرفس{strong_tag_close}{break_line_tag}غخعق ذعققثرف حشسسصخقي يخثس رخف وثثف فاث رثص سثذعقهفغ قثضعهقثوثرفس. صث تعسف سثرف ش حشسسصخقي-قثسثف وثسسشلث فخ فاث ثوشهم شييقثسس شسسخذهشفثي صهفا فاهس شذذخعرف. فاشرن غخع بخق اثمحهرل عس نثثح غخعق يشفش سشبث.{strong_tag_open}Wǝ ɹǝɔǝnʇlʎ ɔɥɐnƃǝd ønɹ dɐssʍøɹd ɹǝbnᴉɹǝɯǝnʇs{strong_tag_close}{break_line_tag}Ɏønɹ ɔnɹɹǝnʇ dɐssʍøɹd døǝs nøʇ ɯǝǝʇ ʇɥǝ nǝʍ sǝɔnɹᴉʇʎ ɹǝbnᴉɹǝɯǝnʇs. Wǝ ɾnsʇ sǝnʇ ɐ dɐssʍøɹd-ɹǝsǝʇ ɯǝssɐƃǝ ʇø ʇɥǝ ǝɯɐᴉl ɐddɹǝss ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʇɥᴉs ɐɔɔønnʇ. Ŧɥɐnʞ ʎøn ɟøɹ ɥǝldᴉnƃ ns ʞǝǝd ʎønɹ dɐʇɐ sɐɟǝ.

source: {strong_tag_open}Required Action: Please update your password{strong_tag_close}{break_line_tag}As of {deadline}, {platform_name} will require all learners to have complex passwords. Your current password does not meet these requirements. To reset your password, go to to {anchor_tag_open}Account Settings{anchor_tag_close}.
rtl: {strong_tag_open}قثضعهقثي شذفهخر: حمثشسث عحيشفث غخعق حشسسصخقي{strong_tag_close}{break_line_tag}شس خب {deadline}, {platform_name} صهمم قثضعهقث شمم مثشقرثقس فخ اشدث ذخوحمثط حشسسصخقيس. غخعق ذعققثرف حشسسصخقي يخثس رخف وثثف فاثسث قثضعهقثوثرفس. فخ قثسثف غخعق حشسسصخقي, لخ فخ فخ {anchor_tag_open}شذذخعرف سثففهرلس{anchor_tag_close}.{strong_tag_open}Ɍǝbnᴉɹǝd Ⱥɔʇᴉøn: Ᵽlǝɐsǝ nddɐʇǝ ʎønɹ dɐssʍøɹd{strong_tag_close}{break_line_tag}Ⱥs øɟ {deadline}, {platform_name} ʍᴉll ɹǝbnᴉɹǝ ɐll lǝɐɹnǝɹs ʇø ɥɐʌǝ ɔøɯdlǝx dɐssʍøɹds. Ɏønɹ ɔnɹɹǝnʇ dɐssʍøɹd døǝs nøʇ ɯǝǝʇ ʇɥǝsǝ ɹǝbnᴉɹǝɯǝnʇs. Ŧø ɹǝsǝʇ ʎønɹ dɐssʍøɹd, ƃø ʇø ʇø {anchor_tag_open}Ⱥɔɔønnʇ Sǝʇʇᴉnƃs{anchor_tag_close}.

source: The file must be smaller than {image_max_size} in size.
rtl: فاث بهمث وعسف زث سوشممثق فاشر {image_max_size} هر سهظث.

source: The file must be at least {image_min_size} in size.
rtl: فاث بهمث وعسف زث شف مثشسف {image_min_size} هر سهظث.

source: The file must be one of the following types: {valid_file_types}.
rtl: فاث بهمث وعسف زث خرث خب فاث بخممخصهرل فغحثس: {valid_file_types}.

source: The Content-Type header for this file does not match the file data. The file may be corrupted.
rtl: فاث ذخرفثرف-فغحث اثشيثق بخق فاهس بهمث يخثس رخف وشفذا فاث بهمث يشفش. فاث بهمث وشغ زث ذخققعحفثي.Ŧɥǝ Ȼønʇǝnʇ-Ŧʎdǝ ɥǝɐdǝɹ ɟøɹ ʇɥᴉs ɟᴉlǝ døǝs nøʇ ɯɐʇɔɥ ʇɥǝ ɟᴉlǝ dɐʇɐ. Ŧɥǝ ɟᴉlǝ ɯɐʎ bǝ ɔøɹɹndʇǝd.

source: The file name extension for this file does not match the file data. The file may be corrupted.
rtl: فاث بهمث رشوث ثطفثرسهخر بخق فاهس بهمث يخثس رخف وشفذا فاث بهمث يشفش. فاث بهمث وشغ زث ذخققعحفثي.

source: bytes
rtl: زغفثس

source: KB
rtl: نز

source: MB
rtl: وز

source: No file provided for profile image
rtl: رخ بهمث حقخدهيثي بخق حقخبهمث هوشلث

source: Path used to construct URLs to programs marketing pages (e.g., "/foo").
rtl: حشفا عسثي فخ ذخرسفقعذف عقمس فخ حقخلقشوس وشقنثفهرل حشلثس (ث.ل., "/بخخ").

source: Known Error Case
rtl: نرخصر ثققخق ذشسث

source: Schedule start < course start
rtl: سذاثيعمث سفشقف < ذخعقسث سفشقف

source: Course Id
rtl: ذخعقسث هي

source: All
rtl: شمم

source: Experience
rtl: ثطحثقهثرذثŦɥǝ ɟᴉlǝ nɐɯǝ ǝxʇǝnsᴉøn ɟøɹ ʇɥᴉs ɟᴉlǝ døǝs nøʇ ɯɐʇɔɥ ʇɥǝ ɟᴉlǝ dɐʇɐ. Ŧɥǝ ɟᴉlǝ ɯɐʎ bǝ ɔøɹɹndʇǝd.

source: If disabled, the LTI in the associated program will be disabled.
rtl: Ɨɟ dᴉsɐblǝd, ʇɥǝ ŁŦƗ ᴉn ʇɥǝ ɐssøɔᴉɐʇǝd dɹøƃɹɐɯ ʍᴉll bǝ dᴉsɐblǝd.

source: Course ID
rtl: ذخعقسث هي

source: Schedules
rtl: سذاثيعمثس

source: Indicates if this schedule is actively used
rtl: هريهذشفثس هب فاهس سذاثيعمث هس شذفهدثمغ عسثي

source: Date this schedule went into effect
rtl: يشفث فاهس سذاثيعمث صثرف هرفخ ثببثذف

source: Deadline by which the learner must upgrade to a verified seat
rtl: يثشيمهرث زغ صاهذا فاث مثشقرثق وعسف عحلقشيث فخ ش دثقهبهثي سثشف

source: Schedule
rtl: سذاثيعمث

source: By %(filter_title)s
rtl: زغ %(filter_title)s

source: Welcome to week %(week_num)s of %(course_name)s!
rtl: صثمذخوث فخ صثثن %(week_num)s خب %(course_name)s!

source: We hope you're enjoying {start_strong}{course_name}{end_strong}! We want to let you know what you can look forward to in week {week_num}:
rtl: صث اخحث غخع'قث ثرتخغهرل {start_strong}{course_name}{end_strong}! صث صشرف فخ مثف غخع نرخص صاشف غخع ذشر مخخن بخقصشقي فخ هر صثثن {week_num}:Wǝ ɥødǝ ʎøn'ɹǝ ǝnɾøʎᴉnƃ {start_strong}{course_name}{end_strong}! Wǝ ʍɐnʇ ʇø lǝʇ ʎøn ʞnøʍ ʍɥɐʇ ʎøn ɔɐn løøʞ ɟøɹʍɐɹd ʇø ᴉn ʍǝǝʞ {week_num}:

source: With self-paced courses, you learn on your own schedule. We encourage you to spend time with the course each week. Your focused attention will pay off in the end!
rtl: صهفا سثمب-حشذثي ذخعقسثس, غخع مثشقر خر غخعق خصر سذاثيعمث. صث ثرذخعقشلث غخع فخ سحثري فهوث صهفا فاث ذخعقسث ثشذا صثثن. غخعق بخذعسثي شففثرفهخر صهمم حشغ خبب هر فاث ثري!Wᴉʇɥ sǝlɟ-dɐɔǝd ɔønɹsǝs, ʎøn lǝɐɹn øn ʎønɹ øʍn sɔɥǝdnlǝ. Wǝ ǝnɔønɹɐƃǝ ʎøn ʇø sdǝnd ʇᴉɯǝ ʍᴉʇɥ ʇɥǝ ɔønɹsǝ ǝɐɔɥ ʍǝǝʞ. Ɏønɹ ɟøɔnsǝd ɐʇʇǝnʇᴉøn ʍᴉll dɐʎ øɟɟ ᴉn ʇɥǝ ǝnd!

source: Resume your course now
rtl: قثسعوث غخعق ذخعقسث رخص

source: We hope you're enjoying %(course_name)s! We want to let you know what you can look forward to in week %(week_num)s:
rtl: صث اخحث غخع'قث ثرتخغهرل %(course_name)s! صث صشرف فخ مثف غخع نرخص صاشف غخع ذشر مخخن بخقصشقي فخ هر صثثن %(week_num)s:Wǝ ɥødǝ ʎøn'ɹǝ ǝnɾøʎᴉnƃ %(course_name)s! Wǝ ʍɐnʇ ʇø lǝʇ ʎøn ʞnøʍ ʍɥɐʇ ʎøn ɔɐn løøʞ ɟøɹʍɐɹd ʇø ᴉn ʍǝǝʞ %(week_num)s:

source: Welcome to week %(week_num)s
rtl: صثمذخوث فخ صثثن %(week_num)s

source: We hope you're enjoying {start_strong}{course_name}{end_strong}! We want to let you know what you can look forward to in the coming weeks:
rtl: صث اخحث غخع'قث ثرتخغهرل {start_strong}{course_name}{end_strong}! صث صشرف فخ مثف غخع نرخص صاشف غخع ذشر مخخن بخقصشقي فخ هر فاث ذخوهرل صثثنس:Wǝ ɥødǝ ʎøn'ɹǝ ǝnɾøʎᴉnƃ {start_strong}{course_name}{end_strong}! Wǝ ʍɐnʇ ʇø lǝʇ ʎøn ʞnøʍ ʍɥɐʇ ʎøn ɔɐn løøʞ ɟøɹʍɐɹd ʇø ᴉn ʇɥǝ ɔøɯᴉnƃ ʍǝǝʞs:

source: We encourage you to spend time with the course each week. Your focused attention will pay off in the end!
rtl: صث ثرذخعقشلث غخع فخ سحثري فهوث صهفا فاث ذخعقسث ثشذا صثثن. غخعق بخذعسثي شففثرفهخر صهمم حشغ خبب هر فاث ثري!Wǝ ǝnɔønɹɐƃǝ ʎøn ʇø sdǝnd ʇᴉɯǝ ʍᴉʇɥ ʇɥǝ ɔønɹsǝ ǝɐɔɥ ʍǝǝʞ. Ɏønɹ ɟøɔnsǝd ɐʇʇǝnʇᴉøn ʍᴉll dɐʎ øɟɟ ᴉn ʇɥǝ ǝnd!

source: We hope you're enjoying %(course_name)s! We want to let you know what you can look forward to in the coming weeks:
rtl: صث اخحث غخع'قث ثرتخغهرل %(course_name)s! صث صشرف فخ مثف غخع نرخص صاشف غخع ذشر مخخن بخقصشقي فخ هر فاث ذخوهرل صثثنس:Wǝ ɥødǝ ʎøn'ɹǝ ǝnɾøʎᴉnƃ %(course_name)s! Wǝ ʍɐnʇ ʇø lǝʇ ʎøn ʞnøʍ ʍɥɐʇ ʎøn ɔɐn løøʞ ɟøɹʍɐɹd ʇø ᴉn ʇɥǝ ɔøɯᴉnƃ ʍǝǝʞs:

source: %(course_name)s Weekly Update
rtl: %(course_name)s صثثنمغ عحيشفث

source: Many %(platform_name)s learners are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
rtl: وشرغ %(platform_name)s مثشقرثقس شقث ذخوحمثفهرل وخقث حقخزمثوس ثدثقغ صثثن, شري حشقفهذهحشفهرل هر فاث يهسذعسسهخر بخقعوس. صاشف يخ غخع صشرف فخ يخ فخ نثثح مثشقرهرل?Mɐnʎ %(platform_name)s lǝɐɹnǝɹs ɐɹǝ ɔøɯdlǝʇᴉnƃ ɯøɹǝ dɹøblǝɯs ǝʌǝɹʎ ʍǝǝʞ, ɐnd dɐɹʇᴉɔᴉdɐʇᴉnƃ ᴉn ʇɥǝ dᴉsɔnssᴉøn ɟøɹnɯs. Wɥɐʇ dø ʎøn ʍɐnʇ ʇø dø ʇø ʞǝǝd lǝɐɹnᴉnƃ?

source: Many %(platform_name)s learners in %(course_name)s are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
rtl: وشرغ %(platform_name)s مثشقرثقس هر %(course_name)s شقث ذخوحمثفهرل وخقث حقخزمثوس ثدثقغ صثثن, شري حشقفهذهحشفهرل هر فاث يهسذعسسهخر بخقعوس. صاشف يخ غخع صشرف فخ يخ فخ نثثح مثشقرهرل?Mɐnʎ %(platform_name)s lǝɐɹnǝɹs ᴉn %(course_name)s ɐɹǝ ɔøɯdlǝʇᴉnƃ ɯøɹǝ dɹøblǝɯs ǝʌǝɹʎ ʍǝǝʞ, ɐnd dɐɹʇᴉɔᴉdɐʇᴉnƃ ᴉn ʇɥǝ dᴉsɔnssᴉøn ɟøɹnɯs. Wɥɐʇ dø ʎøn ʍɐnʇ ʇø dø ʇø ʞǝǝd lǝɐɹnᴉnƃ?

source: Keep up the momentum!
rtl: نثثح عح فاث وخوثرفعو!

source: Many {platform_name} learners in {start_strong}{course_name}{end_strong} are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
rtl: وشرغ {platform_name} مثشقرثقس هر {start_strong}{course_name}{end_strong} شقث ذخوحمثفهرل وخقث حقخزمثوس ثدثقغ صثثن, شري حشقفهذهحشفهرل هر فاث يهسذعسسهخر بخقعوس. صاشف يخ غخع صشرف فخ يخ فخ نثثح مثشقرهرل?Mɐnʎ {platform_name} lǝɐɹnǝɹs ᴉn {start_strong}{course_name}{end_strong} ɐɹǝ ɔøɯdlǝʇᴉnƃ ɯøɹǝ dɹøblǝɯs ǝʌǝɹʎ ʍǝǝʞ, ɐnd dɐɹʇᴉɔᴉdɐʇᴉnƃ ᴉn ʇɥǝ dᴉsɔnssᴉøn ɟøɹnɯs. Wɥɐʇ dø ʎøn ʍɐnʇ ʇø dø ʇø ʞǝǝd lǝɐɹnᴉnƃ?

source: Keep learning
rtl: نثثح مثشقرهرل

source: Remember when you enrolled in %(course_name)s, and other courses on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
rtl: قثوثوزثق صاثر غخع ثرقخممثي هر %(course_name)s, شري خفاثق ذخعقسثس خر %(platform_name)s? صث يخ, شري صث’قث لمشي فخ اشدث غخع! ذخوث سثث صاشف ثدثقغخرث هس مثشقرهرل.Ɍǝɯǝɯbǝɹ ʍɥǝn ʎøn ǝnɹøllǝd ᴉn %(course_name)s, ɐnd øʇɥǝɹ ɔønɹsǝs øn %(platform_name)s? Wǝ dø, ɐnd ʍǝ’ɹǝ ƃlɐd ʇø ɥɐʌǝ ʎøn! Ȼøɯǝ sǝǝ ʍɥɐʇ ǝʌǝɹʎønǝ ᴉs lǝɐɹnᴉnƃ.

source: Remember when you enrolled in %(course_name)s on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
rtl: قثوثوزثق صاثر غخع ثرقخممثي هر %(course_name)s خر %(platform_name)s? صث يخ, شري صث’قث لمشي فخ اشدث غخع! ذخوث سثث صاشف ثدثقغخرث هس مثشقرهرل.

source: Keep learning today
rtl: نثثح مثشقرهرل فخيشغɌǝɯǝɯbǝɹ ʍɥǝn ʎøn ǝnɹøllǝd ᴉn %(course_name)s øn %(platform_name)s? Wǝ dø, ɐnd ʍǝ’ɹǝ ƃlɐd ʇø ɥɐʌǝ ʎøn! Ȼøɯǝ sǝǝ ʍɥɐʇ ǝʌǝɹʎønǝ ᴉs lǝɐɹnᴉnƃ.

source: Remember when you enrolled in {start_strong}{course_name}{end_strong}, and other courses on {platform_name}? We do, and we’re glad to have you! Come see what everyone is learning.
rtl: قثوثوزثق صاثر غخع ثرقخممثي هر {start_strong}{course_name}{end_strong}, شري خفاثق ذخعقسثس خر {platform_name}? صث يخ, شري صث’قث لمشي فخ اشدث غخع! ذخوث سثث صاشف ثدثقغخرث هس مثشقرهرل.Ɍǝɯǝɯbǝɹ ʍɥǝn ʎøn ǝnɹøllǝd ᴉn {start_strong}{course_name}{end_strong}, ɐnd øʇɥǝɹ ɔønɹsǝs øn {platform_name}? Wǝ dø, ɐnd ʍǝ’ɹǝ ƃlɐd ʇø ɥɐʌǝ ʎøn! Ȼøɯǝ sǝǝ ʍɥɐʇ ǝʌǝɹʎønǝ ᴉs lǝɐɹnᴉnƃ.

source: Remember when you enrolled in {start_strong}{course_name}{end_strong} on {platform_name}? We do, and we’re glad to have you! Come see what everyone is learning.
rtl: قثوثوزثق صاثر غخع ثرقخممثي هر {start_strong}{course_name}{end_strong} خر {platform_name}? صث يخ, شري صث’قث لمشي فخ اشدث غخع! ذخوث سثث صاشف ثدثقغخرث هس مثشقرهرل.Ɍǝɯǝɯbǝɹ ʍɥǝn ʎøn ǝnɹøllǝd ᴉn {start_strong}{course_name}{end_strong} øn {platform_name}? Wǝ dø, ɐnd ʍǝ’ɹǝ ƃlɐd ʇø ɥɐʌǝ ʎøn! Ȼøɯǝ sǝǝ ʍɥɐʇ ǝʌǝɹʎønǝ ᴉs lǝɐɹnᴉnƃ.

source: Start learning now
rtl: سفشقف مثشقرهرل رخص

source: Keep learning on %(platform_name)s
rtl: نثثح مثشقرهرل خر %(platform_name)s

source: Keep learning in %(course_name)s
rtl: نثثح مثشقرهرل هر %(course_name)s

source: We hope you are enjoying learning with us so far on %(platform_name)s! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable. Upgrade by %(user_schedule_upgrade_deadline_time)s.
rtl: صث اخحث غخع شقث ثرتخغهرل مثشقرهرل صهفا عس سخ بشق خر %(platform_name)s! ش دثقهبهثي ذثقفهبهذشفث شممخصس غخع فخ اهلامهلاف غخعق رثص نرخصمثيلث شري سنهممس. شر %(platform_name)s ذثقفهبهذشفث هس خببهذهشم شري ثشسهمغ ساشقثشزمث. عحلقشيث زغ %(user_schedule_upgrade_deadline_time)s.Wǝ ɥødǝ ʎøn ɐɹǝ ǝnɾøʎᴉnƃ lǝɐɹnᴉnƃ ʍᴉʇɥ ns sø ɟɐɹ øn %(platform_name)s! Ⱥ ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ ɐlløʍs ʎøn ʇø ɥᴉƃɥlᴉƃɥʇ ʎønɹ nǝʍ ʞnøʍlǝdƃǝ ɐnd sʞᴉlls. Ⱥn %(platform_name)s ɔǝɹʇᴉɟᴉɔɐʇǝ ᴉs øɟɟᴉɔᴉɐl ɐnd ǝɐsᴉlʎ sɥɐɹǝɐblǝ. Ʉdƃɹɐdǝ bʎ %(user_schedule_upgrade_deadline_time)s.

source: We hope you are enjoying learning with us so far in %(first_course_name)s! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable. Upgrade by %(user_schedule_upgrade_deadline_time)s.
rtl: صث اخحث غخع شقث ثرتخغهرل مثشقرهرل صهفا عس سخ بشق هر %(first_course_name)s! ش دثقهبهثي ذثقفهبهذشفث شممخصس غخع فخ اهلامهلاف غخعق رثص نرخصمثيلث شري سنهممس. شر %(platform_name)s ذثقفهبهذشفث هس خببهذهشم شري ثشسهمغ ساشقثشزمث. عحلقشيث زغ %(user_schedule_upgrade_deadline_time)s.

source: Upgrade now
rtl: عحلقشيث رخصWǝ ɥødǝ ʎøn ɐɹǝ ǝnɾøʎᴉnƃ lǝɐɹnᴉnƃ ʍᴉʇɥ ns sø ɟɐɹ ᴉn %(first_course_name)s! Ⱥ ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ ɐlløʍs ʎøn ʇø ɥᴉƃɥlᴉƃɥʇ ʎønɹ nǝʍ ʞnøʍlǝdƃǝ ɐnd sʞᴉlls. Ⱥn %(platform_name)s ɔǝɹʇᴉɟᴉɔɐʇǝ ᴉs øɟɟᴉɔᴉɐl ɐnd ǝɐsᴉlʎ sɥɐɹǝɐblǝ. Ʉdƃɹɐdǝ bʎ %(user_schedule_upgrade_deadline_time)s.

source: We hope you are enjoying learning with us so far on {start_strong}%(platform_name)s{end_strong}! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable.
rtl: صث اخحث غخع شقث ثرتخغهرل مثشقرهرل صهفا عس سخ بشق خر {start_strong}%(platform_name)s{end_strong}! ش دثقهبهثي ذثقفهبهذشفث شممخصس غخع فخ اهلامهلاف غخعق رثص نرخصمثيلث شري سنهممس. شر %(platform_name)s ذثقفهبهذشفث هس خببهذهشم شري ثشسهمغ ساشقثشزمث.Wǝ ɥødǝ ʎøn ɐɹǝ ǝnɾøʎᴉnƃ lǝɐɹnᴉnƃ ʍᴉʇɥ ns sø ɟɐɹ øn {start_strong}%(platform_name)s{end_strong}! Ⱥ ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ ɐlløʍs ʎøn ʇø ɥᴉƃɥlᴉƃɥʇ ʎønɹ nǝʍ ʞnøʍlǝdƃǝ ɐnd sʞᴉlls. Ⱥn %(platform_name)s ɔǝɹʇᴉɟᴉɔɐʇǝ ᴉs øɟɟᴉɔᴉɐl ɐnd ǝɐsᴉlʎ sɥɐɹǝɐblǝ.

source: We hope you are enjoying learning with us so far in {start_strong}{first_course_name}{end_strong}! A verified certificate allows you to highlight your new knowledge and skills. An {platform_name} certificate is official and easily shareable.
rtl: صث اخحث غخع شقث ثرتخغهرل مثشقرهرل صهفا عس سخ بشق هر {start_strong}{first_course_name}{end_strong}! ش دثقهبهثي ذثقفهبهذشفث شممخصس غخع فخ اهلامهلاف غخعق رثص نرخصمثيلث شري سنهممس. شر {platform_name} ذثقفهبهذشفث هس خببهذهشم شري ثشسهمغ ساشقثشزمث.Wǝ ɥødǝ ʎøn ɐɹǝ ǝnɾøʎᴉnƃ lǝɐɹnᴉnƃ ʍᴉʇɥ ns sø ɟɐɹ ᴉn {start_strong}{first_course_name}{end_strong}! Ⱥ ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ ɐlløʍs ʎøn ʇø ɥᴉƃɥlᴉƃɥʇ ʎønɹ nǝʍ ʞnøʍlǝdƃǝ ɐnd sʞᴉlls. Ⱥn {platform_name} ɔǝɹʇᴉɟᴉɔɐʇǝ ᴉs øɟɟᴉɔᴉɐl ɐnd ǝɐsᴉlʎ sɥɐɹǝɐblǝ.

source: Upgrade by {start_strong}%(user_schedule_upgrade_deadline_time)s{end_strong}.
rtl: عحلقشيث زغ Ʉdƃɹɐdǝ bʎ {start_strong}%(user_schedule_upgrade_deadline_time)s{end_strong}.

source: You are eligible to upgrade in these courses:
rtl: غخع شقث ثمهلهزمث فخ عحلقشيث هر فاثسث ذخعقسثس:

source: Example of a verified certificate
rtl: ثطشوحمث خب ش دثقهبهثي ذثقفهبهذشفث

source: Upgrade now at
rtl: عحلقشيث رخص شف

source: Upgrade to earn a verified certificate on %(platform_name)s
rtl: عحلقشيث فخ ثشقر ش دثقهبهثي ذثقفهبهذشفث خر %(platform_name)s

source: Upgrade to earn a verified certificate in %(first_course_name)s
rtl: عحلقشيث فخ ثشقر ش دثقهبهثي ذثقفهبهذشفث هر %(first_course_name)s

source: Enable course home page improvements.
rtl: ثرشزمث ذخعقسث اخوث حشلث هوحقخدثوثرفس.

source: Site theme changed to {site_theme}
rtl: سهفث فاثوث ذاشرلثي فخ {site_theme}

source: Theme {site_theme} does not exist
rtl: فاثوث {site_theme} يخثس رخف ثطهسف

source: Site theme reverted to the default
rtl: سهفث فاثوث قثدثقفثي فخ فاث يثبشعمف

source: Theming Administration
rtl: فاثوهرل شيوهرهسفقشفهخر

source: Usernames can only contain letters (A-Z, a-z), numerals (0-9), underscores (_), and hyphens (-).
rtl: عسثقرشوثس ذشر خرمغ ذخرفشهر مثففثقس (ش-ظ, ش-ظ), رعوثقشمس (0-9), عريثقسذخقثس (_), شري اغحاثرس (-).Ʉsǝɹnɐɯǝs ɔɐn ønlʎ ɔønʇɐᴉn lǝʇʇǝɹs (Ⱥ-Ƶ, ɐ-z), nnɯǝɹɐls (0-9), nndǝɹsɔøɹǝs (_), ɐnd ɥʎdɥǝns (-).

source: Usernames can only contain letters, numerals, and @/./+/-/_ characters.
rtl: عسثقرشوثس ذشر خرمغ ذخرفشهر مثففثقس, رعوثقشمس, شري @/./+/-/_ ذاشقشذفثقس.Ʉsǝɹnɐɯǝs ɔɐn ønlʎ ɔønʇɐᴉn lǝʇʇǝɹs, nnɯǝɹɐls, ɐnd @/./+/-/_ ɔɥɐɹɐɔʇǝɹs.

source: "{email}" is not a valid email address.
rtl: "{email}" هس رخف ش دشمهي ثوشهم شييقثسس.

source: Enter a valid email address
rtl: ثرفثق ش دشمهي ثوشهم شييقثسس

source: It looks like {email_address} belongs to an existing account. Try again with a different email address.
rtl: هف مخخنس مهنث {email_address} زثمخرلس فخ شر ثطهسفهرل شذذخعرف. فقغ شلشهر صهفا ش يهببثقثرف ثوشهم شييقثسس.

source: It looks like this email address is already registered
rtl: هف مخخنس مهنث فاهس ثوشهم شييقثسس هس شمقثشيغ قثلهسفثقثيƗʇ løøʞs lᴉʞǝ {email_address} bǝlønƃs ʇø ɐn ǝxᴉsʇᴉnƃ ɐɔɔønnʇ. Ŧɹʎ ɐƃɐᴉn ʍᴉʇɥ ɐ dᴉɟɟǝɹǝnʇ ǝɯɐᴉl ɐddɹǝss.

source: This email is already associated with an existing or previous {settings.PLATFORM_NAME} account
rtl: Ŧɥᴉs ǝɯɐᴉl ᴉs ɐlɹǝɐdʎ ɐssøɔᴉɐʇǝd ʍᴉʇɥ ɐn ǝxᴉsʇᴉnƃ øɹ dɹǝʌᴉøns {settings.PLATFORM_NAME} ɐɔɔønnʇ

source: This email is associated to a retired account.
rtl: Ŧɥᴉs ǝɯɐᴉl ᴉs ɐssøɔᴉɐʇǝd ʇø ɐ ɹǝʇᴉɹǝd ɐɔɔønnʇ.

source: The password you entered is on a list of known compromised passwords. Please choose a different one.
rtl: Ŧɥǝ dɐssʍøɹd ʎøn ǝnʇǝɹǝd ᴉs øn ɐ lᴉsʇ øɟ ʞnøʍn ɔøɯdɹøɯᴉsǝd dɐssʍøɹds. Ᵽlǝɐsǝ ɔɥøøsǝ ɐ dᴉɟɟǝɹǝnʇ ønǝ.

source: It looks like {username} belongs to an existing account. Try again with a different username.
rtl: هف مخخنس مهنث {username} زثمخرلس فخ شر ثطهسفهرل شذذخعرف. فقغ شلشهر صهفا ش يهببثقثرف عسثقرشوث.

source: It looks like this username is already taken
rtl: هف مخخنس مهنث فاهس عسثقرشوث هس شمقثشيغ فشنثرƗʇ løøʞs lᴉʞǝ {username} bǝlønƃs ʇø ɐn ǝxᴉsʇᴉnƃ ɐɔɔønnʇ. Ŧɹʎ ɐƃɐᴉn ʍᴉʇɥ ɐ dᴉɟɟǝɹǝnʇ nsǝɹnɐɯǝ.

source: Username must be between {min} and {max} characters long.
rtl: عسثقرشوث وعسف زث زثفصثثر {min} شري {max} ذاشقشذفثقس مخرل.

source: Enter a valid email address that contains at least {min} characters.
rtl: ثرفثق ش دشمهي ثوشهم شييقثسس فاشف ذخرفشهرس شف مثشسف {min} ذاشقشذفثقس.

source: Enter your full name.
rtl: ثرفثق غخعق بعمم رشوث.

source: The email addresses do not match.
rtl: فاث ثوشهم شييقثسسثس يخ رخف وشفذا.

source: Select your country or region of residence.
rtl: سثمثذف غخعق ذخعرفقغ خق قثلهخر خب قثسهيثرذث.

source: Select your profession.
rtl: سثمثذف غخعق حقخبثسسهخر.

source: Select your specialty.
rtl: سثمثذف غخعق سحثذهشمفغ.

source: Enter your profession.
rtl: ثرفثق غخعق حقخبثسسهخر.

source: Enter your specialty.
rtl: ثرفثق غخعق سحثذهشمفغ.

source: Enter your city.
rtl: ثرفثق غخعق ذهفغ.

source: Tell us your goals.
rtl: فثمم عس غخعق لخشمس.

source: Select the highest level of education you have completed.
rtl: سثمثذف فاث اهلاثسف مثدثم خب ثيعذشفهخر غخع اشدث ذخوحمثفثي.
