Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: An {cert_type} certificate demonstrates a high level of achievement in a program of study, and includes verification of the student's identity.
rtl: شر {cert_type} ذثقفهبهذشفث يثوخرسفقشفثس ش اهلا مثدثم خب شذاهثدثوثرف هر ش حقخلقشو خب سفعيغ, شري هرذمعيثس دثقهبهذشفهخر خب فاث سفعيثرف'س هيثرفهفغ.Ⱥn {cert_type} ɔǝɹʇᴉɟᴉɔɐʇǝ dǝɯønsʇɹɐʇǝs ɐ ɥᴉƃɥ lǝʌǝl øɟ ɐɔɥᴉǝʌǝɯǝnʇ ᴉn ɐ dɹøƃɹɐɯ øɟ sʇndʎ, ɐnd ᴉnɔlndǝs ʌǝɹᴉɟᴉɔɐʇᴉøn øɟ ʇɥǝ sʇndǝnʇ's ᴉdǝnʇᴉʇʎ.

source: This is a valid {platform_name} certificate for {user_name}, who participated in {partner_short_name} {course_number}
rtl: فاهس هس ش دشمهي {platform_name} ذثقفهبهذشفث بخق {user_name}, صاخ حشقفهذهحشفثي هر {partner_short_name} {course_number}Ŧɥᴉs ᴉs ɐ ʌɐlᴉd {platform_name} ɔǝɹʇᴉɟᴉɔɐʇǝ ɟøɹ {user_name}, ʍɥø dɐɹʇᴉɔᴉdɐʇǝd ᴉn {partner_short_name} {course_number}

source: {partner_short_name} {course_number} Certificate | {platform_name}
rtl: {partner_short_name} {course_number} ذثقفهبهذشفث | {platform_name}

source: successfully completed, received a passing grade, and was awarded this {platform_name} {certificate_type} Certificate of Completion in
rtl: سعذذثسسبعممغ ذخوحمثفثي, قثذثهدثي ش حشسسهرل لقشيث, شري صشس شصشقيثي فاهس {platform_name} {certificate_type} ذثقفهبهذشفث خب ذخوحمثفهخر هر snɔɔǝssɟnllʎ ɔøɯdlǝʇǝd, ɹǝɔǝᴉʌǝd ɐ dɐssᴉnƃ ƃɹɐdǝ, ɐnd ʍɐs ɐʍɐɹdǝd ʇɥᴉs {platform_name} {certificate_type} Ȼǝɹʇᴉɟᴉɔɐʇǝ øɟ Ȼøɯdlǝʇᴉøn ᴉn

source: {platform_name} acknowledges achievements through certificates, which are awarded for course activities that {platform_name} students complete.
rtl: {platform_name} شذنرخصمثيلثس شذاهثدثوثرفس فاقخعلا ذثقفهبهذشفثس, صاهذا شقث شصشقيثي بخق ذخعقسث شذفهدهفهثس فاشف {platform_name} سفعيثرفس ذخوحمثفث.{platform_name} ɐɔʞnøʍlǝdƃǝs ɐɔɥᴉǝʌǝɯǝnʇs ʇɥɹønƃɥ ɔǝɹʇᴉɟᴉɔɐʇǝs, ʍɥᴉɔɥ ɐɹǝ ɐʍɐɹdǝd ɟøɹ ɔønɹsǝ ɐɔʇᴉʌᴉʇᴉǝs ʇɥɐʇ {platform_name} sʇndǝnʇs ɔøɯdlǝʇǝ.

source: All rights reserved
rtl: شمم قهلافس قثسثقدثي

source: Invalid Certificate
rtl: هردشمهي ذثقفهبهذشفث

source: Certificate Validation
rtl: ذثقفهبهذشفث دشمهيشفهخر

source: About {platform_name} Accomplishments
rtl: شزخعف {platform_name} شذذخوحمهساوثرفس

source: Issued On:
rtl: هسسعثي خر:

source: Certificate ID Number
rtl: ذثقفهبهذشفث هي رعوزثق

source: About {platform_name} Certificates
rtl: شزخعف {platform_name} ذثقفهبهذشفثس

source: How {platform_name} Validates Student Certificates
rtl: اخص {platform_name} دشمهيشفثس سفعيثرف ذثقفهبهذشفثس

source: Certificates issued by {platform_name} are signed by a gpg key so that they can be validated independently by anyone with the {platform_name} public key. For independent verification, {platform_name} uses what is called a "detached signature"&quot;".
rtl: ذثقفهبهذشفثس هسسعثي زغ {platform_name} شقث سهلرثي زغ ش لحل نثغ سخ فاشف فاثغ ذشر زث دشمهيشفثي هريثحثريثرفمغ زغ شرغخرث صهفا فاث {platform_name} حعزمهذ نثغ. بخق هريثحثريثرف دثقهبهذشفهخر, {platform_name} عسثس صاشف هس ذشممثي ش "يثفشذاثي سهلرشفعقث"&quot;".

source: Validate this certificate for yourself
rtl: دشمهيشفث فاهس ذثقفهبهذشفث بخق غخعقسثمبȻǝɹʇᴉɟᴉɔɐʇǝs ᴉssnǝd bʎ {platform_name} ɐɹǝ sᴉƃnǝd bʎ ɐ ƃdƃ ʞǝʎ sø ʇɥɐʇ ʇɥǝʎ ɔɐn bǝ ʌɐlᴉdɐʇǝd ᴉndǝdǝndǝnʇlʎ bʎ ɐnʎønǝ ʍᴉʇɥ ʇɥǝ {platform_name} dnblᴉɔ ʞǝʎ. Føɹ ᴉndǝdǝndǝnʇ ʌǝɹᴉɟᴉɔɐʇᴉøn, {platform_name} nsǝs ʍɥɐʇ ᴉs ɔɐllǝd ɐ "dǝʇɐɔɥǝd sᴉƃnɐʇnɹǝ"&quot;".

source: {platform_name} offers interactive online classes and MOOCs.
rtl: {platform_name} خببثقس هرفثقشذفهدث خرمهرث ذمشسسثس شري وخخذس.

source: About {platform_name}
rtl: شزخعف {platform_name}

source: Learn more about {platform_name}
rtl: مثشقر وخقث شزخعف {platform_name}

source: Learn with {platform_name}
rtl: مثشقر صهفا {platform_name}

source: Work at {platform_name}
rtl: صخقن شف {platform_name}

source: Contact {platform_name}
rtl: ذخرفشذف {platform_name}

source: {platform_name} acknowledges the following student accomplishment
rtl: {platform_name} شذنرخصمثيلثس فاث بخممخصهرل سفعيثرف شذذخوحمهساوثرف

source: a course of study offered by {partner_short_name}, an online learning initiative of {partner_long_name}.
rtl: ش ذخعقسث خب سفعيغ خببثقثي زغ {partner_short_name}, شر خرمهرث مثشقرهرل هرهفهشفهدث خب {partner_long_name}.ɐ ɔønɹsǝ øɟ sʇndʎ øɟɟǝɹǝd bʎ {partner_short_name}, ɐn ønlᴉnǝ lǝɐɹnᴉnƃ ᴉnᴉʇᴉɐʇᴉʌǝ øɟ {partner_long_name}.

source: a course of study offered by {partner_short_name}.
rtl: ش ذخعقسث خب سفعيغ خببثقثي زغ {partner_short_name}.

source: I completed the {course_title} course on {platform_name}.
rtl: ه ذخوحمثفثي فاث {course_title} ذخعقسث خر {platform_name}.

source: I completed a course at {platform_name}. Take a look at my certificate.
rtl: ه ذخوحمثفثي ش ذخعقسث شف {platform_name}. فشنث ش مخخن شف وغ ذثقفهبهذشفث.Ɨ ɔøɯdlǝʇǝd ɐ ɔønɹsǝ ɐʇ {platform_name}. Ŧɐʞǝ ɐ løøʞ ɐʇ ɯʎ ɔǝɹʇᴉɟᴉɔɐʇǝ.

source: More Information About {user_name}'s Certificate:
rtl: وخقث هربخقوشفهخر شزخعف {user_name}'س ذثقفهبهذشفث:

source: {fullname}, you earned a certificate!
rtl: {fullname}, غخع ثشقرثي ش ذثقفهبهذشفث!

source: Congratulations! This page summarizes what you accomplished. Show it off to family, friends, and colleagues in your social and professional networks.
rtl: ذخرلقشفعمشفهخرس! فاهس حشلث سعووشقهظثس صاشف غخع شذذخوحمهساثي. ساخص هف خبب فخ بشوهمغ, بقهثريس, شري ذخممثشلعثس هر غخعق سخذهشم شري حقخبثسسهخرشم رثفصخقنس.Ȼønƃɹɐʇnlɐʇᴉøns! Ŧɥᴉs dɐƃǝ snɯɯɐɹᴉzǝs ʍɥɐʇ ʎøn ɐɔɔøɯdlᴉsɥǝd. Sɥøʍ ᴉʇ øɟɟ ʇø ɟɐɯᴉlʎ, ɟɹᴉǝnds, ɐnd ɔøllǝɐƃnǝs ᴉn ʎønɹ søɔᴉɐl ɐnd dɹøɟǝssᴉønɐl nǝʇʍøɹʞs.

source: More about {fullname}'s accomplishment
rtl: وخقث شزخعف {fullname}'س شذذخوحمهساوثرف

source: {course_id} is not a valid course key.
rtl: {course_id} هس رخف ش دشمهي ذخعقسث نثغ.

source: Course {course_id} does not exist.
rtl: ذخعقسث {course_id} يخثس رخف ثطهسف.

source: Use the checkout page hosted by the E-Commerce service.
rtl: عسث فاث ذاثذنخعف حشلث اخسفثي زغ فاث ث-ذخووثقذث سثقدهذث.

source: Path to course(s) checkout page hosted by the E-Commerce service.
rtl: حشفا فخ ذخعقسث(س) ذاثذنخعف حشلث اخسفثي زغ فاث ث-ذخووثقذث سثقدهذث.

source: Cache Time To Live
rtl: ذشذاث فهوث فخ مهدث

source: Specified in seconds. Enable caching by setting this to a value greater than 0.
rtl: سحثذهبهثي هر سثذخريس. ثرشزمث ذشذاهرل زغ سثففهرل فاهس فخ ش دشمعث لقثشفثق فاشرSdǝɔᴉɟᴉǝd ᴉn sǝɔønds. Ɇnɐblǝ ɔɐɔɥᴉnƃ bʎ sǝʇʇᴉnƃ ʇɥᴉs ʇø ɐ ʌɐlnǝ ƃɹǝɐʇǝɹ ʇɥɐn 0.

source: Path to order receipt page.
rtl: حشفا فخ خقيثق قثذثهحف حشلث.

source: Automatically approve valid refund requests, without manual processing
rtl: شعفخوشفهذشممغ شححقخدث دشمهي قثبعري قثضعثسفس, صهفاخعف وشرعشم حقخذثسسهرل

source: [Refund] User-Requested Refund
rtl: [قثبعري] عسثق-قثضعثسفثي قثبعريȺnʇøɯɐʇᴉɔɐllʎ ɐddɹøʌǝ ʌɐlᴉd ɹǝɟnnd ɹǝbnǝsʇs, ʍᴉʇɥønʇ ɯɐnnɐl dɹøɔǝssᴉnƃ

source: A refund request has been initiated for {username} ({email}). To process this request, please visit the link(s) below.
rtl: ش قثبعري قثضعثسف اشس زثثر هرهفهشفثي بخق {username} ({email}). فخ حقخذثسس فاهس قثضعثسف, حمثشسث دهسهف فاث مهرن(س) زثمخص.

source: Earn a certificate
rtl: ثشقر ش ذثقفهبهذشفث

source: Complete the course
rtl: ذخوحمثفث فاث ذخعقسث

source: Explore the course
rtl: ثطحمخقث فاث ذخعقسث

source: Not sure yet
rtl: رخف سعقث غثفȺ ɹǝɟnnd ɹǝbnǝsʇ ɥɐs bǝǝn ᴉnᴉʇᴉɐʇǝd ɟøɹ {username} ({email}). Ŧø dɹøɔǝss ʇɥᴉs ɹǝbnǝsʇ, dlǝɐsǝ ʌᴉsᴉʇ ʇɥǝ lᴉnʞ(s) bǝløʍ.

source: There’s still time to reach your goal
rtl: Ŧɥǝɹǝ’s sʇᴉll ʇᴉɯǝ ʇø ɹǝɐɔɥ ʎønɹ ƃøɐl

source: You set a goal of learning {start_bold}%(days_per_week)s time a week in %(course_name)s{end_bold}. You’re not quite there, but there's still time to reach that goal!
rtl: Ɏøn sǝʇ ɐ ƃøɐl øɟ lǝɐɹnᴉnƃ {start_bold}%(days_per_week)s ʇᴉɯǝ ɐ ʍǝǝʞ ᴉn %(course_name)s{end_bold}. Ɏøn’ɹǝ nøʇ bnᴉʇǝ ʇɥǝɹǝ, bnʇ ʇɥǝɹǝ's sʇᴉll ʇᴉɯǝ ʇø ɹǝɐɔɥ ʇɥɐʇ ƃøɐl!

source: Jump back in
rtl: Ɉnɯd bɐɔʞ ᴉn

source: Remember, you can always change your learning goal. The best goal is one that you can stick to.
rtl: Ɍǝɯǝɯbǝɹ, ʎøn ɔɐn ɐlʍɐʎs ɔɥɐnƃǝ ʎønɹ lǝɐɹnᴉnƃ ƃøɐl. Ŧɥǝ bǝsʇ ƃøɐl ᴉs ønǝ ʇɥɐʇ ʎøn ɔɐn sʇᴉɔʞ ʇø.

source: Adjust my goal
rtl: Ⱥdɾnsʇ ɯʎ ƃøɐl

source: Unsubscribe from goal reminder emails for this course
rtl: Ʉnsnbsɔɹᴉbǝ ɟɹøɯ ƃøɐl ɹǝɯᴉndǝɹ ǝɯɐᴉls ɟøɹ ʇɥᴉs ɔønɹsǝ

source: You're almost there!
rtl: Ɏøn'ɹǝ ɐlɯøsʇ ʇɥǝɹǝ!

source: There's still time to reach your goal
rtl: Ŧɥǝɹǝ's sʇᴉll ʇᴉɯǝ ʇø ɹǝɐɔɥ ʎønɹ ƃøɐl

source: You set a goal of learning %(days_per_week)s times a week in %(course_name)s. You're not quite there, but there's still time to reach that goal!
rtl: Ɏøn sǝʇ ɐ ƃøɐl øɟ lǝɐɹnᴉnƃ %(days_per_week)s ʇᴉɯǝs ɐ ʍǝǝʞ ᴉn %(course_name)s. Ɏøn'ɹǝ nøʇ bnᴉʇǝ ʇɥǝɹǝ, bnʇ ʇɥǝɹǝ's sʇᴉll ʇᴉɯǝ ʇø ɹǝɐɔɥ ʇɥɐʇ ƃøɐl!

source: Remember, you can always change your learning goal. The best goal is one that you can stick to.
rtl: Ɍǝɯǝɯbǝɹ, ʎøn ɔɐn ɐlʍɐʎs ɔɥɐnƃǝ ʎønɹ lǝɐɹnᴉnƃ ƃøɐl. Ŧɥǝ bǝsʇ ƃøɐl ᴉs ønǝ ʇɥɐʇ ʎøn ɔɐn sʇᴉɔʞ ʇø.

source: You've almost reached your goal in %(course_name)s
rtl: Ɏøn'ʌǝ ɐlɯøsʇ ɹǝɐɔɥǝd ʎønɹ ƃøɐl ᴉn %(course_name)s

source: These define the context to disable the frontend-app-learning progress page.If no values are set, then the configuration applies globally. If a single value is set, then the configuration applies to all courses within that context. At most one value can be set at a time.<br>If multiple contexts apply to a course (for example, if configuration is specified for the course specifically, and for the org that the course is in, then the more specific context overrides the more general context.
rtl: فاثسث يثبهرث فاث ذخرفثطف فخ يهسشزمث فاث بقخرفثري-شحح-مثشقرهرل حقخلقثسس حشلث.هب رخ دشمعثس شقث سثف, فاثر فاث ذخربهلعقشفهخر شححمهثس لمخزشممغ. هب ش سهرلمث دشمعث هس سثف, فاثر فاث ذخربهلعقشفهخر شححمهثس فخ شمم ذخعقسثس صهفاهر فاشف ذخرفثطف. شف وخسف خرث دشمعث ذشر زث سثف شف ش فهوث.<br>هب وعمفهحمث ذخرفثطفس شححمغ فخ ش ذخعقسث (بخق ثطشوحمث, هب ذخربهلعقشفهخر هس سحثذهبهثي بخق فاث ذخعقسث سحثذهبهذشممغ, شري بخق فاث خقل فاشف فاث ذخعقسث هس هر, فاثر فاث وخقث سحثذهبهذ ذخرفثطف خدثققهيثس فاث وخقث لثرثقشم ذخرفثطف.Ŧɥǝsǝ dǝɟᴉnǝ ʇɥǝ ɔønʇǝxʇ ʇø dᴉsɐblǝ ʇɥǝ ɟɹønʇǝnd-ɐdd-lǝɐɹnᴉnƃ dɹøƃɹǝss dɐƃǝ.Ɨɟ nø ʌɐlnǝs ɐɹǝ sǝʇ, ʇɥǝn ʇɥǝ ɔønɟᴉƃnɹɐʇᴉøn ɐddlᴉǝs ƃløbɐllʎ. Ɨɟ ɐ sᴉnƃlǝ ʌɐlnǝ ᴉs sǝʇ, ʇɥǝn ʇɥǝ ɔønɟᴉƃnɹɐʇᴉøn ɐddlᴉǝs ʇø ɐll ɔønɹsǝs ʍᴉʇɥᴉn ʇɥɐʇ ɔønʇǝxʇ. Ⱥʇ ɯøsʇ ønǝ ʌɐlnǝ ɔɐn bǝ sǝʇ ɐʇ ɐ ʇᴉɯǝ.<br>Ɨɟ ɯnlʇᴉdlǝ ɔønʇǝxʇs ɐddlʎ ʇø ɐ ɔønɹsǝ (ɟøɹ ǝxɐɯdlǝ, ᴉɟ ɔønɟᴉƃnɹɐʇᴉøn ᴉs sdǝɔᴉɟᴉǝd ɟøɹ ʇɥǝ ɔønɹsǝ sdǝɔᴉɟᴉɔɐllʎ, ɐnd ɟøɹ ʇɥǝ øɹƃ ʇɥɐʇ ʇɥǝ ɔønɹsǝ ᴉs ᴉn, ʇɥǝn ʇɥǝ ɯøɹǝ sdǝɔᴉɟᴉɔ ɔønʇǝxʇ øʌǝɹɹᴉdǝs ʇɥǝ ɯøɹǝ ƃǝnǝɹɐl ɔønʇǝxʇ.

source: If any of these values is left empty or "Unknown", then their value at runtime will be retrieved from the next most specific context that applies. For example, if "Disabled" is left as "Unknown" in the course context, then that course will be Disabled only if the org that it is in is Disabled.
rtl: هب شرغ خب فاثسث دشمعثس هس مثبف ثوحفغ خق "عرنرخصر", فاثر فاثهق دشمعث شف قعرفهوث صهمم زث قثفقهثدثي بقخو فاث رثطف وخسف سحثذهبهذ ذخرفثطف فاشف شححمهثس. بخق ثطشوحمث, هب "يهسشزمثي" هس مثبف شس "عرنرخصر" هر فاث ذخعقسث ذخرفثطف, فاثر فاشف ذخعقسث صهمم زث يهسشزمثي خرمغ هب فاث خقل فاشف هف هس هر هس يهسشزمثي.Ɨɟ ɐnʎ øɟ ʇɥǝsǝ ʌɐlnǝs ᴉs lǝɟʇ ǝɯdʇʎ øɹ "Ʉnʞnøʍn", ʇɥǝn ʇɥǝᴉɹ ʌɐlnǝ ɐʇ ɹnnʇᴉɯǝ ʍᴉll bǝ ɹǝʇɹᴉǝʌǝd ɟɹøɯ ʇɥǝ nǝxʇ ɯøsʇ sdǝɔᴉɟᴉɔ ɔønʇǝxʇ ʇɥɐʇ ɐddlᴉǝs. Føɹ ǝxɐɯdlǝ, ᴉɟ "Đᴉsɐblǝd" ᴉs lǝɟʇ ɐs "Ʉnʞnøʍn" ᴉn ʇɥǝ ɔønɹsǝ ɔønʇǝxʇ, ʇɥǝn ʇɥɐʇ ɔønɹsǝ ʍᴉll bǝ Đᴉsɐblǝd ønlʎ ᴉɟ ʇɥǝ øɹƃ ʇɥɐʇ ᴉʇ ᴉs ᴉn ᴉs Đᴉsɐblǝd.

source: Disabled
rtl: يهسشزمثي

source: ({number} Question)
rtl: Đᴉsɐblǝd

source: Please contact your degree administrator or {platform_name} Support if you have questions.
rtl: حمثشسث ذخرفشذف غخعق يثلقثث شيوهرهسفقشفخق خق {platform_name} سعححخقف هب غخع اشدث ضعثسفهخرس.

source: 'course_id' is required.
rtl: 'ذخعقسث_هي' هس قثضعهقثي.

source: Only 'course_id' is expected.
rtl: خرمغ 'ذخعقسث_هي' هس ثطحثذفثي.

source: Welcome message successfully dismissed.
rtl: صثمذخوث وثسسشلث سعذذثسسبعممغ يهسوهسسثي.

source: Your course goal has been successfully set.
rtl: غخعق ذخعقسث لخشم اشس زثثر سعذذثسسبعممغ سثف.

source: Course goal updated successfully.
rtl: ذخعقسث لخشم عحيشفثي سعذذثسسبعممغ.

source: Course is full
rtl: Ȼønɹsǝ ᴉs ɟnll

source: Wiki
rtl: صهنه

source: Enable learners to access, and collaborate on course-related information.
rtl: ثرشزمث مثشقرثقس فخ شذذثسس, شري ذخممشزخقشفث خر ذخعقسث-قثمشفثي هربخقوشفهخر.

source: This is the wiki for **{organization}**'s _{course_name}_.
rtl: فاهس هس فاث صهنه بخق **{organization}**'س _{course_name}_.

source: Course page automatically created.
rtl: ذخعقسث حشلث شعفخوشفهذشممغ ذقثشفثي.

source: Welcome to the {platform_name} Wiki
rtl: صثمذخوث فخ فاث {platform_name} صهنه

source: Visit a course wiki to add an article.
rtl: دهسهف ش ذخعقسث صهنه فخ شيي شر شقفهذمث.

source: Course has not started
rtl: ذخعقسث اشس رخف سفشقفثي

source: Course does not start until {}
rtl: ذخعقسث يخثس رخف سفشقف عرفهم {}

source: You have unfulfilled milestones
rtl: غخع اشدث عربعمبهممثي وهمثسفخرثس

source: You do not have access to this course
rtl: غخع يخ رخف اشدث شذذثسس فخ فاهس ذخعقسث

source: You do not have access to this course on a mobile device
rtl: غخع يخ رخف اشدث شذذثسس فخ فاهس ذخعقسث خر ش وخزهمث يثدهذث

source: You must be enrolled in the course
rtl: غخع وعسف زث ثرقخممثي هر فاث ذخعقسث

source: You must be logged in to see this course
rtl: غخع وعسف زث مخللثي هر فخ سثث فاهس ذخعقسث

source: Please view your course in the existing experience
rtl: حمثشسث دهثص غخعق ذخعقسث هر فاث ثطهسفهرل ثطحثقهثرذث

source: Financial Assistance
rtl: بهرشرذهشم شسسهسفشرذث

source: Assignment
rtl: شسسهلروثرف

source: Open Response Assessment
rtl: خحثر قثسحخرسث شسسثسسوثرف

source: Self Assessment
rtl: سثمب شسسثسسوثرف

source: Peer Assessment
rtl: حثثق شسسثسسوثرف

source: Staff Assessment
rtl: سفشبب شسسثسسوثرف

source: Submission
rtl: سعزوهسسهخر

source: {course_name} is no longer available.
rtl: {course_name} ᴉs nø lønƃǝɹ ɐʌɐᴉlɐblǝ.

source: Open Response Assessment due dates are set by your instructor and can't be shifted.
rtl: خحثر قثسحخرسث شسسثسسوثرف يعث يشفثس شقث سثف زغ غخعق هرسفقعذفخق شري ذشر'ف زث ساهبفثي.Ødǝn Ɍǝsdønsǝ Ⱥssǝssɯǝnʇ dnǝ dɐʇǝs ɐɹǝ sǝʇ bʎ ʎønɹ ᴉnsʇɹnɔʇøɹ ɐnd ɔɐn'ʇ bǝ sɥᴉɟʇǝd.

source: {relative} ago - {absolute}
rtl: {relative} شلخ - {absolute}

source: in {relative} - {absolute}
rtl: هر {relative} - {absolute}

source: Enrollment Date
rtl: ثرقخمموثرف يشفث

source: Course starts
rtl: ذخعقسث سفشقفس

source: Don't forget to add a calendar reminder!
rtl: يخر'ف بخقلثف فخ شيي ش ذشمثريشق قثوهريثق!

source: Course starts in {time_remaining_string} on {course_start_date}.
rtl: ذخعقسث سفشقفس هر {time_remaining_string} خر {course_start_date}.

source: Course starts in {time_remaining_string} at {course_start_time}.
rtl: ذخعقسث سفشقفس هر {time_remaining_string} شف {course_start_time}.

source: Course ends
rtl: ذخعقسث ثريس

source: After this date, the course will be archived, which means you can review the course content but can no longer participate in graded assignments or work towards earning a certificate.
rtl: شبفثق فاهس يشفث, فاث ذخعقسث صهمم زث شقذاهدثي, صاهذا وثشرس غخع ذشر قثدهثص فاث ذخعقسث ذخرفثرف زعف ذشر رخ مخرلثق حشقفهذهحشفث هر لقشيثي شسسهلروثرفس خق صخقن فخصشقيس ثشقرهرل ش ذثقفهبهذشفث.Ⱥɟʇǝɹ ʇɥᴉs dɐʇǝ, ʇɥǝ ɔønɹsǝ ʍᴉll bǝ ɐɹɔɥᴉʌǝd, ʍɥᴉɔɥ ɯǝɐns ʎøn ɔɐn ɹǝʌᴉǝʍ ʇɥǝ ɔønɹsǝ ɔønʇǝnʇ bnʇ ɔɐn nø lønƃǝɹ dɐɹʇᴉɔᴉdɐʇǝ ᴉn ƃɹɐdǝd ɐssᴉƃnɯǝnʇs øɹ ʍøɹʞ ʇøʍɐɹds ǝɐɹnᴉnƃ ɐ ɔǝɹʇᴉɟᴉɔɐʇǝ.

source: After the course ends, the course content will be archived and no longer active.
rtl: شبفثق فاث ذخعقسث ثريس, فاث ذخعقسث ذخرفثرف صهمم زث شقذاهدثي شري رخ مخرلثق شذفهدث.Ⱥɟʇǝɹ ʇɥǝ ɔønɹsǝ ǝnds, ʇɥǝ ɔønɹsǝ ɔønʇǝnʇ ʍᴉll bǝ ɐɹɔɥᴉʌǝd ɐnd nø lønƃǝɹ ɐɔʇᴉʌǝ.

source: This course is archived, which means you can review course content but it is no longer active.
rtl: فاهس ذخعقسث هس شقذاهدثي, صاهذا وثشرس غخع ذشر قثدهثص ذخعقسث ذخرفثرف زعف هف هس رخ مخرلثق شذفهدث.

source: This course is ending in {time_remaining_string} on {course_end_date}.
rtl: فاهس ذخعقسث هس ثريهرل هر {time_remaining_string} خر {course_end_date}.

source: This course is ending in {time_remaining_string} at {course_end_time}.
rtl: فاهس ذخعقسث هس ثريهرل هر {time_remaining_string} شف {course_end_time}.

source: You lose all access to this course, including your progress.
rtl: غخع مخسث شمم شذذثسس فخ فاهس ذخعقسث, هرذمعيهرل غخعق حقخلقثسس.

source: Audit Access Expires
rtl: شعيهف شذذثسس ثطحهقثس

source: Certificate Available
rtl: ذثقفهبهذشفث شدشهمشزمث

source: Day certificates will become available for passing verified learners.
rtl: يشغ ذثقفهبهذشفثس صهمم زثذخوث شدشهمشزمث بخق حشسسهرل دثقهبهثي مثشقرثقس.

source: If you have earned a certificate, you will be able to access it {time_remaining_string} from now. You will also be able to view your certificates on your {learner_profile_link}.
rtl: هب غخع اشدث ثشقرثي ش ذثقفهبهذشفث, غخع صهمم زث شزمث فخ شذذثسس هف {time_remaining_string} بقخو رخص. غخع صهمم شمسخ زث شزمث فخ دهثص غخعق ذثقفهبهذشفثس خر غخعق {learner_profile_link}.

source: Learner Profile
rtl: مثشقرثق حقخبهمث

source: We are working on generating course certificates.
rtl: صث شقث صخقنهرل خر لثرثقشفهرل ذخعقسث ذثقفهبهذشفثس.

source: Upgrade to Verified Certificate
rtl: عحلقشيث فخ دثقهبهثي ذثقفهبهذشفث

source: Verification Upgrade Deadline
rtl: دثقهبهذشفهخر عحلقشيث يثشيمهرثŦɥᴉs ɔønɹsǝ ᴉs ɐɹɔɥᴉʌǝd, ʍɥᴉɔɥ ɯǝɐns ʎøn ɔɐn ɹǝʌᴉǝʍ ɔønɹsǝ ɔønʇǝnʇ bnʇ ᴉʇ ᴉs nø lønƃǝɹ ɐɔʇᴉʌǝ.

source: Don't miss the opportunity to highlight your new knowledge and skills by earning a verified certificate.
rtl: يخر'ف وهسس فاث خححخقفعرهفغ فخ اهلامهلاف غخعق رثص نرخصمثيلث شري سنهممس زغ ثشقرهرل ش دثقهبهثي ذثقفهبهذشفث.Đøn'ʇ ɯᴉss ʇɥǝ øddøɹʇnnᴉʇʎ ʇø ɥᴉƃɥlᴉƃɥʇ ʎønɹ nǝʍ ʞnøʍlǝdƃǝ ɐnd sʞᴉlls bʎ ǝɐɹnᴉnƃ ɐ ʌǝɹᴉɟᴉǝd ɔǝɹʇᴉɟᴉɔɐʇǝ.

source: You are still eligible to upgrade to a Verified Certificate! Pursue it to highlight the knowledge and skills you gain in this course.
rtl: غخع شقث سفهمم ثمهلهزمث فخ عحلقشيث فخ ش دثقهبهثي ذثقفهبهذشفث! حعقسعث هف فخ اهلامهلاف فاث نرخصمثيلث شري سنهممس غخع لشهر هر فاهس ذخعقسث.Ɏøn ɐɹǝ sʇᴉll ǝlᴉƃᴉblǝ ʇø ndƃɹɐdǝ ʇø ɐ Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝ! Ᵽnɹsnǝ ᴉʇ ʇø ɥᴉƃɥlᴉƃɥʇ ʇɥǝ ʞnøʍlǝdƃǝ ɐnd sʞᴉlls ʎøn ƃɐᴉn ᴉn ʇɥᴉs ɔønɹsǝ.

source: by {date}
rtl: زغ {date}

source: Don't forget, you have {time_remaining_string} left to upgrade to a Verified Certificate.
rtl: يخر'ف بخقلثف, غخع اشدث {time_remaining_string} مثبف فخ عحلقشيث فخ ش دثقهبهثي ذثقفهبهذشفث.

source: Don't forget to upgrade to a verified certificate by {localized_date}.
rtl: يخر'ف بخقلثف فخ عحلقشيث فخ ش دثقهبهثي ذثقفهبهذشفث زغ {localized_date}.

source: In order to qualify for a certificate, you must meet all course grading requirements, upgrade before the course deadline, and successfully verify your identity on {platform_name} if you have not done so already.{button_panel}
rtl: هر خقيثق فخ ضعشمهبغ بخق ش ذثقفهبهذشفث, غخع وعسف وثثف شمم ذخعقسث لقشيهرل قثضعهقثوثرفس, عحلقشيث زثبخقث فاث ذخعقسث يثشيمهرث, شري سعذذثسسبعممغ دثقهبغ غخعق هيثرفهفغ خر {platform_name} هب غخع اشدث رخف يخرث سخ شمقثشيغ.{button_panel}

source: Upgrade ({upgrade_price})
rtl: عحلقشيث ({upgrade_price})

source: Learn More
rtl: مثشقر وخقث

source: Retry Verification
rtl: قثفقغ دثقهبهذشفهخر

source: Verify My Identity
rtl: دثقهبغ وغ هيثرفهفغ

source: Missed Verification Deadline
rtl: وهسسثي دثقهبهذشفهخر يثشيمهرث

source: Unfortunately you missed this course's deadline for a successful verification.
rtl: عربخقفعرشفثمغ غخع وهسسثي فاهس ذخعقسث'س يثشيمهرث بخق ش سعذذثسسبعم دثقهبهذشفهخر.Ʉnɟøɹʇnnɐʇǝlʎ ʎøn ɯᴉssǝd ʇɥᴉs ɔønɹsǝ's dǝɐdlᴉnǝ ɟøɹ ɐ snɔɔǝssɟnl ʌǝɹᴉɟᴉɔɐʇᴉøn.

source: You must successfully complete verification before this date to qualify for a Verified Certificate.
rtl: غخع وعسف سعذذثسسبعممغ ذخوحمثفث دثقهبهذشفهخر زثبخقث فاهس يشفث فخ ضعشمهبغ بخق ش دثقهبهثي ذثقفهبهذشفث.Ɏøn ɯnsʇ snɔɔǝssɟnllʎ ɔøɯdlǝʇǝ ʌǝɹᴉɟᴉɔɐʇᴉøn bǝɟøɹǝ ʇɥᴉs dɐʇǝ ʇø bnɐlᴉɟʎ ɟøɹ ɐ Vǝɹᴉɟᴉǝd Ȼǝɹʇᴉɟᴉɔɐʇǝ.

source: There is no user with the username or email address "{user_identifier}" enrolled in this course.
rtl: فاثقث هس رخ عسثق صهفا فاث عسثقرشوث خق ثوشهم شييقثسس "{user_identifier}" ثرقخممثي هر فاهس ذخعقسث.Ŧɥǝɹǝ ᴉs nø nsǝɹ ʍᴉʇɥ ʇɥǝ nsǝɹnɐɯǝ øɹ ǝɯɐᴉl ɐddɹǝss "{user_identifier}" ǝnɹøllǝd ᴉn ʇɥᴉs ɔønɹsǝ.

source: This user does not have access to this content because the content start date is in the future
rtl: فاهس عسثق يخثس رخف اشدث شذذثسس فخ فاهس ذخرفثرف زثذشعسث فاث ذخرفثرف سفشقف يشفث هس هر فاث بعفعقثŦɥᴉs nsǝɹ døǝs nøʇ ɥɐʌǝ ɐɔɔǝss ʇø ʇɥᴉs ɔønʇǝnʇ bǝɔɐnsǝ ʇɥǝ ɔønʇǝnʇ sʇɐɹʇ dɐʇǝ ᴉs ᴉn ʇɥǝ ɟnʇnɹǝ

source: This type of component cannot be shown while viewing the course as a specific student.
rtl: فاهس فغحث خب ذخوحخرثرف ذشررخف زث ساخصر صاهمث دهثصهرل فاث ذخعقسث شس ش سحثذهبهذ سفعيثرف.Ŧɥᴉs ʇʎdǝ øɟ ɔøɯdønǝnʇ ɔɐnnøʇ bǝ sɥøʍn ʍɥᴉlǝ ʌᴉǝʍᴉnƃ ʇɥǝ ɔønɹsǝ ɐs ɐ sdǝɔᴉɟᴉɔ sʇndǝnʇ.

source: Number of days a learner has to upgrade after content is made available
rtl: رعوزثق خب يشغس ش مثشقرثق اشس فخ عحلقشيث شبفثق ذخرفثرف هس وشيث شدشهمشزمث

source: Disable the dynamic upgrade deadline for this course run.
rtl: يهسشزمث فاث يغرشوهذ عحلقشيث يثشيمهرث بخق فاهس ذخعقسث قعر.

source: Disable the dynamic upgrade deadline for this organization.
rtl: يهسشزمث فاث يغرشوهذ عحلقشيث يثشيمهرث بخق فاهس خقلشرهظشفهخر.Nnɯbǝɹ øɟ dɐʎs ɐ lǝɐɹnǝɹ ɥɐs ʇø ndƃɹɐdǝ ɐɟʇǝɹ ɔønʇǝnʇ ᴉs ɯɐdǝ ɐʌɐᴉlɐblǝ

source: Internal API Base URL
rtl: Ɨnʇǝɹnɐl ȺⱣƗ Ƀɐsǝ ɄɌŁ

source: Financial Assistance Backend API Base URL.
rtl: Fᴉnɐnɔᴉɐl Ⱥssᴉsʇɐnɔǝ Ƀɐɔʞǝnd ȺⱣƗ Ƀɐsǝ ɄɌŁ.

source: Username created for Financial Assistance Backend, e.g. financial_assistance_service_user.
rtl: Ʉsǝɹnɐɯǝ ɔɹǝɐʇǝd ɟøɹ Fᴉnɐnɔᴉɐl Ⱥssᴉsʇɐnɔǝ Ƀɐɔʞǝnd, ǝ.ƃ. ɟᴉnɐnɔᴉɐl_ɐssᴉsʇɐnɔǝ_sǝɹʌᴉɔǝ_nsǝɹ.

source: Percentage of courses allowed to use edx-financial-assistance
rtl: Ᵽǝɹɔǝnʇɐƃǝ øɟ ɔønɹsǝs ɐlløʍǝd ʇø nsǝ ǝdx-ɟᴉnɐnɔᴉɐl-ɐssᴉsʇɐnɔǝ

source: Progress
rtl: حقخلقثسس

source: Keep learners engaged and on track throughout the course.
rtl: نثثح مثشقرثقس ثرلشلثي شري خر فقشذن فاقخعلاخعف فاث ذخعقسث.

source: Textbooks
rtl: فثطفزخخنس

source: Create and manage a library of course readings, textbooks, and chapters.
rtl: ذقثشفث شري وشرشلث ش مهزقشقغ خب ذخعقسث قثشيهرلس, فثطفزخخنس, شري ذاشحفثقس.

source: Calculator
rtl: ذشمذعمشفخق

source: Provide an in-course calculator for simple and complex calculations.
rtl: حقخدهيث شر هر-ذخعقسث ذشمذعمشفخق بخق سهوحمث شري ذخوحمثط ذشمذعمشفهخرس.

source: Proctoring
rtl: حقخذفخقهرلȻɹǝɐʇǝ ɐnd ɯɐnɐƃǝ ɐ lᴉbɹɐɹʎ øɟ ɔønɹsǝ ɹǝɐdᴉnƃs, ʇǝxʇbøøʞs, ɐnd ɔɥɐdʇǝɹs.

source: Maintain exam integrity by enabling a proctoring solution for your course
rtl: وشهرفشهر ثطشو هرفثلقهفغ زغ ثرشزمهرل ش حقخذفخقهرل سخمعفهخر بخق غخعق ذخعقسث

source: Custom pages
rtl: ذعسفخو حشلثس

source: Provide additional course content and resources with custom pages
rtl: حقخدهيث شييهفهخرشم ذخعقسث ذخرفثرف شري قثسخعقذثس صهفا ذعسفخو حشلثس

source: Syllabus
rtl: سغممشزعس

source: Dates
rtl: يشفثسMɐᴉnʇɐᴉn ǝxɐɯ ᴉnʇǝƃɹᴉʇʎ bʎ ǝnɐblᴉnƃ ɐ dɹøɔʇøɹᴉnƃ sølnʇᴉøn ɟøɹ ʎønɹ ɔønɹsǝ

source: You are not signed in. To see additional course content, {sign_in_link} or {register_link}, and enroll in this course.
rtl: غخع شقث رخف سهلرثي هر. فخ سثث شييهفهخرشم ذخعقسث ذخرفثرف, {sign_in_link} خق {register_link}, شري ثرقخمم هر فاهس ذخعقسث.Ɏøn ɐɹǝ nøʇ sᴉƃnǝd ᴉn. Ŧø sǝǝ ɐddᴉʇᴉønɐl ɔønɹsǝ ɔønʇǝnʇ, {sign_in_link} øɹ {register_link}, ɐnd ǝnɹøll ᴉn ʇɥᴉs ɔønɹsǝ.

source: sign in
rtl: سهلر هر

source: register
rtl: قثلهسفثق

source: Your enrollment: Audit track
rtl: غخعق ثرقخمموثرف: شعيهف فقشذن

source: You are enrolled in the audit track for this course. The audit track does not include a certificate.
rtl: غخع شقث ثرقخممثي هر فاث شعيهف فقشذن بخق فاهس ذخعقسث. فاث شعيهف فقشذن يخثس رخف هرذمعيث ش ذثقفهبهذشفث.

source: Your enrollment: Honor track
rtl: غخعق ثرقخمموثرف: اخرخق فقشذنɎøn ɐɹǝ ǝnɹøllǝd ᴉn ʇɥǝ ɐndᴉʇ ʇɹɐɔʞ ɟøɹ ʇɥᴉs ɔønɹsǝ. Ŧɥǝ ɐndᴉʇ ʇɹɐɔʞ døǝs nøʇ ᴉnɔlndǝ ɐ ɔǝɹʇᴉɟᴉɔɐʇǝ.

source: You are enrolled in the honor track for this course. The honor track does not include a certificate.
rtl: غخع شقث ثرقخممثي هر فاث اخرخق فقشذن بخق فاهس ذخعقسث. فاث اخرخق فقشذن يخثس رخف هرذمعيث ش ذثقفهبهذشفث.

source: We're working on it...
rtl: صث'قث صخقنهرل خر هف...Ɏøn ɐɹǝ ǝnɹøllǝd ᴉn ʇɥǝ ɥønøɹ ʇɹɐɔʞ ɟøɹ ʇɥᴉs ɔønɹsǝ. Ŧɥǝ ɥønøɹ ʇɹɐɔʞ døǝs nøʇ ᴉnɔlndǝ ɐ ɔǝɹʇᴉɟᴉɔɐʇǝ.
