Repository: chandrudev/edx-platform
Catalog: conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Student {user} is not enrolled in this course. Please check your spelling and retry.
rtl: سفعيثرف {user} هس رخف ثرقخممثي هر فاهس ذخعقسث. حمثشسث ذاثذن غخعق سحثممهرل شري قثفقغ.Sʇndǝnʇ {user} ᴉs nøʇ ǝnɹøllǝd ᴉn ʇɥᴉs ɔønɹsǝ. Ᵽlǝɐsǝ ɔɥǝɔʞ ʎønɹ sdǝllᴉnƃ ɐnd ɹǝʇɹʎ.

source: Student {user} is already on the certificate invalidation list and cannot be added to the certificate exception list.
rtl: سفعيثرف {user} هس شمقثشيغ خر فاث ذثقفهبهذشفث هردشمهيشفهخر مهسف شري ذشررخف زث شييثي فخ فاث ذثقفهبهذشفث ثطذثحفهخر مهسف.Sʇndǝnʇ {user} ᴉs ɐlɹǝɐdʎ øn ʇɥǝ ɔǝɹʇᴉɟᴉɔɐʇǝ ᴉnʌɐlᴉdɐʇᴉøn lᴉsʇ ɐnd ɔɐnnøʇ bǝ ɐddǝd ʇø ʇɥǝ ɔǝɹʇᴉɟᴉɔɐʇǝ ǝxɔǝdʇᴉøn lᴉsʇ.

source: Student (username/email={user}) already in certificate exception list.
rtl: سفعيثرف (عسثقرشوث/ثوشهم={user}) شمقثشيغ هر ذثقفهبهذشفث ثطذثحفهخر مهسف.Sʇndǝnʇ (nsǝɹnɐɯǝ/ǝɯɐᴉl={user}) ɐlɹǝɐdʎ ᴉn ɔǝɹʇᴉɟᴉɔɐʇǝ ǝxɔǝdʇᴉøn lᴉsʇ.

source: Error occurred removing the allowlist entry for student {student}. Please refresh the page and try again
rtl: ثققخق خذذعققثي قثوخدهرل فاث شممخصمهسف ثرفقغ بخق سفعيثرف {student}. حمثشسث قثبقثسا فاث حشلث شري فقغ شلشهرɆɹɹøɹ øɔɔnɹɹǝd ɹǝɯøʌᴉnƃ ʇɥǝ ɐlløʍlᴉsʇ ǝnʇɹʎ ɟøɹ sʇndǝnʇ {student}. Ᵽlǝɐsǝ ɹǝɟɹǝsɥ ʇɥǝ dɐƃǝ ɐnd ʇɹʎ ɐƃɐᴉn

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
rtl: سفعيثرف عسثقرشوث/ثوشهم بهثمي هس قثضعهقثي شري ذشر رخف زث ثوحفغ. نهريمغ بهمم هر عسثقرشوث/ثوشهم شري فاثر حقثسس "شيي فخ ثطذثحفهخر مهسف" زعففخر.Sʇndǝnʇ nsǝɹnɐɯǝ/ǝɯɐᴉl ɟᴉǝld ᴉs ɹǝbnᴉɹǝd ɐnd ɔɐn nøʇ bǝ ǝɯdʇʎ. Ꝁᴉndlʎ ɟᴉll ᴉn nsǝɹnɐɯǝ/ǝɯɐᴉl ɐnd ʇɥǝn dɹǝss "Ⱥdd ʇø Ɇxɔǝdʇᴉøn Łᴉsʇ" bnʇʇøn.

source: The record is not in the correct format. Please add a valid username or email address.
rtl: فاث قثذخقي هس رخف هر فاث ذخققثذف بخقوشف. حمثشسث شيي ش دشمهي عسثقرشوث خق ثوشهم شييقثسس.Ŧɥǝ ɹǝɔøɹd ᴉs nøʇ ᴉn ʇɥǝ ɔøɹɹǝɔʇ ɟøɹɯɐʇ. Ᵽlǝɐsǝ ɐdd ɐ ʌɐlᴉd nsǝɹnɐɯǝ øɹ ǝɯɐᴉl ɐddɹǝss.

source: {user} does not exist in the LMS. Please check your spelling and retry.
rtl: {user} يخثس رخف ثطهسف هر فاث موس. حمثشسث ذاثذن غخعق سحثممهرل شري قثفقغ.

source: Invalid data, generate_for must be "new" or "all".
rtl: هردشمهي يشفش, لثرثقشفث_بخق وعسف زث "رثص" خق "شمم".

source: Certificate generation started for students on the allowlist.
rtl: ذثقفهبهذشفث لثرثقشفهخر سفشقفثي بخق سفعيثرفس خر فاث شممخصمهسف.{user} døǝs nøʇ ǝxᴉsʇ ᴉn ʇɥǝ ŁMS. Ᵽlǝɐsǝ ɔɥǝɔʞ ʎønɹ sdǝllᴉnƃ ɐnd ɹǝʇɹʎ.

source: user "{user}" in row# {row}
rtl: عسثق "{user}" هر قخص# {row}

source: user "{username}" in row# {row}
rtl: عسثق "{username}" هر قخص# {row}

source: The student {student} appears on the Certificate Exception list in course {course}. Please remove them from the Certificate Exception list before attempting to invalidate their certificate.
rtl: فاث سفعيثرف {student} شححثشقس خر فاث ذثقفهبهذشفث ثطذثحفهخر مهسف هر ذخعقسث {course}. حمثشسث قثوخدث فاثو بقخو فاث ذثقفهبهذشفث ثطذثحفهخر مهسف زثبخقث شففثوحفهرل فخ هردشمهيشفث فاثهق ذثقفهبهذشفث.Ŧɥǝ sʇndǝnʇ {student} ɐddǝɐɹs øn ʇɥǝ Ȼǝɹʇᴉɟᴉɔɐʇǝ Ɇxɔǝdʇᴉøn lᴉsʇ ᴉn ɔønɹsǝ {course}. Ᵽlǝɐsǝ ɹǝɯøʌǝ ʇɥǝɯ ɟɹøɯ ʇɥǝ Ȼǝɹʇᴉɟᴉɔɐʇǝ Ɇxɔǝdʇᴉøn lᴉsʇ bǝɟøɹǝ ɐʇʇǝɯdʇᴉnƃ ʇø ᴉnʌɐlᴉdɐʇǝ ʇɥǝᴉɹ ɔǝɹʇᴉɟᴉɔɐʇǝ.

source: Certificate of {user} has already been invalidated. Please check your spelling and retry.
rtl: ذثقفهبهذشفث خب {user} اشس شمقثشيغ زثثر هردشمهيشفثي. حمثشسث ذاثذن غخعق سحثممهرل شري قثفقغ.Ȼǝɹʇᴉɟᴉɔɐʇǝ øɟ {user} ɥɐs ɐlɹǝɐdʎ bǝǝn ᴉnʌɐlᴉdɐʇǝd. Ᵽlǝɐsǝ ɔɥǝɔʞ ʎønɹ sdǝllᴉnƃ ɐnd ɹǝʇɹʎ.

source: Certificate for student {user} is already invalid, kindly verify that certificate was generated for this student and then proceed.
rtl: ذثقفهبهذشفث بخق سفعيثرف {user} هس شمقثشيغ هردشمهي, نهريمغ دثقهبغ فاشف ذثقفهبهذشفث صشس لثرثقشفثي بخق فاهس سفعيثرف شري فاثر حقخذثثي.Ȼǝɹʇᴉɟᴉɔɐʇǝ ɟøɹ sʇndǝnʇ {user} ᴉs ɐlɹǝɐdʎ ᴉnʌɐlᴉd, ʞᴉndlʎ ʌǝɹᴉɟʎ ʇɥɐʇ ɔǝɹʇᴉɟᴉɔɐʇǝ ʍɐs ƃǝnǝɹɐʇǝd ɟøɹ ʇɥᴉs sʇndǝnʇ ɐnd ʇɥǝn dɹøɔǝǝd.

source: Certificate Invalidation does not exist, Please refresh the page and try again.
rtl: ذثقفهبهذشفث هردشمهيشفهخر يخثس رخف ثطهسف, حمثشسث قثبقثسا فاث حشلث شري فقغ شلشهر.Ȼǝɹʇᴉɟᴉɔɐʇǝ Ɨnʌɐlᴉdɐʇᴉøn døǝs nøʇ ǝxᴉsʇ, Ᵽlǝɐsǝ ɹǝɟɹǝsɥ ʇɥǝ dɐƃǝ ɐnd ʇɹʎ ɐƃɐᴉn.

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Invalidate Certificate" button.
rtl: سفعيثرف عسثقرشوث/ثوشهم بهثمي هس قثضعهقثي شري ذشر رخف زث ثوحفغ. نهريمغ بهمم هر عسثقرشوث/ثوشهم شري فاثر حقثسس "هردشمهيشفث ذثقفهبهذشفث" زعففخر.Sʇndǝnʇ nsǝɹnɐɯǝ/ǝɯɐᴉl ɟᴉǝld ᴉs ɹǝbnᴉɹǝd ɐnd ɔɐn nøʇ bǝ ǝɯdʇʎ. Ꝁᴉndlʎ ɟᴉll ᴉn nsǝɹnɐɯǝ/ǝɯɐᴉl ɐnd ʇɥǝn dɹǝss "Ɨnʌɐlᴉdɐʇǝ Ȼǝɹʇᴉɟᴉɔɐʇǝ" bnʇʇøn.

source: The student {student} does not have certificate for the course {course}. Kindly verify student username/email and the selected course are correct and try again.
rtl: فاث سفعيثرف {student} يخثس رخف اشدث ذثقفهبهذشفث بخق فاث ذخعقسث {course}. نهريمغ دثقهبغ سفعيثرف عسثقرشوث/ثوشهم شري فاث سثمثذفثي ذخعقسث شقث ذخققثذف شري فقغ شلشهر.

source: Instructor
rtl: هرسفقعذفخقŦɥǝ sʇndǝnʇ {student} døǝs nøʇ ɥɐʌǝ ɔǝɹʇᴉɟᴉɔɐʇǝ ɟøɹ ʇɥǝ ɔønɹsǝ {course}. Ꝁᴉndlʎ ʌǝɹᴉɟʎ sʇndǝnʇ nsǝɹnɐɯǝ/ǝɯɐᴉl ɐnd ʇɥǝ sǝlǝɔʇǝd ɔønɹsǝ ɐɹǝ ɔøɹɹǝɔʇ ɐnd ʇɹʎ ɐƃɐᴉn.

source: To gain insights into student enrollment and participation {link_start}visit {analytics_dashboard_name}, our new course analytics product{link_end}.
rtl: فخ لشهر هرسهلافس هرفخ سفعيثرف ثرقخمموثرف شري حشقفهذهحشفهخر {link_start}دهسهف {analytics_dashboard_name}, خعق رثص ذخعقسث شرشمغفهذس حقخيعذف{link_end}.

source: Special Exams
rtl: سحثذهشم ثطشوسŦø ƃɐᴉn ᴉnsᴉƃɥʇs ᴉnʇø sʇndǝnʇ ǝnɹøllɯǝnʇ ɐnd dɐɹʇᴉɔᴉdɐʇᴉøn {link_start}ʌᴉsᴉʇ {analytics_dashboard_name}, ønɹ nǝʍ ɔønɹsǝ ɐnɐlʎʇᴉɔs dɹødnɔʇ{link_end}.

source: Certificates
rtl: ذثقفهبهذشفثس

source: Please Enter the numeric value for the course price
rtl: حمثشسث ثرفثق فاث رعوثقهذ دشمعث بخق فاث ذخعقسث حقهذث

source: CourseMode with the mode slug({mode_slug}) DoesNotExist
rtl: ذخعقسثوخيث صهفا فاث وخيث سمعل({mode_slug}) يخثسرخفثطهسف

source: CourseMode price updated successfully
rtl: ذخعقسثوخيث حقهذث عحيشفثي سعذذثسسبعممغ

source: Course Info
rtl: ذخعقسث هربخ

source: Enrollment data is now available in {dashboard_link}.
rtl: ثرقخمموثرف يشفش هس رخص شدشهمشزمث هر {dashboard_link}.

source: Membership
rtl: وثوزثقساهح

source: Cohorts
rtl: ذخاخقفس

source: Discussions
rtl: يهسذعسسهخرس

source: Student Admin
rtl: سفعيثرف شيوهر

source: Extensions
rtl: ثطفثرسهخرس

source: Data Download
rtl: يشفش يخصرمخشي

source: Analytics
rtl: شرشمغفهذس

source: Open Responses
rtl: خحثر قثسحخرسثس

source: 0 sent
rtl: 0 سثرف

source: {num_emails} sent
rtl: {num_emails} سثرف

source: {num_emails} failed
rtl: {num_emails} بشهمثي

source: Complete
rtl: ذخوحمثفث

source: Incomplete
rtl: هرذخوحمثفث

source: Could not find student matching identifier: {student_identifier}
rtl: ذخعمي رخف بهري سفعيثرف وشفذاهرل هيثرفهبهثق: {student_identifier}

source: Unable to parse date:
rtl: عرشزمث فخ حشقسث يشفث:

source: Couldn't find module for url: {0}
rtl: ذخعمير'ف بهري وخيعمث بخق عقم: {0}

source: Could not find student enrollment in the course.
rtl: ذخعمي رخف بهري سفعيثرف ثرقخمموثرف هر فاث ذخعقسث.

source: Unit {0} has no due date to extend.
rtl: عرهف {0} اشس رخ يعث يشفث فخ ثطفثري.

source: An extended due date must be later than the original due date.
rtl: شر ثطفثريثي يعث يشفث وعسف زث مشفثق فاشر فاث خقهلهرشم يعث يشفث.

source: Full Name
rtl: بعمم رشوث

source: Extended Due Date
rtl: ثطفثريثي يعث يشفث

source: Users with due date extensions for {0}
rtl: عسثقس صهفا يعث يشفث ثطفثرسهخرس بخق {0}

source: Due date extensions for {0} {1} ({2})
rtl: يعث يشفث ثطفثرسهخرس بخق {0} {1} ({2})

source: Requested task is already running
rtl: قثضعثسفثي فشسن هس شمقثشيغ قعررهرل

source: Error occured. Please try again later.
rtl: ثققخق خذذعقثي. حمثشسث فقغ شلشهر مشفثق.

source: detailed enrollment
rtl: يثفشهمثي ثرقخمموثرف

source: The {report_type} report is being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
rtl: فاث {report_type} قثحخقف هس زثهرل ذقثشفثي. فخ دهثص فاث سفشفعس خب فاث قثحخقف, سثث حثريهرل فشسنس زثمخص. غخع صهمم زث شزمث فخ يخصرمخشي فاث قثحخقف صاثر هف هس ذخوحمثفث.

source: This component cannot be rescored.
rtl: فاهس ذخوحخرثرف ذشررخف زث قثسذخقثي.

source: This component does not support score override.
rtl: فاهس ذخوحخرثرف يخثس رخف سعححخقف سذخقث خدثققهيث.

source: Scores must be between 0 and the value of the problem.
rtl: سذخقثس وعسف زث زثفصثثر 0 شري فاث دشمعث خب فاث حقخزمثو.

source: Not all problems in entrance exam support re-scoring.
rtl: رخف شمم حقخزمثوس هر ثرفقشرذث ثطشو سعححخقف قث-سذخقهرل.

source: An error has occurred. Task was not created.
rtl: شر ثققخق اشس خذذعققثي. فشسن صشس رخف ذقثشفثي.Ŧɥǝ {report_type} ɹǝdøɹʇ ᴉs bǝᴉnƃ ɔɹǝɐʇǝd. Ŧø ʌᴉǝʍ ʇɥǝ sʇɐʇns øɟ ʇɥǝ ɹǝdøɹʇ, sǝǝ Ᵽǝndᴉnƃ Ŧɐsʞs bǝløʍ. Ɏøn ʍᴉll bǝ ɐblǝ ʇø døʍnløɐd ʇɥǝ ɹǝdøɹʇ ʍɥǝn ᴉʇ ᴉs ɔøɯdlǝʇǝ.

source: rescored
rtl: قثسذخقثي

source: overridden
rtl: خدثققهييثر

source: reset
rtl: قثسثف

source: deleted
rtl: يثمثفثي

source: emailed
rtl: ثوشهمثي

source: graded
rtl: لقشيثي

source: problem distribution graded
rtl: حقخزمثو يهسفقهزعفهخر لقشيثي

source: certificates generated
rtl: ذثقفهبهذشفثس لثرثقشفثي

source: cohorted
rtl: ذخاخقفثي

source: generate_anonymized_id
rtl: لثرثقشفث_شرخرغوهظثي_هي

source: compressed
rtl: ذخوحقثسسثي

source: No status information available
rtl: رخ سفشفعس هربخقوشفهخر شدشهمشزمث

source: No task_output information found for instructor_task {0}
rtl: رخ فشسن_خعفحعف هربخقوشفهخر بخعري بخق هرسفقعذفخق_فشسن {0}

source: No parsable task_output information found for instructor_task {0}: {1}
rtl: رخ حشقسشزمث فشسن_خعفحعف هربخقوشفهخر بخعري بخق هرسفقعذفخق_فشسن {0}: {1}

source: No parsable status information available
rtl: رخ حشقسشزمث سفشفعس هربخقوشفهخر شدشهمشزمث

source: No message provided
rtl: رخ وثسسشلث حقخدهيثيNø dɐɹsɐblǝ ʇɐsʞ_ønʇdnʇ ᴉnɟøɹɯɐʇᴉøn ɟønnd ɟøɹ ᴉnsʇɹnɔʇøɹ_ʇɐsʞ {0}: {1}

source: Invalid task_output information found for instructor_task {0}: {1}
rtl: هردشمهي فشسن_خعفحعف هربخقوشفهخر بخعري بخق هرسفقعذفخق_فشسن {0}: {1}

source: No progress status information available
rtl: رخ حقخلقثسس سفشفعس هربخقوشفهخر شدشهمشزمث

source: No parsable task_input information found for instructor_task {0}: {1}
rtl: رخ حشقسشزمث فشسن_هرحعف هربخقوشفهخر بخعري بخق هرسفقعذفخق_فشسن {0}: {1}

source: Progress: {action} {succeeded} of {attempted} so far
rtl: حقخلقثسس: {action} {succeeded} خب {attempted} سخ بشق

source: Unable to find submission to be {action} for student '{student}'
rtl: عرشزمث فخ بهري سعزوهسسهخر فخ زث {action} بخق سفعيثرف '{student}'

source: Problem failed to be {action} for student '{student}'
rtl: حقخزمثو بشهمثي فخ زث {action} بخق سفعيثرف '{student}'

source: Problem successfully {action} for student '{student}'
rtl: حقخزمثو سعذذثسسبعممغ {action} بخق سفعيثرف '{student}'

source: Unable to find entrance exam submission to be {action} for student '{student}'
rtl: عرشزمث فخ بهري ثرفقشرذث ثطشو سعزوهسسهخر فخ زث {action} بخق سفعيثرف Ʉnɐblǝ ʇø ɟᴉnd ǝnʇɹɐnɔǝ ǝxɐɯ snbɯᴉssᴉøn ʇø bǝ {action} ɟøɹ sʇndǝnʇ '{student}'

source: Entrance exam successfully {action} for student '{student}'
rtl: ثرفقشرذث ثطشو سعذذثسسبعممغ {action} بخق سفعيثرف '{student}'

source: Unable to find any students with submissions to be {action}
rtl: عرشزمث فخ بهري شرغ سفعيثرفس صهفا سعزوهسسهخرس فخ زث {action}

source: Problem failed to be {action} for any of {attempted} students
rtl: حقخزمثو بشهمثي فخ زث {action} بخق شرغ خب {attempted} سفعيثرفس

source: Problem successfully {action} for {attempted} students
rtl: حقخزمثو سعذذثسسبعممغ {action} بخق {attempted} سفعيثرفس

source: Problem {action} for {succeeded} of {attempted} students
rtl: حقخزمثو {action} بخق {succeeded} خب {attempted} سفعيثرفس

source: Unable to find any recipients to be {action}
rtl: عرشزمث فخ بهري شرغ قثذهحهثرفس فخ زث {action}

source: Message failed to be {action} for any of {attempted} recipients
rtl: وثسسشلث بشهمثي فخ زث {action} بخق شرغ خب {attempted} قثذهحهثرفس

source: Message successfully {action} for {attempted} recipients
rtl: وثسسشلث سعذذثسسبعممغ {action} بخق {attempted} قثذهحهثرفس

source: Message {action} for {succeeded} of {attempted} recipients
rtl: وثسسشلث {action} بخق {succeeded} خب {attempted} قثذهحهثرفس

source: Status: {action} {succeeded} of {attempted}
rtl: سفشفعس: {action} {succeeded} خب {attempted}

source: (skipping {skipped})
rtl: (سنهححهرل {skipped})

source: (out of {total})
rtl: (خعف خب {total})

source: Programs
rtl: حقخلقشوس

source: Program Details
rtl: حقخلقشو يثفشهمس

source: This component's access settings refer to deleted or invalid group configurations.
rtl: فاهس ذخوحخرثرف'س شذذثسس سثففهرلس قثبثق فخ يثمثفثي خق هردشمهي لقخعح ذخربهلعقشفهخرس.Ŧɥᴉs ɔøɯdønǝnʇ's ɐɔɔǝss sǝʇʇᴉnƃs ɹǝɟǝɹ ʇø dǝlǝʇǝd øɹ ᴉnʌɐlᴉd ƃɹønd ɔønɟᴉƃnɹɐʇᴉøns.

source: This unit's access settings refer to deleted or invalid group configurations.
rtl: فاهس عرهف'س شذذثسس سثففهرلس قثبثق فخ يثمثفثي خق هردشمهي لقخعح ذخربهلعقشفهخرس.

source: This component's access settings refer to deleted or invalid groups.
rtl: فاهس ذخوحخرثرف'س شذذثسس سثففهرلس قثبثق فخ يثمثفثي خق هردشمهي لقخعحس.

source: This unit's access settings refer to deleted or invalid groups.
rtl: فاهس عرهف'س شذذثسس سثففهرلس قثبثق فخ يثمثفثي خق هردشمهي لقخعحس.Ŧɥᴉs nnᴉʇ's ɐɔɔǝss sǝʇʇᴉnƃs ɹǝɟǝɹ ʇø dǝlǝʇǝd øɹ ᴉnʌɐlᴉd ƃɹønd ɔønɟᴉƃnɹɐʇᴉøns.

source: This component's access settings contradict its parent's access settings.
rtl: فاهس ذخوحخرثرف'س شذذثسس سثففهرلس ذخرفقشيهذف هفس حشقثرف'س شذذثسس سثففهرلس.

source: Whether to display this module in the table of contents
rtl: صاثفاثق فخ يهسحمشغ فاهس وخيعمث هر فاث فشزمث خب ذخرفثرفسŦɥᴉs ɔøɯdønǝnʇ's ɐɔɔǝss sǝʇʇᴉnƃs ɔønʇɹɐdᴉɔʇ ᴉʇs dɐɹǝnʇ's ɐɔɔǝss sǝʇʇᴉnƃs.

source: What format this module is in (used for deciding which grader to apply, and what to show in the TOC)
rtl: صاشف بخقوشف فاهس وخيعمث هس هر (عسثي بخق يثذهيهرل صاهذا لقشيثق فخ شححمغ, شري صاشف فخ ساخص هر فاث فخذ)

source: Course Chrome
rtl: ذخعقسث ذاقخوثWɥɐʇ ɟøɹɯɐʇ ʇɥᴉs ɯødnlǝ ᴉs ᴉn (nsǝd ɟøɹ dǝɔᴉdᴉnƃ ʍɥᴉɔɥ ƃɹɐdǝɹ ʇø ɐddlʎ, ɐnd ʍɥɐʇ ʇø sɥøʍ ᴉn ʇɥǝ ŦØȻ)

source: Enter the chrome, or navigation tools, to use for the XBlock in the LMS. Valid values are: "chromeless" -- to not use tabs or the accordion; "tabs" -- to use tabs only; "accordion" -- to use the accordion only; or "tabs,accordion" -- to use tabs and the accordion.
rtl: ثرفثق فاث ذاقخوث, خق رشدهلشفهخر فخخمس, فخ عسث بخق فاث طزمخذن هر فاث موس. دشمهي دشمعثس شقث: "ذاقخوثمثسس" -- فخ رخف عسث فشزس خق فاث شذذخقيهخر; "فشزس" -- فخ عسث فشزس خرمغ; "شذذخقيهخر" -- فخ عسث فاث شذذخقيهخر خرمغ; خق "فشزس,شذذخقيهخر" -- فخ عسث فشزس شري فاث شذذخقيهخر.

source: Default Tab
rtl: يثبشعمف فشزɆnʇǝɹ ʇɥǝ ɔɥɹøɯǝ, øɹ nɐʌᴉƃɐʇᴉøn ʇøøls, ʇø nsǝ ɟøɹ ʇɥǝ XɃløɔʞ ᴉn ʇɥǝ ŁMS. Vɐlᴉd ʌɐlnǝs ɐɹǝ: "ɔɥɹøɯǝlǝss" -- ʇø nøʇ nsǝ ʇɐbs øɹ ʇɥǝ ɐɔɔøɹdᴉøn; "ʇɐbs" -- ʇø nsǝ ʇɐbs ønlʎ; "ɐɔɔøɹdᴉøn" -- ʇø nsǝ ʇɥǝ ɐɔɔøɹdᴉøn ønlʎ; øɹ "ʇɐbs,ɐɔɔøɹdᴉøn" -- ʇø nsǝ ʇɐbs ɐnd ʇɥǝ ɐɔɔøɹdᴉøn.

source: Enter the tab that is selected in the XBlock. If not set, the Course tab is selected.
rtl: ثرفثق فاث فشز فاشف هس سثمثذفثي هر فاث طزمخذن. هب رخف سثف, فاث ذخعقسث فشز هس سثمثذفثي.

source: LaTeX Source File Name
rtl: مشفثط سخعقذث بهمث رشوث

source: Enter the source file name for LaTeX.
rtl: ثرفثق فاث سخعقذث بهمث رشوث بخق مشفثط.Ɇnʇǝɹ ʇɥǝ ʇɐb ʇɥɐʇ ᴉs sǝlǝɔʇǝd ᴉn ʇɥǝ XɃløɔʞ. Ɨɟ nøʇ sǝʇ, ʇɥǝ Ȼønɹsǝ ʇɐb ᴉs sǝlǝɔʇǝd.

source: A dictionary that maps which groups can be shown this block. The keys are group configuration ids and the values are a list of group IDs. If there is no key for a group configuration or if the set of group IDs is empty then the block is considered visible to all. Note that this field is ignored if the block is visible_to_staff_only.
rtl: ش يهذفهخرشقغ فاشف وشحس صاهذا لقخعحس ذشر زث ساخصر فاهس زمخذن. فاث نثغس شقث لقخعح ذخربهلعقشفهخر هيس شري فاث دشمعثس شقث ش مهسف خب لقخعح هيس. هب فاثقث هس رخ نثغ بخق ش لقخعح ذخربهلعقشفهخر خق هب فاث سثف خب لقخعح هيس هس ثوحفغ فاثر فاث زمخذن هس ذخرسهيثقثي دهسهزمث فخ شمم. رخفث فاشف فاهس بهثمي هس هلرخقثي هب فاث زمخذن هس دهسهزمث_فخ_سفشبب_خرمغ.

source: One of user or external_user_key must not be null.
rtl: خرث خب عسثق خق ثطفثقرشم_عسثق_نثغ وعسف رخف زث رعمم.

source: View and regenerate certificates.
rtl: دهثص شري قثلثرثقشفث ذثقفهبهذشفثس.Ⱥ dᴉɔʇᴉønɐɹʎ ʇɥɐʇ ɯɐds ʍɥᴉɔɥ ƃɹønds ɔɐn bǝ sɥøʍn ʇɥᴉs bløɔʞ. Ŧɥǝ ʞǝʎs ɐɹǝ ƃɹønd ɔønɟᴉƃnɹɐʇᴉøn ᴉds ɐnd ʇɥǝ ʌɐlnǝs ɐɹǝ ɐ lᴉsʇ øɟ ƃɹønd ƗĐs. Ɨɟ ʇɥǝɹǝ ᴉs nø ʞǝʎ ɟøɹ ɐ ƃɹønd ɔønɟᴉƃnɹɐʇᴉøn øɹ ᴉɟ ʇɥǝ sǝʇ øɟ ƃɹønd ƗĐs ᴉs ǝɯdʇʎ ʇɥǝn ʇɥǝ bløɔʞ ᴉs ɔønsᴉdǝɹǝd ʌᴉsᴉblǝ ʇø ɐll. Nøʇǝ ʇɥɐʇ ʇɥᴉs ɟᴉǝld ᴉs ᴉƃnøɹǝd ᴉɟ ʇɥǝ bløɔʞ ᴉs ʌᴉsᴉblǝ_ʇø_sʇɐɟɟ_ønlʎ.

source: Enrollment
rtl: ثرقخمموثرف

source: View and update learner enrollments.
rtl: دهثص شري عحيشفث مثشقرثق ثرقخمموثرفس.

source: Manage User
rtl: وشرشلث عسثق

source: Disable User Account
rtl: يهسشزمث عسثق شذذخعرف

source: Entitlements
rtl: ثرفهفمثوثرفس

source: View, create, and reissue learner entitlements
rtl: دهثص, ذقثشفث, شري قثهسسعث مثشقرثق ثرفهفمثوثرفس

source: Feature Based Enrollments
rtl: بثشفعقث زشسثي ثرقخمموثرفس

source: View feature based enrollment settings
rtl: دهثص بثشفعقث زشسثي ثرقخمموثرف سثففهرلس

source: Link Program Enrollments
rtl: مهرن حقخلقشو ثرقخمموثرفس

source: Link LMS users to program enrollments
rtl: مهرن موس عسثقس فخ حقخلقشو ثرقخمموثرفس

source: Program Enrollments Inspector Tool
rtl: حقخلقشو ثرقخمموثرفس هرسحثذفخق فخخم

source: Find information related to a learner's program enrollments
rtl: بهري هربخقوشفهخر قثمشفثي فخ ش مثشقرثق'س حقخلقشو ثرقخمموثرفس

source: username
rtl: عسثقرشوث

source: user_support_url
rtl: عسثق_سعححخقف_عقم

source: user_detail_url
rtl: عسثق_يثفشهم_عقم

source: Usable
rtl: عسشزمث

source: Unusable
rtl: عرعسشزمث

source: User Enabled Successfully
rtl: عسثق ثرشزمثي سعذذثسسبعممغ

source: User Disabled Successfully
rtl: عسثق يهسشزمثي سعذذثسسبعممغ

source: You must complete a survey
rtl: غخع وعسف ذخوحمثفث ش سعقدثغ

source: Optional language the team uses as ISO 639-1 code.
rtl: خحفهخرشم مشرلعشلث فاث فثشو عسثس شس هسخ 639-1 ذخيث.

source: Teams
rtl: فثشوس

source: Leverage teams to allow learners to connect by topic of interest.
rtl: مثدثقشلث فثشوس فخ شممخص مثشقرثقس فخ ذخررثذف زغ فخحهذ خب هرفثقثسف.

source: course_id must be provided
rtl: ذخعقسث_هي وعسف زث حقخدهيثي

source: The supplied course id {course_id} is not valid.
rtl: فاث سعححمهثي ذخعقسث هي {course_id} هس رخف دشمهي.

source: text_search and order_by cannot be provided together
rtl: فثطف_سثشقذا شري خقيثق_زغ ذشررخف زث حقخدهيثي فخلثفاثق

source: The supplied topic id {topic_id} is not valid
rtl: فاث سعححمهثي فخحهذ هي {topic_id} هس رخف دشمهي

source: Error connecting to elasticsearch
rtl: ثققخق ذخررثذفهرل فخ ثمشسفهذسثشقذا

source: The ordering {ordering} is not supported
rtl: فاث خقيثقهرل {ordering} هس رخف سعححخقفثي

source: The supplied course_id {course_id} is not valid.
rtl: فاث سعححمهثي ذخعقسث_هي {course_id} هس رخف دشمهي.

source: topic_id is required
rtl: فخحهذ_هي هس قثضعهقثي

source: You can't create a team in an instructor managed topic.
rtl: غخع ذشر'ف ذقثشفث ش فثشو هر شر هرسفقعذفخق وشرشلثي فخحهذ.

source: You are already in a team in this teamset.
rtl: غخع شقث شمقثشيغ هر ش فثشو هر فاهس فثشوسثف.

source: teamset_id and team_id are mutually exclusive options.
rtl: فثشوسثف_هي شري فثشو_هي شقث وعفعشممغ ثطذمعسهدث خحفهخرس.

source: teamset_id requires course_id to also be provided.
rtl: فثشوسثف_هي قثضعهقثس ذخعقسث_هي فخ شمسخ زث حقخدهيثي.

source: No teamset found in given course with given id
rtl: رخ فثشوسثف بخعري هر لهدثر ذخعقسث صهفا لهدثر هي

source: username or (team_id or teamset_id) must be specified.
rtl: عسثقرشوث خق (فثشو_هي خق فثشوسثف_هي) وعسف زث سحثذهبهثي.

source: Username is required.
rtl: عسثقرشوث هس قثضعهقثي.

source: Team id is required.
rtl: فثشو هي هس قثضعهقثي.

source: This team is already full.
rtl: فاهس فثشو هس شمقثشيغ بعمم.

source: You can't join an instructor managed team.
rtl: غخع ذشر'ف تخهر شر هرسفقعذفخق وشرشلثي فثشو.

source: The user {username} is already a member of a team in this teamset.
rtl: فاث عسثق {username} هس شمقثشيغ ش وثوزثق خب ش فثشو هر فاهس فثشوسثف.

source: The user {username} is not enrolled in the course associated with this team.
rtl: فاث عسثق {username} هس رخف ثرقخممثي هر فاث ذخعقسث شسسخذهشفثي صهفا فاهس فثشو.

source: You can't leave an instructor managed team.
rtl: غخع ذشر'ف مثشدث شر هرسفقعذفخق وشرشلثي فثشو.

source: The course for which this deadline applies
rtl: فاث ذخعقسث بخق صاهذا فاهس يثشيمهرث شححمهثسŦɥǝ nsǝɹ {username} ᴉs nøʇ ǝnɹøllǝd ᴉn ʇɥǝ ɔønɹsǝ ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʇɥᴉs ʇǝɐɯ.

source: Show existing user tour
rtl: Sɥøʍ ǝxᴉsʇᴉnƃ nsǝɹ ʇønɹ

source: Show new user tour
rtl: Sɥøʍ nǝʍ nsǝɹ ʇønɹ

source: Do not show user tour
rtl: Đø nøʇ sɥøʍ nsǝɹ ʇønɹ

source: The datetime after which users are no longer allowed to submit photos for verification.
rtl: فاث يشفثفهوث شبفثق صاهذا عسثقس شقث رخ مخرلثق شممخصثي فخ سعزوهف حاخفخس بخق دثقهبهذشفهخر.Ŧɥǝ dɐʇǝʇᴉɯǝ ɐɟʇǝɹ ʍɥᴉɔɥ nsǝɹs ɐɹǝ nø lønƃǝɹ ɐlløʍǝd ʇø snbɯᴉʇ dɥøʇøs ɟøɹ ʌǝɹᴉɟᴉɔɐʇᴉøn.

source: Your {platform_name} verification has expired.
rtl: غخعق {platform_name} دثقهبهذشفهخر اشس ثطحهقثي.

source: Intro
rtl: هرفقخ

source: Make payment
rtl: وشنث حشغوثرف

source: Take photo
rtl: فشنث حاخفخ

source: Take a photo of your ID
rtl: فشنث ش حاخفخ خب غخعق هي

source: Review your info
rtl: قثدهثص غخعق هربخ

source: Enrollment confirmation
rtl: ثرقخمموثرف ذخربهقوشفهخر

source: Selected price is not valid number.
rtl: سثمثذفثي حقهذث هس رخف دشمهي رعوزثق.

source: This course doesn't support paid certificates
rtl: فاهس ذخعقسث يخثسر'ف سعححخقف حشهي ذثقفهبهذشفثس

source: No selected price or selected price is below minimum.
rtl: رخ سثمثذفثي حقهذث خق سثمثذفثي حقهذث هس زثمخص وهرهوعو.

source: Photo ID image is required if the user does not have an initial verification attempt.
rtl: حاخفخ هي هوشلث هس قثضعهقثي هب فاث عسثق يخثس رخف اشدث شر هرهفهشم دثقهبهذشفهخر شففثوحف.

source: Missing required parameter face_image
rtl: وهسسهرل قثضعهقثي حشقشوثفثق بشذث_هوشلث

source: No profile found for user
rtl: رخ حقخبهمث بخعري بخق عسثق

source: Name must be at least {min_length} character long.
rtl: رشوث وعسف زث شف مثشسف {min_length} ذاشقشذفثق مخرل.

source: Image data is in an unsupported format.
rtl: هوشلث يشفش هس هر شر عرسعححخقفثي بخقوشف.

source: Image data is not valid.
rtl: هوشلث يشفش هس رخف دشمهي.Ᵽɥøʇø ƗĐ ᴉɯɐƃǝ ᴉs ɹǝbnᴉɹǝd ᴉɟ ʇɥǝ nsǝɹ døǝs nøʇ ɥɐʌǝ ɐn ᴉnᴉʇᴉɐl ʌǝɹᴉɟᴉɔɐʇᴉøn ɐʇʇǝɯdʇ.

source: Your {platform_name} ID verification was approved!
rtl: غخعق {platform_name} هي دثقهبهذشفهخر صشس شححقخدثي!

source: Your {platform_name} Verification Has Been Denied
rtl: غخعق {platform_name} دثقهبهذشفهخر اشس زثثر يثرهثي

source: Please correct the errors below.
rtl: حمثشسث ذخققثذف فاث ثققخقس زثمخص.

source: Are you sure you want to cancel retirement for user "%(username)s"?
rtl: شقث غخع سعقث غخع صشرف فخ ذشرذثم قثفهقثوثرف بخق عسثق "%(username)s"?

source: This email was automatically sent from %(platform_name)s.
rtl: Ŧɥᴉs ǝɯɐᴉl ʍɐs ɐnʇøɯɐʇᴉɔɐllʎ sǝnʇ ɟɹøɯ %(platform_name)s.

source: You are receiving this email at address %(email)s because you are enrolled in
rtl: Ɏøn ɐɹǝ ɹǝɔǝᴉʌᴉnƃ ʇɥᴉs ǝɯɐᴉl ɐʇ ɐddɹǝss %(email)s bǝɔɐnsǝ ʎøn ɐɹǝ ǝnɹøllǝd ᴉn

source: To stop receiving email like this, update your course email settings
rtl: Ŧø sʇød ɹǝɔǝᴉʌᴉnƃ ǝɯɐᴉl lᴉʞǝ ʇɥᴉs, nddɐʇǝ ʎønɹ ɔønɹsǝ ǝɯɐᴉl sǝʇʇᴉnƃs

source: here
rtl: ɥǝɹǝ

source: unsubscribe
rtl: nnsnbsɔɹᴉbǝ

source: This email was automatically sent from %(platform_name)s.
rtl: Ŧɥᴉs ǝɯɐᴉl ʍɐs ɐnʇøɯɐʇᴉɔɐllʎ sǝnʇ ɟɹøɯ %(platform_name)s.

source: You are receiving this email at address %(email)s because you are enrolled in %(course_title)s.
rtl: Ɏøn ɐɹǝ ɹǝɔǝᴉʌᴉnƃ ʇɥᴉs ǝɯɐᴉl ɐʇ ɐddɹǝss %(email)s bǝɔɐnsǝ ʎøn ɐɹǝ ǝnɹøllǝd ᴉn %(course_title)s.

source: To stop receiving email like this, update your course email settings here %(email_settings_url)s
rtl: Ŧø sʇød ɹǝɔǝᴉʌᴉnƃ ǝɯɐᴉl lᴉʞǝ ʇɥᴉs, nddɐʇǝ ʎønɹ ɔønɹsǝ ǝɯɐᴉl sǝʇʇᴉnƃs ɥǝɹǝ %(email_settings_url)s

source: To unsubscribe click here %(unsubscribe_link)s
rtl: Ŧø nnsnbsɔɹᴉbǝ ɔlᴉɔʞ ɥǝɹǝ %(unsubscribe_link)s

source: Welcome to %(course_name)s
rtl: صثمذخوث فخ %(course_name)s

source: To get started, please visit https://%(site_name)s.
rtl: فخ لثف سفشقفثي, حمثشسث دهسهف اففحس://%(site_name)s.
